ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
@ STM32F4

.equ FLASH_BASE            ,0x08000000  @< FLASH(up to 1 MB) base address in the alias region                         */
.equ CCMDATARAM_BASE       ,0x10000000  @< CCM(core coupled memory) data RAM(64 KB) base address in the alias region  */
.equ SRAM1_BASE            ,0x20000000  @< SRAM1(112 KB) base address in the alias region                             */
.equ SRAM2_BASE            ,0x2001C000  @< SRAM2(16 KB) base address in the alias region                              */
.equ PERIPH_BASE           ,0x40000000  @< Peripheral base address in the alias region                                */
.equ BKPSRAM_BASE          ,0x40024000  @< Backup SRAM(4 KB) base address in the alias region                         */
.equ FSMC_R_BASE           ,0xA0000000  @< FSMC registers base address                                                */

.equ CCMDATARAM_BB_BASE    ,0x12000000  @< CCM(core coupled memory) data RAM(64 KB) base address in the bit-band region  */
.equ SRAM1_BB_BASE         ,0x22000000  @< SRAM1(112 KB) base address in the bit-band region                             */
.equ SRAM2_BB_BASE         ,0x2201C000  @< SRAM2(16 KB) base address in the bit-band region                              */
.equ PERIPH_BB_BASE        ,0x42000000  @< Peripheral base address in the bit-band region                                */
.equ BKPSRAM_BB_BASE       ,0x42024000  @< Backup SRAM(4 KB) base address in the bit-band region                         */

@ Legacy defines */
.equ SRAM_BASE            ,SRAM1_BASE
.equ SRAM_BB_BASE         ,SRAM1_BB_BASE


@< Peripheral memory map */
.equ APB1PERIPH_BASE       ,0x00000000
.equ APB2PERIPH_BASE       ,0x00010000
.equ AHB1PERIPH_BASE       ,0x00020000
.equ AHB2PERIPH_BASE       ,0x10000000

@< APB1 peripherals */
.equ TIM2_BASE             ,(APB1PERIPH_BASE + 0x0000)
.equ TIM3_BASE             ,(APB1PERIPH_BASE + 0x0400)
.equ TIM4_BASE             ,(APB1PERIPH_BASE + 0x0800)
.equ TIM5_BASE             ,(APB1PERIPH_BASE + 0x0C00)
.equ TIM6_BASE             ,(APB1PERIPH_BASE + 0x1000)
.equ TIM7_BASE             ,(APB1PERIPH_BASE + 0x1400)
.equ TIM12_BASE            ,(APB1PERIPH_BASE + 0x1800)
.equ TIM13_BASE            ,(APB1PERIPH_BASE + 0x1C00)
.equ TIM14_BASE            ,(APB1PERIPH_BASE + 0x2000)
.equ RTC_BASE              ,(APB1PERIPH_BASE + 0x2800)
.equ WWDG_BASE             ,(APB1PERIPH_BASE + 0x2C00)
.equ IWDG_BASE             ,(APB1PERIPH_BASE + 0x3000)
.equ I2S2ext_BASE          ,(APB1PERIPH_BASE + 0x3400)
.equ SPI2_BASE             ,(APB1PERIPH_BASE + 0x3800)
.equ SPI3_BASE             ,(APB1PERIPH_BASE + 0x3C00)
.equ I2S3ext_BASE          ,(APB1PERIPH_BASE + 0x4000)
.equ USART2_BASE           ,(APB1PERIPH_BASE + 0x4400)
.equ USART3_BASE           ,(APB1PERIPH_BASE + 0x4800)
.equ UART4_BASE            ,(APB1PERIPH_BASE + 0x4C00)
.equ UART5_BASE            ,(APB1PERIPH_BASE + 0x5000)
.equ I2C1_BASE             ,(APB1PERIPH_BASE + 0x5400)
.equ I2C2_BASE             ,(APB1PERIPH_BASE + 0x5800)
.equ I2C3_BASE             ,(APB1PERIPH_BASE + 0x5C00)
.equ CAN1_BASE             ,(APB1PERIPH_BASE + 0x6400)
.equ CAN2_BASE             ,(APB1PERIPH_BASE + 0x6800)
.equ PWR_BASE              ,(APB1PERIPH_BASE + 0x7000)
.equ DAC_BASE              ,(APB1PERIPH_BASE + 0x7400)

@< APB2 peripherals */
.equ TIM1_BASE             ,(APB2PERIPH_BASE + 0x0000)
.equ TIM8_BASE             ,(APB2PERIPH_BASE + 0x0400)
.equ USART1_BASE           ,(APB2PERIPH_BASE + 0x1000)
.equ USART6_BASE           ,(APB2PERIPH_BASE + 0x1400)
.equ ADC1_BASE             ,(APB2PERIPH_BASE + 0x2000)
.equ ADC2_BASE             ,(APB2PERIPH_BASE + 0x2100)
.equ ADC3_BASE             ,(APB2PERIPH_BASE + 0x2200)
.equ ADC_BASE              ,(APB2PERIPH_BASE + 0x2300)
.equ SDIO_BASE             ,(APB2PERIPH_BASE + 0x2C00)
.equ SPI1_BASE             ,(APB2PERIPH_BASE + 0x3000)
.equ SYSCFG_BASE           ,(APB2PERIPH_BASE + 0x3800)
.equ EXTI_BASE             ,(APB2PERIPH_BASE + 0x3C00)
.equ TIM9_BASE             ,(APB2PERIPH_BASE + 0x4000)
.equ TIM10_BASE            ,(APB2PERIPH_BASE + 0x4400)
.equ TIM11_BASE            ,(APB2PERIPH_BASE + 0x4800)

@< AHB1 peripherals */
.equ GPIOA_BASE            ,(AHB1PERIPH_BASE + 0x0000)
.equ GPIOB_BASE            ,(AHB1PERIPH_BASE + 0x0400)
.equ GPIOC_BASE            ,(AHB1PERIPH_BASE + 0x0800)
.equ GPIOD_BASE            ,(AHB1PERIPH_BASE + 0x0C00)
.equ GPIOE_BASE            ,(AHB1PERIPH_BASE + 0x1000)
.equ GPIOF_BASE            ,(AHB1PERIPH_BASE + 0x1400)
.equ GPIOG_BASE            ,(AHB1PERIPH_BASE + 0x1800)
.equ GPIOH_BASE            ,(AHB1PERIPH_BASE + 0x1C00)
.equ GPIOI_BASE            ,(AHB1PERIPH_BASE + 0x2000)
.equ CRC_BASE              ,(AHB1PERIPH_BASE + 0x3000)
.equ RCC_BASE              ,(AHB1PERIPH_BASE + 0x3800)
.equ FLASH_R_BASE          ,(AHB1PERIPH_BASE + 0x3C00)
.equ DMA1_BASE             ,(AHB1PERIPH_BASE + 0x6000)
.equ DMA1_Stream0_BASE     ,(DMA1_BASE + 0x010)
.equ DMA1_Stream1_BASE     ,(DMA1_BASE + 0x028)
.equ DMA1_Stream2_BASE     ,(DMA1_BASE + 0x040)
.equ DMA1_Stream3_BASE     ,(DMA1_BASE + 0x058)
.equ DMA1_Stream4_BASE     ,(DMA1_BASE + 0x070)
.equ DMA1_Stream5_BASE     ,(DMA1_BASE + 0x088)
.equ DMA1_Stream6_BASE     ,(DMA1_BASE + 0x0A0)
.equ DMA1_Stream7_BASE     ,(DMA1_BASE + 0x0B8)
.equ DMA2_BASE             ,(AHB1PERIPH_BASE + 0x6400)
.equ DMA2_Stream0_BASE     ,(DMA2_BASE + 0x010)
.equ DMA2_Stream1_BASE     ,(DMA2_BASE + 0x028)
.equ DMA2_Stream2_BASE     ,(DMA2_BASE + 0x040)
.equ DMA2_Stream3_BASE     ,(DMA2_BASE + 0x058)
.equ DMA2_Stream4_BASE     ,(DMA2_BASE + 0x070)
.equ DMA2_Stream5_BASE     ,(DMA2_BASE + 0x088)
.equ DMA2_Stream6_BASE     ,(DMA2_BASE + 0x0A0)
.equ DMA2_Stream7_BASE     ,(DMA2_BASE + 0x0B8)
.equ ETH_BASE              ,(AHB1PERIPH_BASE + 0x8000)
.equ ETH_MAC_BASE          ,(ETH_BASE)
.equ ETH_MMC_BASE          ,(ETH_BASE + 0x0100)
.equ ETH_PTP_BASE          ,(ETH_BASE + 0x0700)
.equ ETH_DMA_BASE          ,(ETH_BASE + 0x1000)

@< AHB2 peripherals */
.equ DCMI_BASE             ,(AHB2PERIPH_BASE + 0x50000)
.equ CRYP_BASE             ,(AHB2PERIPH_BASE + 0x60000)
.equ HASH_BASE             ,(AHB2PERIPH_BASE + 0x60400)
.equ RNG_BASE              ,(AHB2PERIPH_BASE + 0x60800)

@< FSMC Bankx registers base address */
.equ FSMC_Bank1_R_BASE     ,(FSMC_R_BASE + 0x0000)
.equ FSMC_Bank1E_R_BASE    ,(FSMC_R_BASE + 0x0104)
.equ FSMC_Bank2_R_BASE     ,(FSMC_R_BASE + 0x0060)
.equ FSMC_Bank3_R_BASE     ,(FSMC_R_BASE + 0x0080)
.equ FSMC_Bank4_R_BASE     ,(FSMC_R_BASE + 0x00A0)

