ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
@ Debug MCU registers base address */
.equ DBGMCU_BASE           ,0xE0042000

@***********************************************
@*                                             *
@*  Peripheral_declaration                     *
@*                                             *
@***********************************************  
.equ TIM2                , TIM2_BASE
.equ TIM3                , TIM3_BASE
.equ TIM4                , TIM4_BASE
.equ TIM5                , TIM5_BASE
.equ TIM6                , TIM6_BASE
.equ TIM7                , TIM7_BASE
.equ TIM12               , TIM12_BASE
.equ TIM13               , TIM13_BASE
.equ TIM14               , TIM14_BASE
.equ RTC                 , RTC_BASE
.equ WWDG                , WWDG_BASE
.equ IWDG                , IWDG_BASE
.equ I2S2ext             , I2S2ext_BASE
.equ SPI2                , SPI2_BASE
.equ SPI3                , SPI3_BASE
.equ I2S3ext             , I2S3ext_BASE
.equ USART2              , USART2_BASE
.equ USART3              , USART3_BASE
.equ UART4               , UART4_BASE
.equ UART5               , UART5_BASE
.equ I2C1                , I2C1_BASE
.equ I2C2                , I2C2_BASE
.equ I2C3                , I2C3_BASE
.equ CAN1                , CAN1_BASE
.equ CAN2                , CAN2_BASE
.equ PWR                 , PWR_BASE
.equ DAC                 , DAC_BASE
.equ TIM1                , TIM1_BASE
.equ TIM8                , TIM8_BASE
.equ USART1              , USART1_BASE
.equ USART6              , USART6_BASE
.equ ADC                 , ADC_BASE
.equ ADC1                , ADC1_BASE
.equ ADC2                , ADC2_BASE
.equ ADC3                , ADC3_BASE
.equ SDIO                , SDIO_BASE
.equ SPI1                , SPI1_BASE
.equ SYSCFG              , SYSCFG_BASE
.equ EXTI                , EXTI_BASE
.equ TIM9                , TIM9_BASE
.equ TIM10               , TIM10_BASE
.equ TIM11               , TIM11_BASE
.equ GPIOA               , GPIOA_BASE
.equ GPIOB               , GPIOB_BASE
.equ GPIOC               , GPIOC_BASE
.equ GPIOD               , GPIOD_BASE
.equ GPIOE               , GPIOE_BASE
.equ GPIOF               , GPIOF_BASE
.equ GPIOG               , GPIOG_BASE
.equ GPIOH               , GPIOH_BASE
.equ GPIOI               , GPIOI_BASE
.equ CRC                 , CRC_BASE
.equ RCC                 , RCC_BASE
.equ FLASH               , FLASH_R_BASE
.equ DMA1                , DMA1_BASE
.equ DMA1_Stream0        , DMA1_Stream0_BASE
.equ DMA1_Stream1        , DMA1_Stream1_BASE
.equ DMA1_Stream2        , DMA1_Stream2_BASE
.equ DMA1_Stream3        , DMA1_Stream3_BASE
.equ DMA1_Stream4        , DMA1_Stream4_BASE
.equ DMA1_Stream5        , DMA1_Stream5_BASE
.equ DMA1_Stream6        , DMA1_Stream6_BASE
.equ DMA1_Stream7        , DMA1_Stream7_BASE
.equ DMA2                , DMA2_BASE
.equ DMA2_Stream0        , DMA2_Stream0_BASE
.equ DMA2_Stream1        , DMA2_Stream1_BASE
.equ DMA2_Stream2        , DMA2_Stream2_BASE
.equ DMA2_Stream3        , DMA2_Stream3_BASE
.equ DMA2_Stream4        , DMA2_Stream4_BASE
.equ DMA2_Stream5        , DMA2_Stream5_BASE
.equ DMA2_Stream6        , DMA2_Stream6_BASE
.equ DMA2_Stream7        , DMA2_Stream7_BASE
.equ ETH                 , ETH_BASE
.equ DCMI                , DCMI_BASE
.equ CRYP                , CRYP_BASE
.equ HASH                , HASH_BASE
.equ RNG                 , RNG_BASE
.equ FSMC_Bank1          , FSMC_Bank1_R_BASE
.equ FSMC_Bank1E         , FSMC_Bank1E_R_BASE
.equ FSMC_Bank2          , FSMC_Bank2_R_BASE
.equ FSMC_Bank3          , FSMC_Bank3_R_BASE
.equ FSMC_Bank4          , FSMC_Bank4_R_BASE
.equ DBGMCU              , DBGMCU_BASE

@
@ addtogroup Exported_constants
@
@ addtogroup Peripheral_Registers_Bits_Definition
@
  
@******************************************************************************
@*                         Peripheral Registers_Bits_Definition               *
@******************************************************************************

@******************************************************************************
@*                                                                            *
@*                        Analog to Digital Converter                         *
@*                                                                            *
@******************************************************************************
@********************  Bit definition for ADC_SR register  ********************/
.equ  ADC_SR_AWD                          ,0x01               @<Analog watchdog flag */
.equ  ADC_SR_EOC                          ,0x02               @<End of conversion */
.equ  ADC_SR_JEOC                         ,0x04               @<Injected channel end of conversion */
.equ  ADC_SR_JSTRT                        ,0x08               @<Injected channel Start flag */
.equ  ADC_SR_STRT                         ,0x10               @<Regular channel Start flag */
.equ  ADC_SR_OVR                          ,0x20               @<Overrun flag */

@******************  Bit definition for ADC_CR1 register  ********************/
.equ  ADC_CR1_AWDCH                       ,0x0000001F        @<AWDCH[4:0] bits (Analog watchdog channel select bits) */
.equ  ADC_CR1_AWDCH_0                     ,0x00000001        @<Bit 0 */
.equ  ADC_CR1_AWDCH_1                     ,0x00000002        @<Bit 1 */
.equ  ADC_CR1_AWDCH_2                     ,0x00000004        @<Bit 2 */
.equ  ADC_CR1_AWDCH_3                     ,0x00000008        @<Bit 3 */
.equ  ADC_CR1_AWDCH_4                     ,0x00000010        @<Bit 4 */
.equ  ADC_CR1_EOCIE                       ,0x00000020        @<Interrupt enable for EOC */
.equ  ADC_CR1_AWDIE                       ,0x00000040        @<AAnalog Watchdog interrupt enable */
.equ  ADC_CR1_JEOCIE                      ,0x00000080        @<Interrupt enable for injected channels */
.equ  ADC_CR1_SCAN                        ,0x00000100        @<Scan mode */
.equ  ADC_CR1_AWDSGL                      ,0x00000200        @<Enable the watchdog on a single channel in scan mode */
.equ  ADC_CR1_JAUTO                       ,0x00000400        @<Automatic injected group conversion */
.equ  ADC_CR1_DISCEN                      ,0x00000800        @<Discontinuous mode on regular channels */
.equ  ADC_CR1_JDISCEN                     ,0x00001000        @<Discontinuous mode on injected channels */
.equ  ADC_CR1_DISCNUM                     ,0x0000E000        @<DISCNUM[2:0] bits (Discontinuous mode channel count) */
.equ  ADC_CR1_DISCNUM_0                   ,0x00002000        @<Bit 0 */
.equ  ADC_CR1_DISCNUM_1                   ,0x00004000        @<Bit 1 */
.equ  ADC_CR1_DISCNUM_2                   ,0x00008000        @<Bit 2 */
.equ  ADC_CR1_JAWDEN                      ,0x00400000        @<Analog watchdog enable on injected channels */
.equ  ADC_CR1_AWDEN                       ,0x00800000        @<Analog watchdog enable on regular channels */
.equ  ADC_CR1_RES                         ,0x03000000        @<RES[2:0] bits (Resolution) */
.equ  ADC_CR1_RES_0                       ,0x01000000        @<Bit 0 */
.equ  ADC_CR1_RES_1                       ,0x02000000        @<Bit 1 */
.equ  ADC_CR1_OVRIE                       ,0x04000000         @<overrun interrupt enable */
  
@******************  Bit definition for ADC_CR2 register  ********************/
.equ  ADC_CR2_ADON                        ,0x00000001        @<A/D Converter ON / OFF */
.equ  ADC_CR2_CONT                        ,0x00000002        @<Continuous Conversion */
.equ  ADC_CR2_DMA                         ,0x00000100        @<Direct Memory access mode */
.equ  ADC_CR2_DDS                         ,0x00000200        @<DMA disable selection (Single ADC) */
.equ  ADC_CR2_EOCS                        ,0x00000400        @<End of conversion selection */
.equ  ADC_CR2_ALIGN                       ,0x00000800        @<Data Alignment */
.equ  ADC_CR2_JEXTSEL                     ,0x000F0000        @<JEXTSEL[3:0] bits (External event select for injected group) */
.equ  ADC_CR2_JEXTSEL_0                   ,0x00010000        @<Bit 0 */
.equ  ADC_CR2_JEXTSEL_1                   ,0x00020000        @<Bit 1 */
.equ  ADC_CR2_JEXTSEL_2                   ,0x00040000        @<Bit 2 */
.equ  ADC_CR2_JEXTSEL_3                   ,0x00080000        @<Bit 3 */
.equ  ADC_CR2_JEXTEN                      ,0x00300000        @<JEXTEN[1:0] bits (External Trigger Conversion mode for injected channelsp) */
.equ  ADC_CR2_JEXTEN_0                    ,0x00100000        @<Bit 0 */
.equ  ADC_CR2_JEXTEN_1                    ,0x00200000        @<Bit 1 */
.equ  ADC_CR2_JSWSTART                    ,0x00400000        @<Start Conversion of injected channels */
.equ  ADC_CR2_EXTSEL                      ,0x0F000000        @<EXTSEL[3:0] bits (External Event Select for regular group) */
.equ  ADC_CR2_EXTSEL_0                    ,0x01000000        @<Bit 0 */
.equ  ADC_CR2_EXTSEL_1                    ,0x02000000        @<Bit 1 */
.equ  ADC_CR2_EXTSEL_2                    ,0x04000000        @<Bit 2 */
.equ  ADC_CR2_EXTSEL_3                    ,0x08000000        @<Bit 3 */
.equ  ADC_CR2_EXTEN                       ,0x30000000        @<EXTEN[1:0] bits (External Trigger Conversion mode for regular channelsp) */
.equ  ADC_CR2_EXTEN_0                     ,0x10000000        @<Bit 0 */
.equ  ADC_CR2_EXTEN_1                     ,0x20000000        @<Bit 1 */
.equ  ADC_CR2_SWSTART                     ,0x40000000        @<Start Conversion of regular channels */

@*****************  Bit definition for ADC_SMPR1 register  *******************/
.equ  ADC_SMPR1_SMP10                     ,0x00000007        @<SMP10[2:0] bits (Channel 10 Sample time selection) */
.equ  ADC_SMPR1_SMP10_0                   ,0x00000001        @<Bit 0 */
.equ  ADC_SMPR1_SMP10_1                   ,0x00000002        @<Bit 1 */
.equ  ADC_SMPR1_SMP10_2                   ,0x00000004        @<Bit 2 */
.equ  ADC_SMPR1_SMP11                     ,0x00000038        @<SMP11[2:0] bits (Channel 11 Sample time selection) */
.equ  ADC_SMPR1_SMP11_0                   ,0x00000008        @<Bit 0 */
.equ  ADC_SMPR1_SMP11_1                   ,0x00000010        @<Bit 1 */
.equ  ADC_SMPR1_SMP11_2                   ,0x00000020        @<Bit 2 */
.equ  ADC_SMPR1_SMP12                     ,0x000001C0        @<SMP12[2:0] bits (Channel 12 Sample time selection) */
.equ  ADC_SMPR1_SMP12_0                   ,0x00000040        @<Bit 0 */
.equ  ADC_SMPR1_SMP12_1                   ,0x00000080        @<Bit 1 */
.equ  ADC_SMPR1_SMP12_2                   ,0x00000100        @<Bit 2 */
.equ  ADC_SMPR1_SMP13                     ,0x00000E00        @<SMP13[2:0] bits (Channel 13 Sample time selection) */
.equ  ADC_SMPR1_SMP13_0                   ,0x00000200        @<Bit 0 */
.equ  ADC_SMPR1_SMP13_1                   ,0x00000400        @<Bit 1 */
.equ  ADC_SMPR1_SMP13_2                   ,0x00000800        @<Bit 2 */
.equ  ADC_SMPR1_SMP14                     ,0x00007000        @<SMP14[2:0] bits (Channel 14 Sample time selection) */
.equ  ADC_SMPR1_SMP14_0                   ,0x00001000        @<Bit 0 */
.equ  ADC_SMPR1_SMP14_1                   ,0x00002000        @<Bit 1 */
.equ  ADC_SMPR1_SMP14_2                   ,0x00004000        @<Bit 2 */
.equ  ADC_SMPR1_SMP15                     ,0x00038000        @<SMP15[2:0] bits (Channel 15 Sample time selection) */
.equ  ADC_SMPR1_SMP15_0                   ,0x00008000        @<Bit 0 */
.equ  ADC_SMPR1_SMP15_1                   ,0x00010000        @<Bit 1 */
.equ  ADC_SMPR1_SMP15_2                   ,0x00020000        @<Bit 2 */
.equ  ADC_SMPR1_SMP16                     ,0x001C0000        @<SMP16[2:0] bits (Channel 16 Sample time selection) */
.equ  ADC_SMPR1_SMP16_0                   ,0x00040000        @<Bit 0 */
.equ  ADC_SMPR1_SMP16_1                   ,0x00080000        @<Bit 1 */
.equ  ADC_SMPR1_SMP16_2                   ,0x00100000        @<Bit 2 */
.equ  ADC_SMPR1_SMP17                     ,0x00E00000        @<SMP17[2:0] bits (Channel 17 Sample time selection) */
.equ  ADC_SMPR1_SMP17_0                   ,0x00200000        @<Bit 0 */
.equ  ADC_SMPR1_SMP17_1                   ,0x00400000        @<Bit 1 */
.equ  ADC_SMPR1_SMP17_2                   ,0x00800000        @<Bit 2 */
.equ  ADC_SMPR1_SMP18                     ,0x07000000        @<SMP18[2:0] bits (Channel 18 Sample time selection) */
.equ  ADC_SMPR1_SMP18_0                   ,0x01000000        @<Bit 0 */
.equ  ADC_SMPR1_SMP18_1                   ,0x02000000        @<Bit 1 */
.equ  ADC_SMPR1_SMP18_2                   ,0x04000000        @<Bit 2 */

