ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
@******************  Bit definition for ADC_SQR3 register  *******************/
.equ  ADC_SQR3_SQ1                        ,0x0000001F         @<SQ1[4:0] bits (1st conversion in regular sequence) */
.equ  ADC_SQR3_SQ1_0                      ,0x00000001         @<Bit 0 */
.equ  ADC_SQR3_SQ1_1                      ,0x00000002         @<Bit 1 */
.equ  ADC_SQR3_SQ1_2                      ,0x00000004         @<Bit 2 */
.equ  ADC_SQR3_SQ1_3                      ,0x00000008         @<Bit 3 */
.equ  ADC_SQR3_SQ1_4                      ,0x00000010         @<Bit 4 */
.equ  ADC_SQR3_SQ2                        ,0x000003E0         @<SQ2[4:0] bits (2nd conversion in regular sequence) */
.equ  ADC_SQR3_SQ2_0                      ,0x00000020         @<Bit 0 */
.equ  ADC_SQR3_SQ2_1                      ,0x00000040         @<Bit 1 */
.equ  ADC_SQR3_SQ2_2                      ,0x00000080         @<Bit 2 */
.equ  ADC_SQR3_SQ2_3                      ,0x00000100         @<Bit 3 */
.equ  ADC_SQR3_SQ2_4                      ,0x00000200         @<Bit 4 */
.equ  ADC_SQR3_SQ3                        ,0x00007C00         @<SQ3[4:0] bits (3rd conversion in regular sequence) */
.equ  ADC_SQR3_SQ3_0                      ,0x00000400         @<Bit 0 */
.equ  ADC_SQR3_SQ3_1                      ,0x00000800         @<Bit 1 */
.equ  ADC_SQR3_SQ3_2                      ,0x00001000         @<Bit 2 */
.equ  ADC_SQR3_SQ3_3                      ,0x00002000         @<Bit 3 */
.equ  ADC_SQR3_SQ3_4                      ,0x00004000         @<Bit 4 */
.equ  ADC_SQR3_SQ4                        ,0x000F8000         @<SQ4[4:0] bits (4th conversion in regular sequence) */
.equ  ADC_SQR3_SQ4_0                      ,0x00008000         @<Bit 0 */
.equ  ADC_SQR3_SQ4_1                      ,0x00010000         @<Bit 1 */
.equ  ADC_SQR3_SQ4_2                      ,0x00020000         @<Bit 2 */
.equ  ADC_SQR3_SQ4_3                      ,0x00040000         @<Bit 3 */
.equ  ADC_SQR3_SQ4_4                      ,0x00080000         @<Bit 4 */
.equ  ADC_SQR3_SQ5                        ,0x01F00000         @<SQ5[4:0] bits (5th conversion in regular sequence) */
.equ  ADC_SQR3_SQ5_0                      ,0x00100000         @<Bit 0 */
.equ  ADC_SQR3_SQ5_1                      ,0x00200000         @<Bit 1 */
.equ  ADC_SQR3_SQ5_2                      ,0x00400000         @<Bit 2 */
.equ  ADC_SQR3_SQ5_3                      ,0x00800000         @<Bit 3 */
.equ  ADC_SQR3_SQ5_4                      ,0x01000000         @<Bit 4 */
.equ  ADC_SQR3_SQ6                        ,0x3E000000         @<SQ6[4:0] bits (6th conversion in regular sequence) */
.equ  ADC_SQR3_SQ6_0                      ,0x02000000         @<Bit 0 */
.equ  ADC_SQR3_SQ6_1                      ,0x04000000         @<Bit 1 */
.equ  ADC_SQR3_SQ6_2                      ,0x08000000         @<Bit 2 */
.equ  ADC_SQR3_SQ6_3                      ,0x10000000         @<Bit 3 */
.equ  ADC_SQR3_SQ6_4                      ,0x20000000         @<Bit 4 */

@******************  Bit definition for ADC_JSQR register  *******************/
.equ  ADC_JSQR_JSQ1                       ,0x0000001F         @<JSQ1[4:0] bits (1st conversion in injected sequence) */  
.equ  ADC_JSQR_JSQ1_0                     ,0x00000001         @<Bit 0 */
.equ  ADC_JSQR_JSQ1_1                     ,0x00000002         @<Bit 1 */
.equ  ADC_JSQR_JSQ1_2                     ,0x00000004         @<Bit 2 */
.equ  ADC_JSQR_JSQ1_3                     ,0x00000008         @<Bit 3 */
.equ  ADC_JSQR_JSQ1_4                     ,0x00000010         @<Bit 4 */
.equ  ADC_JSQR_JSQ2                       ,0x000003E0         @<JSQ2[4:0] bits (2nd conversion in injected sequence) */
.equ  ADC_JSQR_JSQ2_0                     ,0x00000020         @<Bit 0 */
.equ  ADC_JSQR_JSQ2_1                     ,0x00000040         @<Bit 1 */
.equ  ADC_JSQR_JSQ2_2                     ,0x00000080         @<Bit 2 */
.equ  ADC_JSQR_JSQ2_3                     ,0x00000100         @<Bit 3 */
.equ  ADC_JSQR_JSQ2_4                     ,0x00000200         @<Bit 4 */
.equ  ADC_JSQR_JSQ3                       ,0x00007C00         @<JSQ3[4:0] bits (3rd conversion in injected sequence) */
.equ  ADC_JSQR_JSQ3_0                     ,0x00000400         @<Bit 0 */
.equ  ADC_JSQR_JSQ3_1                     ,0x00000800         @<Bit 1 */
.equ  ADC_JSQR_JSQ3_2                     ,0x00001000         @<Bit 2 */
.equ  ADC_JSQR_JSQ3_3                     ,0x00002000         @<Bit 3 */
.equ  ADC_JSQR_JSQ3_4                     ,0x00004000         @<Bit 4 */
.equ  ADC_JSQR_JSQ4                       ,0x000F8000         @<JSQ4[4:0] bits (4th conversion in injected sequence) */
.equ  ADC_JSQR_JSQ4_0                     ,0x00008000         @<Bit 0 */
.equ  ADC_JSQR_JSQ4_1                     ,0x00010000         @<Bit 1 */
.equ  ADC_JSQR_JSQ4_2                     ,0x00020000         @<Bit 2 */
.equ  ADC_JSQR_JSQ4_3                     ,0x00040000         @<Bit 3 */
.equ  ADC_JSQR_JSQ4_4                     ,0x00080000         @<Bit 4 */
.equ  ADC_JSQR_JL                         ,0x00300000         @<JL[1:0] bits (Injected Sequence length) */
.equ  ADC_JSQR_JL_0                       ,0x00100000         @<Bit 0 */
.equ  ADC_JSQR_JL_1                       ,0x00200000         @<Bit 1 */

@******************  Bit definition for ADC_JDR1 register  *******************/
.equ  ADC_JDR1_JDATA                      ,0xFFFF            @<Injected data */

@******************  Bit definition for ADC_JDR2 register  *******************/
.equ  ADC_JDR2_JDATA                      ,0xFFFF            @<Injected data */

@******************  Bit definition for ADC_JDR3 register  *******************/
.equ  ADC_JDR3_JDATA                      ,0xFFFF            @<Injected data */

@******************  Bit definition for ADC_JDR4 register  *******************/
.equ  ADC_JDR4_JDATA                      ,0xFFFF            @<Injected data */

@*******************  Bit definition for ADC_DR register  ********************/
.equ  ADC_DR_DATA                         ,0x0000FFFF         @<Regular data */
.equ  ADC_DR_ADC2DATA                     ,0xFFFF0000         @<ADC2 data */

@******************  Bit definition for ADC_CSR register  ********************/
.equ  ADC_CSR_AWD1                        ,0x00000001         @<ADC1 Analog watchdog flag */
.equ  ADC_CSR_EOC1                        ,0x00000002         @<ADC1 End of conversion */
.equ  ADC_CSR_JEOC1                       ,0x00000004         @<ADC1 Injected channel end of conversion */
.equ  ADC_CSR_JSTRT1                      ,0x00000008         @<ADC1 Injected channel Start flag */
.equ  ADC_CSR_STRT1                       ,0x00000010         @<ADC1 Regular channel Start flag */
.equ  ADC_CSR_DOVR1                       ,0x00000020         @<ADC1 DMA overrun  flag */
.equ  ADC_CSR_AWD2                        ,0x00000100         @<ADC2 Analog watchdog flag */
.equ  ADC_CSR_EOC2                        ,0x00000200         @<ADC2 End of conversion */
.equ  ADC_CSR_JEOC2                       ,0x00000400         @<ADC2 Injected channel end of conversion */
.equ  ADC_CSR_JSTRT2                      ,0x00000800         @<ADC2 Injected channel Start flag */
.equ  ADC_CSR_STRT2                       ,0x00001000         @<ADC2 Regular channel Start flag */
.equ  ADC_CSR_DOVR2                       ,0x00002000         @<ADC2 DMA overrun  flag */
.equ  ADC_CSR_AWD3                        ,0x00010000         @<ADC3 Analog watchdog flag */
.equ  ADC_CSR_EOC3                        ,0x00020000         @<ADC3 End of conversion */
.equ  ADC_CSR_JEOC3                       ,0x00040000         @<ADC3 Injected channel end of conversion */
.equ  ADC_CSR_JSTRT3                      ,0x00080000         @<ADC3 Injected channel Start flag */
.equ  ADC_CSR_STRT3                       ,0x00100000         @<ADC3 Regular channel Start flag */
.equ  ADC_CSR_DOVR3                       ,0x00200000         @<ADC3 DMA overrun  flag */

@******************  Bit definition for ADC_CCR register  ********************/
.equ  ADC_CCR_MULTI                       ,0x0000001F         @<MULTI[4:0] bits (Multi-ADC mode selection) */  
.equ  ADC_CCR_MULTI_0                     ,0x00000001         @<Bit 0 */
.equ  ADC_CCR_MULTI_1                     ,0x00000002         @<Bit 1 */
.equ  ADC_CCR_MULTI_2                     ,0x00000004         @<Bit 2 */
.equ  ADC_CCR_MULTI_3                     ,0x00000008         @<Bit 3 */
.equ  ADC_CCR_MULTI_4                     ,0x00000010         @<Bit 4 */
.equ  ADC_CCR_DELAY                       ,0x00000F00         @<DELAY[3:0] bits (Delay between 2 sampling phases) */  
.equ  ADC_CCR_DELAY_0                     ,0x00000100         @<Bit 0 */
.equ  ADC_CCR_DELAY_1                     ,0x00000200         @<Bit 1 */
.equ  ADC_CCR_DELAY_2                     ,0x00000400         @<Bit 2 */
.equ  ADC_CCR_DELAY_3                     ,0x00000800         @<Bit 3 */
.equ  ADC_CCR_DDS                         ,0x00002000         @<DMA disable selection (Multi-ADC mode) */
.equ  ADC_CCR_DMA                         ,0x0000C000         @<DMA[1:0] bits (Direct Memory Access mode for multimode) */  
.equ  ADC_CCR_DMA_0                       ,0x00004000         @<Bit 0 */
.equ  ADC_CCR_DMA_1                       ,0x00008000         @<Bit 1 */
.equ  ADC_CCR_ADCPRE                      ,0x00030000         @<ADCPRE[1:0] bits (ADC prescaler) */  
.equ  ADC_CCR_ADCPRE_0                    ,0x00010000         @<Bit 0 */
.equ  ADC_CCR_ADCPRE_1                    ,0x00020000         @<Bit 1 */
.equ  ADC_CCR_VBATE                       ,0x00400000         @<VBAT Enable */
.equ  ADC_CCR_TSVREFE                     ,0x00800000         @<Temperature Sensor and VREFINT Enable */

@******************  Bit definition for ADC_CDR register  ********************/
.equ  ADC_CDR_DATA1                      ,0x0000FFFF         @<1st data of a pair of regular conversions */
.equ  ADC_CDR_DATA2                      ,0xFFFF0000         @<2nd data of a pair of regular conversions */

@*****************************************************************************/
@                                                                            */
@                         Controller Area Network                            */
@                                                                            */
@*****************************************************************************/
@<CAN control and status registers */
@******************  Bit definition for CAN_MCR register  ********************/
.equ  CAN_MCR_INRQ                        ,0x0001            @<Initialization Request */
.equ  CAN_MCR_SLEEP                       ,0x0002            @<Sleep Mode Request */
.equ  CAN_MCR_TXFP                        ,0x0004            @<Transmit FIFO Priority */
.equ  CAN_MCR_RFLM                        ,0x0008            @<Receive FIFO Locked Mode */
.equ  CAN_MCR_NART                        ,0x0010            @<No Automatic Retransmission */
.equ  CAN_MCR_AWUM                        ,0x0020            @<Automatic Wakeup Mode */
.equ  CAN_MCR_ABOM                        ,0x0040            @<Automatic Bus-Off Management */
.equ  CAN_MCR_TTCM                        ,0x0080            @<Time Triggered Communication Mode */
.equ  CAN_MCR_RESET                       ,0x8000            @<bxCAN software master reset */

@******************  Bit definition for CAN_MSR register  ********************/
.equ  CAN_MSR_INAK                        ,0x0001            @<Initialization Acknowledge */
.equ  CAN_MSR_SLAK                        ,0x0002            @<Sleep Acknowledge */
.equ  CAN_MSR_ERRI                        ,0x0004            @<Error Interrupt */
.equ  CAN_MSR_WKUI                        ,0x0008            @<Wakeup Interrupt */
.equ  CAN_MSR_SLAKI                       ,0x0010            @<Sleep Acknowledge Interrupt */
.equ  CAN_MSR_TXM                         ,0x0100            @<Transmit Mode */
.equ  CAN_MSR_RXM                         ,0x0200            @<Receive Mode */
.equ  CAN_MSR_SAMP                        ,0x0400            @<Last Sample Point */
.equ  CAN_MSR_RX                          ,0x0800            @<CAN Rx Signal */

@******************  Bit definition for CAN_TSR register  ********************/
.equ  CAN_TSR_RQCP0                       ,0x00000001         @<Request Completed Mailbox0 */
.equ  CAN_TSR_TXOK0                       ,0x00000002         @<Transmission OK of Mailbox0 */
.equ  CAN_TSR_ALST0                       ,0x00000004         @<Arbitration Lost for Mailbox0 */
.equ  CAN_TSR_TERR0                       ,0x00000008         @<Transmission Error of Mailbox0 */
.equ  CAN_TSR_ABRQ0                       ,0x00000080         @<Abort Request for Mailbox0 */
.equ  CAN_TSR_RQCP1                       ,0x00000100         @<Request Completed Mailbox1 */
.equ  CAN_TSR_TXOK1                       ,0x00000200         @<Transmission OK of Mailbox1 */
.equ  CAN_TSR_ALST1                       ,0x00000400         @<Arbitration Lost for Mailbox1 */
.equ  CAN_TSR_TERR1                       ,0x00000800         @<Transmission Error of Mailbox1 */
.equ  CAN_TSR_ABRQ1                       ,0x00008000         @<Abort Request for Mailbox 1 */
.equ  CAN_TSR_RQCP2                       ,0x00010000         @<Request Completed Mailbox2 */
.equ  CAN_TSR_TXOK2                       ,0x00020000         @<Transmission OK of Mailbox 2 */
.equ  CAN_TSR_ALST2                       ,0x00040000         @<Arbitration Lost for mailbox 2 */
.equ  CAN_TSR_TERR2                       ,0x00080000         @<Transmission Error of Mailbox 2 */
.equ  CAN_TSR_ABRQ2                       ,0x00800000         @<Abort Request for Mailbox 2 */
.equ  CAN_TSR_CODE                        ,0x03000000         @<Mailbox Code */

.equ  CAN_TSR_TME                         ,0x1C000000         @<TME[2:0] bits */
.equ  CAN_TSR_TME0                        ,0x04000000         @<Transmit Mailbox 0 Empty */
.equ  CAN_TSR_TME1                        ,0x08000000         @<Transmit Mailbox 1 Empty */
.equ  CAN_TSR_TME2                        ,0x10000000         @<Transmit Mailbox 2 Empty */

.equ  CAN_TSR_LOW                         ,0xE0000000         @<LOW[2:0] bits */
.equ  CAN_TSR_LOW0                        ,0x20000000         @<Lowest Priority Flag for Mailbox 0 */
.equ  CAN_TSR_LOW1                        ,0x40000000         @<Lowest Priority Flag for Mailbox 1 */
.equ  CAN_TSR_LOW2                        ,0x80000000         @<Lowest Priority Flag for Mailbox 2 */

@******************  Bit definition for CAN_RF0R register  *******************/
.equ  CAN_RF0R_FMP0                       ,0x03               @<FIFO 0 Message Pending */
.equ  CAN_RF0R_FULL0                      ,0x08               @<FIFO 0 Full */
.equ  CAN_RF0R_FOVR0                      ,0x10               @<FIFO 0 Overrun */
.equ  CAN_RF0R_RFOM0                      ,0x20               @<Release FIFO 0 Output Mailbox */

@******************  Bit definition for CAN_RF1R register  *******************/
.equ  CAN_RF1R_FMP1                       ,0x03               @<FIFO 1 Message Pending */
.equ  CAN_RF1R_FULL1                      ,0x08               @<FIFO 1 Full */
.equ  CAN_RF1R_FOVR1                      ,0x10               @<FIFO 1 Overrun */
.equ  CAN_RF1R_RFOM1                      ,0x20               @<Release FIFO 1 Output Mailbox */

