ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
.equ CRYP_CR_DATATYPE                     ,0x000000C0 
.equ CRYP_CR_DATATYPE_0                   ,0x00000040 
.equ CRYP_CR_DATATYPE_1                   ,0x00000080 
.equ CRYP_CR_KEYSIZE                      ,0x00000300 
.equ CRYP_CR_KEYSIZE_0                    ,0x00000100 
.equ CRYP_CR_KEYSIZE_1                    ,0x00000200 
.equ CRYP_CR_FFLUSH                       ,0x00004000 
.equ CRYP_CR_CRYPEN                       ,0x00008000 
@***************** Bits definition for CRYP_SR register  *********************/
.equ CRYP_SR_IFEM                         ,0x00000001 
.equ CRYP_SR_IFNF                         ,0x00000002 
.equ CRYP_SR_OFNE                         ,0x00000004 
.equ CRYP_SR_OFFU                         ,0x00000008 
.equ CRYP_SR_BUSY                         ,0x00000010 
@***************** Bits definition for CRYP_DMACR register  ******************/
.equ CRYP_DMACR_DIEN                      ,0x00000001 
.equ CRYP_DMACR_DOEN                      ,0x00000002 
@****************  Bits definition for CRYP_IMSCR register  ******************/
.equ CRYP_IMSCR_INIM                      ,0x00000001 
.equ CRYP_IMSCR_OUTIM                     ,0x00000002 
@***************** Bits definition for CRYP_RISR register  *******************/
.equ CRYP_RISR_OUTRIS                     ,0x00000001 
.equ CRYP_RISR_INRIS                      ,0x00000002 
@***************** Bits definition for CRYP_MISR register  *******************/
.equ CRYP_MISR_INMIS                      ,0x00000001 
.equ CRYP_MISR_OUTMIS                     ,0x00000002 

@*****************************************************************************/
@                                                                            */
@                      Digital to Analog Converter                           */
@                                                                            */
@*****************************************************************************/
@*******************  Bit definition for DAC_CR register  ********************/
.equ  DAC_CR_EN1                          ,0x00000001         @<DAC channel1 enable */
.equ  DAC_CR_BOFF1                        ,0x00000002         @<DAC channel1 output buffer disable */
.equ  DAC_CR_TEN1                         ,0x00000004         @<DAC channel1 Trigger enable */

.equ  DAC_CR_TSEL1                        ,0x00000038         @<TSEL1[2:0] (DAC channel1 Trigger selection) */
.equ  DAC_CR_TSEL1_0                      ,0x00000008         @<Bit 0 */
.equ  DAC_CR_TSEL1_1                      ,0x00000010         @<Bit 1 */
.equ  DAC_CR_TSEL1_2                      ,0x00000020         @<Bit 2 */

.equ  DAC_CR_WAVE1                        ,0x000000C0         @<WAVE1[1:0] (DAC channel1 noise/triangle wave generation enable) */
.equ  DAC_CR_WAVE1_0                      ,0x00000040         @<Bit 0 */
.equ  DAC_CR_WAVE1_1                      ,0x00000080         @<Bit 1 */

.equ  DAC_CR_MAMP1                        ,0x00000F00         @<MAMP1[3:0] (DAC channel1 Mask/Amplitude selector) */
.equ  DAC_CR_MAMP1_0                      ,0x00000100         @<Bit 0 */
.equ  DAC_CR_MAMP1_1                      ,0x00000200         @<Bit 1 */
.equ  DAC_CR_MAMP1_2                      ,0x00000400         @<Bit 2 */
.equ  DAC_CR_MAMP1_3                      ,0x00000800         @<Bit 3 */

.equ  DAC_CR_DMAEN1                       ,0x00001000         @<DAC channel1 DMA enable */
.equ  DAC_CR_EN2                          ,0x00010000         @<DAC channel2 enable */
.equ  DAC_CR_BOFF2                        ,0x00020000         @<DAC channel2 output buffer disable */
.equ  DAC_CR_TEN2                         ,0x00040000         @<DAC channel2 Trigger enable */

.equ  DAC_CR_TSEL2                        ,0x00380000         @<TSEL2[2:0] (DAC channel2 Trigger selection) */
.equ  DAC_CR_TSEL2_0                      ,0x00080000         @<Bit 0 */
.equ  DAC_CR_TSEL2_1                      ,0x00100000         @<Bit 1 */
.equ  DAC_CR_TSEL2_2                      ,0x00200000         @<Bit 2 */

.equ  DAC_CR_WAVE2                        ,0x00C00000         @<WAVE2[1:0] (DAC channel2 noise/triangle wave generation enable) */
.equ  DAC_CR_WAVE2_0                      ,0x00400000         @<Bit 0 */
.equ  DAC_CR_WAVE2_1                      ,0x00800000         @<Bit 1 */

.equ  DAC_CR_MAMP2                        ,0x0F000000         @<MAMP2[3:0] (DAC channel2 Mask/Amplitude selector) */
.equ  DAC_CR_MAMP2_0                      ,0x01000000         @<Bit 0 */
.equ  DAC_CR_MAMP2_1                      ,0x02000000         @<Bit 1 */
.equ  DAC_CR_MAMP2_2                      ,0x04000000         @<Bit 2 */
.equ  DAC_CR_MAMP2_3                      ,0x08000000         @<Bit 3 */

.equ  DAC_CR_DMAEN2                       ,0x10000000         @<DAC channel2 DMA enabled */

@****************  Bit definition for DAC_SWTRIGR register  ******************/
.equ  DAC_SWTRIGR_SWTRIG1                 ,0x01               @<DAC channel1 software trigger */
.equ  DAC_SWTRIGR_SWTRIG2                 ,0x02               @<DAC channel2 software trigger */

@****************  Bit definition for DAC_DHR12R1 register  ******************/
.equ  DAC_DHR12R1_DACC1DHR                ,0x0FFF            @<DAC channel1 12-bit Right aligned data */

@****************  Bit definition for DAC_DHR12L1 register  ******************/
.equ  DAC_DHR12L1_DACC1DHR                ,0xFFF0            @<DAC channel1 12-bit Left aligned data */

@*****************  Bit definition for DAC_DHR8R1 register  ******************/
.equ  DAC_DHR8R1_DACC1DHR                 ,0xFF               @<DAC channel1 8-bit Right aligned data */

@****************  Bit definition for DAC_DHR12R2 register  ******************/
.equ  DAC_DHR12R2_DACC2DHR                ,0x0FFF            @<DAC channel2 12-bit Right aligned data */

@****************  Bit definition for DAC_DHR12L2 register  ******************/
.equ  DAC_DHR12L2_DACC2DHR                ,0xFFF0            @<DAC channel2 12-bit Left aligned data */

