ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
@*******************  Bits definition for DMA_LISR register  *****************/ 
.equ DMA_LISR_TCIF3                       ,0x08000000 
.equ DMA_LISR_HTIF3                       ,0x04000000 
.equ DMA_LISR_TEIF3                       ,0x02000000 
.equ DMA_LISR_DMEIF3                      ,0x01000000 
.equ DMA_LISR_FEIF3                       ,0x00400000 
.equ DMA_LISR_TCIF2                       ,0x00200000 
.equ DMA_LISR_HTIF2                       ,0x00100000 
.equ DMA_LISR_TEIF2                       ,0x00080000 
.equ DMA_LISR_DMEIF2                      ,0x00040000 
.equ DMA_LISR_FEIF2                       ,0x00010000 
.equ DMA_LISR_TCIF1                       ,0x00000800 
.equ DMA_LISR_HTIF1                       ,0x00000400 
.equ DMA_LISR_TEIF1                       ,0x00000200 
.equ DMA_LISR_DMEIF1                      ,0x00000100 
.equ DMA_LISR_FEIF1                       ,0x00000040 
.equ DMA_LISR_TCIF0                       ,0x00000020 
.equ DMA_LISR_HTIF0                       ,0x00000010 
.equ DMA_LISR_TEIF0                       ,0x00000008 
.equ DMA_LISR_DMEIF0                      ,0x00000004 
.equ DMA_LISR_FEIF0                       ,0x00000001 

@*******************  Bits definition for DMA_HISR register  *****************/ 
.equ DMA_HISR_TCIF7                       ,0x08000000 
.equ DMA_HISR_HTIF7                       ,0x04000000 
.equ DMA_HISR_TEIF7                       ,0x02000000 
.equ DMA_HISR_DMEIF7                      ,0x01000000 
.equ DMA_HISR_FEIF7                       ,0x00400000 
.equ DMA_HISR_TCIF6                       ,0x00200000 
.equ DMA_HISR_HTIF6                       ,0x00100000 
.equ DMA_HISR_TEIF6                       ,0x00080000 
.equ DMA_HISR_DMEIF6                      ,0x00040000 
.equ DMA_HISR_FEIF6                       ,0x00010000 
.equ DMA_HISR_TCIF5                       ,0x00000800 
.equ DMA_HISR_HTIF5                       ,0x00000400 
.equ DMA_HISR_TEIF5                       ,0x00000200 
.equ DMA_HISR_DMEIF5                      ,0x00000100 
.equ DMA_HISR_FEIF5                       ,0x00000040 
.equ DMA_HISR_TCIF4                       ,0x00000020 
.equ DMA_HISR_HTIF4                       ,0x00000010 
.equ DMA_HISR_TEIF4                       ,0x00000008 
.equ DMA_HISR_DMEIF4                      ,0x00000004 
.equ DMA_HISR_FEIF4                       ,0x00000001 

@*******************  Bits definition for DMA_LIFCR register  ****************/ 
.equ DMA_LIFCR_CTCIF3                     ,0x08000000 
.equ DMA_LIFCR_CHTIF3                     ,0x04000000 
.equ DMA_LIFCR_CTEIF3                     ,0x02000000 
.equ DMA_LIFCR_CDMEIF3                    ,0x01000000 
.equ DMA_LIFCR_CFEIF3                     ,0x00400000 
.equ DMA_LIFCR_CTCIF2                     ,0x00200000 
.equ DMA_LIFCR_CHTIF2                     ,0x00100000 
.equ DMA_LIFCR_CTEIF2                     ,0x00080000 
.equ DMA_LIFCR_CDMEIF2                    ,0x00040000 
.equ DMA_LIFCR_CFEIF2                     ,0x00010000 
.equ DMA_LIFCR_CTCIF1                     ,0x00000800 
.equ DMA_LIFCR_CHTIF1                     ,0x00000400 
.equ DMA_LIFCR_CTEIF1                     ,0x00000200 
.equ DMA_LIFCR_CDMEIF1                    ,0x00000100 
.equ DMA_LIFCR_CFEIF1                     ,0x00000040 
.equ DMA_LIFCR_CTCIF0                     ,0x00000020 
.equ DMA_LIFCR_CHTIF0                     ,0x00000010 
.equ DMA_LIFCR_CTEIF0                     ,0x00000008 
.equ DMA_LIFCR_CDMEIF0                    ,0x00000004 
.equ DMA_LIFCR_CFEIF0                     ,0x00000001 

@*******************  Bits definition for DMA_HIFCR  register  ****************/ 
.equ DMA_HIFCR_CTCIF7                     ,0x08000000 
.equ DMA_HIFCR_CHTIF7                     ,0x04000000 
.equ DMA_HIFCR_CTEIF7                     ,0x02000000 
.equ DMA_HIFCR_CDMEIF7                    ,0x01000000 
.equ DMA_HIFCR_CFEIF7                     ,0x00400000 
.equ DMA_HIFCR_CTCIF6                     ,0x00200000 
.equ DMA_HIFCR_CHTIF6                     ,0x00100000 
.equ DMA_HIFCR_CTEIF6                     ,0x00080000 
.equ DMA_HIFCR_CDMEIF6                    ,0x00040000 
.equ DMA_HIFCR_CFEIF6                     ,0x00010000 
.equ DMA_HIFCR_CTCIF5                     ,0x00000800 
.equ DMA_HIFCR_CHTIF5                     ,0x00000400 
.equ DMA_HIFCR_CTEIF5                     ,0x00000200 
.equ DMA_HIFCR_CDMEIF5                    ,0x00000100 
.equ DMA_HIFCR_CFEIF5                     ,0x00000040 
.equ DMA_HIFCR_CTCIF4                     ,0x00000020 
.equ DMA_HIFCR_CHTIF4                     ,0x00000010 
.equ DMA_HIFCR_CTEIF4                     ,0x00000008 
.equ DMA_HIFCR_CDMEIF4                    ,0x00000004 
.equ DMA_HIFCR_CFEIF4                     ,0x00000001 

@*****************************************************************************/
@                                                                            */
@                    External Interrupt/Event Controller                     */
@                                                                            */
@*****************************************************************************/
@******************  Bit definition for EXTI_IMR register  *******************/
.equ  EXTI_IMR_MR0                        ,0x00000001         @< Interrupt Mask on line 0 */
.equ  EXTI_IMR_MR1                        ,0x00000002         @< Interrupt Mask on line 1 */
.equ  EXTI_IMR_MR2                        ,0x00000004         @< Interrupt Mask on line 2 */
.equ  EXTI_IMR_MR3                        ,0x00000008         @< Interrupt Mask on line 3 */
.equ  EXTI_IMR_MR4                        ,0x00000010         @< Interrupt Mask on line 4 */
.equ  EXTI_IMR_MR5                        ,0x00000020         @< Interrupt Mask on line 5 */
.equ  EXTI_IMR_MR6                        ,0x00000040         @< Interrupt Mask on line 6 */
.equ  EXTI_IMR_MR7                        ,0x00000080         @< Interrupt Mask on line 7 */
.equ  EXTI_IMR_MR8                        ,0x00000100         @< Interrupt Mask on line 8 */
.equ  EXTI_IMR_MR9                        ,0x00000200         @< Interrupt Mask on line 9 */
.equ  EXTI_IMR_MR10                       ,0x00000400         @< Interrupt Mask on line 10 */
.equ  EXTI_IMR_MR11                       ,0x00000800         @< Interrupt Mask on line 11 */
.equ  EXTI_IMR_MR12                       ,0x00001000         @< Interrupt Mask on line 12 */
.equ  EXTI_IMR_MR13                       ,0x00002000         @< Interrupt Mask on line 13 */
.equ  EXTI_IMR_MR14                       ,0x00004000         @< Interrupt Mask on line 14 */
.equ  EXTI_IMR_MR15                       ,0x00008000         @< Interrupt Mask on line 15 */
.equ  EXTI_IMR_MR16                       ,0x00010000         @< Interrupt Mask on line 16 */
.equ  EXTI_IMR_MR17                       ,0x00020000         @< Interrupt Mask on line 17 */
.equ  EXTI_IMR_MR18                       ,0x00040000         @< Interrupt Mask on line 18 */
.equ  EXTI_IMR_MR19                       ,0x00080000         @< Interrupt Mask on line 19 */

@******************  Bit definition for EXTI_EMR register  *******************/
.equ  EXTI_EMR_MR0                        ,0x00000001         @< Event Mask on line 0 */
.equ  EXTI_EMR_MR1                        ,0x00000002         @< Event Mask on line 1 */
.equ  EXTI_EMR_MR2                        ,0x00000004         @< Event Mask on line 2 */
.equ  EXTI_EMR_MR3                        ,0x00000008         @< Event Mask on line 3 */
.equ  EXTI_EMR_MR4                        ,0x00000010         @< Event Mask on line 4 */
.equ  EXTI_EMR_MR5                        ,0x00000020         @< Event Mask on line 5 */
.equ  EXTI_EMR_MR6                        ,0x00000040         @< Event Mask on line 6 */
.equ  EXTI_EMR_MR7                        ,0x00000080         @< Event Mask on line 7 */
.equ  EXTI_EMR_MR8                        ,0x00000100         @< Event Mask on line 8 */
.equ  EXTI_EMR_MR9                        ,0x00000200         @< Event Mask on line 9 */
.equ  EXTI_EMR_MR10                       ,0x00000400         @< Event Mask on line 10 */
.equ  EXTI_EMR_MR11                       ,0x00000800         @< Event Mask on line 11 */
.equ  EXTI_EMR_MR12                       ,0x00001000         @< Event Mask on line 12 */
.equ  EXTI_EMR_MR13                       ,0x00002000         @< Event Mask on line 13 */
.equ  EXTI_EMR_MR14                       ,0x00004000         @< Event Mask on line 14 */
.equ  EXTI_EMR_MR15                       ,0x00008000         @< Event Mask on line 15 */
.equ  EXTI_EMR_MR16                       ,0x00010000         @< Event Mask on line 16 */
.equ  EXTI_EMR_MR17                       ,0x00020000         @< Event Mask on line 17 */
.equ  EXTI_EMR_MR18                       ,0x00040000         @< Event Mask on line 18 */
.equ  EXTI_EMR_MR19                       ,0x00080000         @< Event Mask on line 19 */

@*****************  Bit definition for EXTI_RTSR register  *******************/
.equ  EXTI_RTSR_TR0                       ,0x00000001         @< Rising trigger event configuration bit of line 0 */
.equ  EXTI_RTSR_TR1                       ,0x00000002         @< Rising trigger event configuration bit of line 1 */
.equ  EXTI_RTSR_TR2                       ,0x00000004         @< Rising trigger event configuration bit of line 2 */
.equ  EXTI_RTSR_TR3                       ,0x00000008         @< Rising trigger event configuration bit of line 3 */
.equ  EXTI_RTSR_TR4                       ,0x00000010         @< Rising trigger event configuration bit of line 4 */
.equ  EXTI_RTSR_TR5                       ,0x00000020         @< Rising trigger event configuration bit of line 5 */
.equ  EXTI_RTSR_TR6                       ,0x00000040         @< Rising trigger event configuration bit of line 6 */
.equ  EXTI_RTSR_TR7                       ,0x00000080         @< Rising trigger event configuration bit of line 7 */
.equ  EXTI_RTSR_TR8                       ,0x00000100         @< Rising trigger event configuration bit of line 8 */
.equ  EXTI_RTSR_TR9                       ,0x00000200         @< Rising trigger event configuration bit of line 9 */
.equ  EXTI_RTSR_TR10                      ,0x00000400         @< Rising trigger event configuration bit of line 10 */
.equ  EXTI_RTSR_TR11                      ,0x00000800         @< Rising trigger event configuration bit of line 11 */
.equ  EXTI_RTSR_TR12                      ,0x00001000         @< Rising trigger event configuration bit of line 12 */
.equ  EXTI_RTSR_TR13                      ,0x00002000         @< Rising trigger event configuration bit of line 13 */
.equ  EXTI_RTSR_TR14                      ,0x00004000         @< Rising trigger event configuration bit of line 14 */
.equ  EXTI_RTSR_TR15                      ,0x00008000         @< Rising trigger event configuration bit of line 15 */
.equ  EXTI_RTSR_TR16                      ,0x00010000         @< Rising trigger event configuration bit of line 16 */
.equ  EXTI_RTSR_TR17                      ,0x00020000         @< Rising trigger event configuration bit of line 17 */
.equ  EXTI_RTSR_TR18                      ,0x00040000         @< Rising trigger event configuration bit of line 18 */
.equ  EXTI_RTSR_TR19                      ,0x00080000         @< Rising trigger event configuration bit of line 19 */

@*****************  Bit definition for EXTI_FTSR register  *******************/
.equ  EXTI_FTSR_TR0                       ,0x00000001         @< Falling trigger event configuration bit of line 0 */
.equ  EXTI_FTSR_TR1                       ,0x00000002         @< Falling trigger event configuration bit of line 1 */
.equ  EXTI_FTSR_TR2                       ,0x00000004         @< Falling trigger event configuration bit of line 2 */
.equ  EXTI_FTSR_TR3                       ,0x00000008         @< Falling trigger event configuration bit of line 3 */
.equ  EXTI_FTSR_TR4                       ,0x00000010         @< Falling trigger event configuration bit of line 4 */
.equ  EXTI_FTSR_TR5                       ,0x00000020         @< Falling trigger event configuration bit of line 5 */
.equ  EXTI_FTSR_TR6                       ,0x00000040         @< Falling trigger event configuration bit of line 6 */
.equ  EXTI_FTSR_TR7                       ,0x00000080         @< Falling trigger event configuration bit of line 7 */
.equ  EXTI_FTSR_TR8                       ,0x00000100         @< Falling trigger event configuration bit of line 8 */
.equ  EXTI_FTSR_TR9                       ,0x00000200         @< Falling trigger event configuration bit of line 9 */
.equ  EXTI_FTSR_TR10                      ,0x00000400         @< Falling trigger event configuration bit of line 10 */
.equ  EXTI_FTSR_TR11                      ,0x00000800         @< Falling trigger event configuration bit of line 11 */
.equ  EXTI_FTSR_TR12                      ,0x00001000         @< Falling trigger event configuration bit of line 12 */
.equ  EXTI_FTSR_TR13                      ,0x00002000         @< Falling trigger event configuration bit of line 13 */
.equ  EXTI_FTSR_TR14                      ,0x00004000         @< Falling trigger event configuration bit of line 14 */
.equ  EXTI_FTSR_TR15                      ,0x00008000         @< Falling trigger event configuration bit of line 15 */
.equ  EXTI_FTSR_TR16                      ,0x00010000         @< Falling trigger event configuration bit of line 16 */
.equ  EXTI_FTSR_TR17                      ,0x00020000         @< Falling trigger event configuration bit of line 17 */
.equ  EXTI_FTSR_TR18                      ,0x00040000         @< Falling trigger event configuration bit of line 18 */
.equ  EXTI_FTSR_TR19                      ,0x00080000         @< Falling trigger event configuration bit of line 19 */

@*****************  Bit definition for EXTI_SWIER register  ******************/
.equ  EXTI_SWIER_SWIER0                   ,0x00000001         @< Software Interrupt on line 0 */
.equ  EXTI_SWIER_SWIER1                   ,0x00000002         @< Software Interrupt on line 1 */
.equ  EXTI_SWIER_SWIER2                   ,0x00000004         @< Software Interrupt on line 2 */
.equ  EXTI_SWIER_SWIER3                   ,0x00000008         @< Software Interrupt on line 3 */
.equ  EXTI_SWIER_SWIER4                   ,0x00000010         @< Software Interrupt on line 4 */
.equ  EXTI_SWIER_SWIER5                   ,0x00000020         @< Software Interrupt on line 5 */
.equ  EXTI_SWIER_SWIER6                   ,0x00000040         @< Software Interrupt on line 6 */
.equ  EXTI_SWIER_SWIER7                   ,0x00000080         @< Software Interrupt on line 7 */
.equ  EXTI_SWIER_SWIER8                   ,0x00000100         @< Software Interrupt on line 8 */
.equ  EXTI_SWIER_SWIER9                   ,0x00000200         @< Software Interrupt on line 9 */
.equ  EXTI_SWIER_SWIER10                  ,0x00000400         @< Software Interrupt on line 10 */
.equ  EXTI_SWIER_SWIER11                  ,0x00000800         @< Software Interrupt on line 11 */
.equ  EXTI_SWIER_SWIER12                  ,0x00001000         @< Software Interrupt on line 12 */
.equ  EXTI_SWIER_SWIER13                  ,0x00002000         @< Software Interrupt on line 13 */
.equ  EXTI_SWIER_SWIER14                  ,0x00004000         @< Software Interrupt on line 14 */
.equ  EXTI_SWIER_SWIER15                  ,0x00008000         @< Software Interrupt on line 15 */
.equ  EXTI_SWIER_SWIER16                  ,0x00010000         @< Software Interrupt on line 16 */
.equ  EXTI_SWIER_SWIER17                  ,0x00020000         @< Software Interrupt on line 17 */
.equ  EXTI_SWIER_SWIER18                  ,0x00040000         @< Software Interrupt on line 18 */
.equ  EXTI_SWIER_SWIER19                  ,0x00080000         @< Software Interrupt on line 19 */

@******************  Bit definition for EXTI_PR register  ********************/
.equ  EXTI_PR_PR0                         ,0x00000001         @< Pending bit for line 0 */
.equ  EXTI_PR_PR1                         ,0x00000002         @< Pending bit for line 1 */
.equ  EXTI_PR_PR2                         ,0x00000004         @< Pending bit for line 2 */
.equ  EXTI_PR_PR3                         ,0x00000008         @< Pending bit for line 3 */
.equ  EXTI_PR_PR4                         ,0x00000010         @< Pending bit for line 4 */
.equ  EXTI_PR_PR5                         ,0x00000020         @< Pending bit for line 5 */
.equ  EXTI_PR_PR6                         ,0x00000040         @< Pending bit for line 6 */
.equ  EXTI_PR_PR7                         ,0x00000080         @< Pending bit for line 7 */
.equ  EXTI_PR_PR8                         ,0x00000100         @< Pending bit for line 8 */
.equ  EXTI_PR_PR9                         ,0x00000200         @< Pending bit for line 9 */
.equ  EXTI_PR_PR10                        ,0x00000400         @< Pending bit for line 10 */
.equ  EXTI_PR_PR11                        ,0x00000800         @< Pending bit for line 11 */
.equ  EXTI_PR_PR12                        ,0x00001000         @< Pending bit for line 12 */
.equ  EXTI_PR_PR13                        ,0x00002000         @< Pending bit for line 13 */
.equ  EXTI_PR_PR14                        ,0x00004000         @< Pending bit for line 14 */
.equ  EXTI_PR_PR15                        ,0x00008000         @< Pending bit for line 15 */
.equ  EXTI_PR_PR16                        ,0x00010000         @< Pending bit for line 16 */
.equ  EXTI_PR_PR17                        ,0x00020000         @< Pending bit for line 17 */
.equ  EXTI_PR_PR18                        ,0x00040000         @< Pending bit for line 18 */
.equ  EXTI_PR_PR19                        ,0x00080000         @< Pending bit for line 19 */

@*****************************************************************************/
@                                                                            */
@                                    FLASH                                   */
@                                                                            */
@*****************************************************************************/
@******************  Bits definition for FLASH_ACR register  *****************/
.equ FLASH_ACR_LATENCY                    ,0x00000007 
.equ FLASH_ACR_LATENCY_0WS                ,0x00000000 
.equ FLASH_ACR_LATENCY_1WS                ,0x00000001 
.equ FLASH_ACR_LATENCY_2WS                ,0x00000002 
.equ FLASH_ACR_LATENCY_3WS                ,0x00000003 
.equ FLASH_ACR_LATENCY_4WS                ,0x00000004 
.equ FLASH_ACR_LATENCY_5WS                ,0x00000005 
.equ FLASH_ACR_LATENCY_6WS                ,0x00000006 
.equ FLASH_ACR_LATENCY_7WS                ,0x00000007 

