ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
.equ FLASH_ACR_PRFTEN                     ,0x00000100 
.equ FLASH_ACR_ICEN                       ,0x00000200 
.equ FLASH_ACR_DCEN                       ,0x00000400 
.equ FLASH_ACR_ICRST                      ,0x00000800 
.equ FLASH_ACR_DCRST                      ,0x00001000 
.equ FLASH_ACR_BYTE0_ADDRESS              ,0x40023C00 
.equ FLASH_ACR_BYTE2_ADDRESS              ,0x40023C03 

@******************  Bits definition for FLASH_SR register  ******************/
.equ FLASH_SR_EOP                         ,0x00000001 
.equ FLASH_SR_SOP                         ,0x00000002 
.equ FLASH_SR_WRPERR                      ,0x00000010 
.equ FLASH_SR_PGAERR                      ,0x00000020 
.equ FLASH_SR_PGPERR                      ,0x00000040 
.equ FLASH_SR_PGSERR                      ,0x00000080 
.equ FLASH_SR_BSY                         ,0x00010000 

@******************  Bits definition for FLASH_CR register  ******************/
.equ FLASH_CR_PG                          ,0x00000001 
.equ FLASH_CR_SER                         ,0x00000002 
.equ FLASH_CR_MER                         ,0x00000004 
.equ FLASH_CR_SNB_0                       ,0x00000008 
.equ FLASH_CR_SNB_1                       ,0x00000010 
.equ FLASH_CR_SNB_2                       ,0x00000020 
.equ FLASH_CR_SNB_3                       ,0x00000040 
.equ FLASH_CR_PSIZE_0                     ,0x00000100 
.equ FLASH_CR_PSIZE_1                     ,0x00000200 
.equ FLASH_CR_STRT                        ,0x00010000 
.equ FLASH_CR_EOPIE                       ,0x01000000 
.equ FLASH_CR_LOCK                        ,0x80000000 

@******************  Bits definition for FLASH_OPTCR register  ***************/
.equ FLASH_OPTCR_OPTLOCK                  ,0x00000001 
.equ FLASH_OPTCR_OPTSTRT                  ,0x00000002 
.equ FLASH_OPTCR_BOR_LEV_0                ,0x00000004 
.equ FLASH_OPTCR_BOR_LEV_1                ,0x00000008 
.equ FLASH_OPTCR_BOR_LEV                  ,0x0000000C 
.equ FLASH_OPTCR_WDG_SW                   ,0x00000020 
.equ FLASH_OPTCR_nRST_STOP                ,0x00000040 
.equ FLASH_OPTCR_nRST_STDBY               ,0x00000080 
.equ FLASH_OPTCR_RDP_0                    ,0x00000100 
.equ FLASH_OPTCR_RDP_1                    ,0x00000200 
.equ FLASH_OPTCR_RDP_2                    ,0x00000400 
.equ FLASH_OPTCR_RDP_3                    ,0x00000800 
.equ FLASH_OPTCR_RDP_4                    ,0x00001000 
.equ FLASH_OPTCR_RDP_5                    ,0x00002000 
.equ FLASH_OPTCR_RDP_6                    ,0x00004000 
.equ FLASH_OPTCR_RDP_7                    ,0x00008000 
.equ FLASH_OPTCR_nWRP_0                   ,0x00010000 
.equ FLASH_OPTCR_nWRP_1                   ,0x00020000 
.equ FLASH_OPTCR_nWRP_2                   ,0x00040000 
.equ FLASH_OPTCR_nWRP_3                   ,0x00080000 
.equ FLASH_OPTCR_nWRP_4                   ,0x00100000 
.equ FLASH_OPTCR_nWRP_5                   ,0x00200000 
.equ FLASH_OPTCR_nWRP_6                   ,0x00400000 
.equ FLASH_OPTCR_nWRP_7                   ,0x00800000 
.equ FLASH_OPTCR_nWRP_8                   ,0x01000000 
.equ FLASH_OPTCR_nWRP_9                   ,0x02000000 
.equ FLASH_OPTCR_nWRP_10                  ,0x04000000 
.equ FLASH_OPTCR_nWRP_11                  ,0x08000000 

@*****************************************************************************/
@                                                                            */
@                       Flexible Static Memory Controller                    */
@                                                                            */
@*****************************************************************************/
@*****************  Bit definition for FSMC_BCR1 register  *******************/
.equ  FSMC_BCR1_MBKEN                     ,0x00000001         @<Memory bank enable bit */
.equ  FSMC_BCR1_MUXEN                     ,0x00000002         @<Address/data multiplexing enable bit */

.equ  FSMC_BCR1_MTYP                      ,0x0000000C         @<MTYP[1:0] bits (Memory type) */
.equ  FSMC_BCR1_MTYP_0                    ,0x00000004         @<Bit 0 */
.equ  FSMC_BCR1_MTYP_1                    ,0x00000008         @<Bit 1 */

.equ  FSMC_BCR1_MWID                      ,0x00000030         @<MWID[1:0] bits (Memory data bus width) */
.equ  FSMC_BCR1_MWID_0                    ,0x00000010         @<Bit 0 */
.equ  FSMC_BCR1_MWID_1                    ,0x00000020         @<Bit 1 */

.equ  FSMC_BCR1_FACCEN                    ,0x00000040         @<Flash access enable */
.equ  FSMC_BCR1_BURSTEN                   ,0x00000100         @<Burst enable bit */
.equ  FSMC_BCR1_WAITPOL                   ,0x00000200         @<Wait signal polarity bit */
.equ  FSMC_BCR1_WRAPMOD                   ,0x00000400         @<Wrapped burst mode support */
.equ  FSMC_BCR1_WAITCFG                   ,0x00000800         @<Wait timing configuration */
.equ  FSMC_BCR1_WREN                      ,0x00001000         @<Write enable bit */
.equ  FSMC_BCR1_WAITEN                    ,0x00002000         @<Wait enable bit */
.equ  FSMC_BCR1_EXTMOD                    ,0x00004000         @<Extended mode enable */
.equ  FSMC_BCR1_ASYNCWAIT                 ,0x00008000         @<Asynchronous wait */
.equ  FSMC_BCR1_CBURSTRW                  ,0x00080000         @<Write burst enable */

@*****************  Bit definition for FSMC_BCR2 register  *******************/
.equ  FSMC_BCR2_MBKEN                     ,0x00000001         @<Memory bank enable bit */
.equ  FSMC_BCR2_MUXEN                     ,0x00000002         @<Address/data multiplexing enable bit */

.equ  FSMC_BCR2_MTYP                      ,0x0000000C         @<MTYP[1:0] bits (Memory type) */
.equ  FSMC_BCR2_MTYP_0                    ,0x00000004         @<Bit 0 */
.equ  FSMC_BCR2_MTYP_1                    ,0x00000008         @<Bit 1 */

.equ  FSMC_BCR2_MWID                      ,0x00000030         @<MWID[1:0] bits (Memory data bus width) */
.equ  FSMC_BCR2_MWID_0                    ,0x00000010         @<Bit 0 */
.equ  FSMC_BCR2_MWID_1                    ,0x00000020         @<Bit 1 */

