ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
.equ  FSMC_BCR2_FACCEN                    ,0x00000040         @<Flash access enable */
.equ  FSMC_BCR2_BURSTEN                   ,0x00000100         @<Burst enable bit */
.equ  FSMC_BCR2_WAITPOL                   ,0x00000200         @<Wait signal polarity bit */
.equ  FSMC_BCR2_WRAPMOD                   ,0x00000400         @<Wrapped burst mode support */
.equ  FSMC_BCR2_WAITCFG                   ,0x00000800         @<Wait timing configuration */
.equ  FSMC_BCR2_WREN                      ,0x00001000         @<Write enable bit */
.equ  FSMC_BCR2_WAITEN                    ,0x00002000         @<Wait enable bit */
.equ  FSMC_BCR2_EXTMOD                    ,0x00004000         @<Extended mode enable */
.equ  FSMC_BCR2_ASYNCWAIT                 ,0x00008000         @<Asynchronous wait */
.equ  FSMC_BCR2_CBURSTRW                  ,0x00080000         @<Write burst enable */

@*****************  Bit definition for FSMC_BCR3 register  *******************/
.equ  FSMC_BCR3_MBKEN                     ,0x00000001         @<Memory bank enable bit */
.equ  FSMC_BCR3_MUXEN                     ,0x00000002         @<Address/data multiplexing enable bit */

.equ  FSMC_BCR3_MTYP                      ,0x0000000C         @<MTYP[1:0] bits (Memory type) */
.equ  FSMC_BCR3_MTYP_0                    ,0x00000004         @<Bit 0 */
.equ  FSMC_BCR3_MTYP_1                    ,0x00000008         @<Bit 1 */

.equ  FSMC_BCR3_MWID                      ,0x00000030         @<MWID[1:0] bits (Memory data bus width) */
.equ  FSMC_BCR3_MWID_0                    ,0x00000010         @<Bit 0 */
.equ  FSMC_BCR3_MWID_1                    ,0x00000020         @<Bit 1 */

.equ  FSMC_BCR3_FACCEN                    ,0x00000040         @<Flash access enable */
.equ  FSMC_BCR3_BURSTEN                   ,0x00000100         @<Burst enable bit */
.equ  FSMC_BCR3_WAITPOL                   ,0x00000200         @<Wait signal polarity bit. */
.equ  FSMC_BCR3_WRAPMOD                   ,0x00000400         @<Wrapped burst mode support */
.equ  FSMC_BCR3_WAITCFG                   ,0x00000800         @<Wait timing configuration */
.equ  FSMC_BCR3_WREN                      ,0x00001000         @<Write enable bit */
.equ  FSMC_BCR3_WAITEN                    ,0x00002000         @<Wait enable bit */
.equ  FSMC_BCR3_EXTMOD                    ,0x00004000         @<Extended mode enable */
.equ  FSMC_BCR3_ASYNCWAIT                 ,0x00008000         @<Asynchronous wait */
.equ  FSMC_BCR3_CBURSTRW                  ,0x00080000         @<Write burst enable */

@*****************  Bit definition for FSMC_BCR4 register  *******************/
.equ  FSMC_BCR4_MBKEN                     ,0x00000001         @<Memory bank enable bit */
.equ  FSMC_BCR4_MUXEN                     ,0x00000002         @<Address/data multiplexing enable bit */

.equ  FSMC_BCR4_MTYP                      ,0x0000000C         @<MTYP[1:0] bits (Memory type) */
.equ  FSMC_BCR4_MTYP_0                    ,0x00000004         @<Bit 0 */
.equ  FSMC_BCR4_MTYP_1                    ,0x00000008         @<Bit 1 */

.equ  FSMC_BCR4_MWID                      ,0x00000030         @<MWID[1:0] bits (Memory data bus width) */
.equ  FSMC_BCR4_MWID_0                    ,0x00000010         @<Bit 0 */
.equ  FSMC_BCR4_MWID_1                    ,0x00000020         @<Bit 1 */

.equ  FSMC_BCR4_FACCEN                    ,0x00000040         @<Flash access enable */
.equ  FSMC_BCR4_BURSTEN                   ,0x00000100         @<Burst enable bit */
.equ  FSMC_BCR4_WAITPOL                   ,0x00000200         @<Wait signal polarity bit */
.equ  FSMC_BCR4_WRAPMOD                   ,0x00000400         @<Wrapped burst mode support */
.equ  FSMC_BCR4_WAITCFG                   ,0x00000800         @<Wait timing configuration */
.equ  FSMC_BCR4_WREN                      ,0x00001000         @<Write enable bit */
.equ  FSMC_BCR4_WAITEN                    ,0x00002000         @<Wait enable bit */
.equ  FSMC_BCR4_EXTMOD                    ,0x00004000         @<Extended mode enable */
.equ  FSMC_BCR4_ASYNCWAIT                 ,0x00008000         @<Asynchronous wait */
.equ  FSMC_BCR4_CBURSTRW                  ,0x00080000         @<Write burst enable */

@*****************  Bit definition for FSMC_BTR1 register  ******************/
.equ  FSMC_BTR1_ADDSET                    ,0x0000000F         @<ADDSET[3:0] bits (Address setup phase duration) */
.equ  FSMC_BTR1_ADDSET_0                  ,0x00000001         @<Bit 0 */
.equ  FSMC_BTR1_ADDSET_1                  ,0x00000002         @<Bit 1 */
.equ  FSMC_BTR1_ADDSET_2                  ,0x00000004         @<Bit 2 */
.equ  FSMC_BTR1_ADDSET_3                  ,0x00000008         @<Bit 3 */

.equ  FSMC_BTR1_ADDHLD                    ,0x000000F0         @<ADDHLD[3:0] bits (Address-hold phase duration) */
.equ  FSMC_BTR1_ADDHLD_0                  ,0x00000010         @<Bit 0 */
.equ  FSMC_BTR1_ADDHLD_1                  ,0x00000020         @<Bit 1 */
.equ  FSMC_BTR1_ADDHLD_2                  ,0x00000040         @<Bit 2 */
.equ  FSMC_BTR1_ADDHLD_3                  ,0x00000080         @<Bit 3 */

.equ  FSMC_BTR1_DATAST                    ,0x0000FF00         @<DATAST [3:0] bits (Data-phase duration) */
.equ  FSMC_BTR1_DATAST_0                  ,0x00000100         @<Bit 0 */
.equ  FSMC_BTR1_DATAST_1                  ,0x00000200         @<Bit 1 */
.equ  FSMC_BTR1_DATAST_2                  ,0x00000400         @<Bit 2 */
.equ  FSMC_BTR1_DATAST_3                  ,0x00000800         @<Bit 3 */

.equ  FSMC_BTR1_BUSTURN                   ,0x000F0000         @<BUSTURN[3:0] bits (Bus turnaround phase duration) */
.equ  FSMC_BTR1_BUSTURN_0                 ,0x00010000         @<Bit 0 */
.equ  FSMC_BTR1_BUSTURN_1                 ,0x00020000         @<Bit 1 */
.equ  FSMC_BTR1_BUSTURN_2                 ,0x00040000         @<Bit 2 */
.equ  FSMC_BTR1_BUSTURN_3                 ,0x00080000         @<Bit 3 */

.equ  FSMC_BTR1_CLKDIV                    ,0x00F00000         @<CLKDIV[3:0] bits (Clock divide ratio) */
.equ  FSMC_BTR1_CLKDIV_0                  ,0x00100000         @<Bit 0 */
.equ  FSMC_BTR1_CLKDIV_1                  ,0x00200000         @<Bit 1 */
.equ  FSMC_BTR1_CLKDIV_2                  ,0x00400000         @<Bit 2 */
.equ  FSMC_BTR1_CLKDIV_3                  ,0x00800000         @<Bit 3 */

.equ  FSMC_BTR1_DATLAT                    ,0x0F000000         @<DATLA[3:0] bits (Data latency) */
.equ  FSMC_BTR1_DATLAT_0                  ,0x01000000         @<Bit 0 */
.equ  FSMC_BTR1_DATLAT_1                  ,0x02000000         @<Bit 1 */
.equ  FSMC_BTR1_DATLAT_2                  ,0x04000000         @<Bit 2 */
.equ  FSMC_BTR1_DATLAT_3                  ,0x08000000         @<Bit 3 */

.equ  FSMC_BTR1_ACCMOD                    ,0x30000000         @<ACCMOD[1:0] bits (Access mode) */
.equ  FSMC_BTR1_ACCMOD_0                  ,0x10000000         @<Bit 0 */
.equ  FSMC_BTR1_ACCMOD_1                  ,0x20000000         @<Bit 1 */

