ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
@*****************  Bit definition for FSMC_BWTR1 register  ******************/
.equ  FSMC_BWTR1_ADDSET                   ,0x0000000F         @<ADDSET[3:0] bits (Address setup phase duration) */
.equ  FSMC_BWTR1_ADDSET_0                 ,0x00000001         @<Bit 0 */
.equ  FSMC_BWTR1_ADDSET_1                 ,0x00000002         @<Bit 1 */
.equ  FSMC_BWTR1_ADDSET_2                 ,0x00000004         @<Bit 2 */
.equ  FSMC_BWTR1_ADDSET_3                 ,0x00000008         @<Bit 3 */

.equ  FSMC_BWTR1_ADDHLD                   ,0x000000F0         @<ADDHLD[3:0] bits (Address-hold phase duration) */
.equ  FSMC_BWTR1_ADDHLD_0                 ,0x00000010         @<Bit 0 */
.equ  FSMC_BWTR1_ADDHLD_1                 ,0x00000020         @<Bit 1 */
.equ  FSMC_BWTR1_ADDHLD_2                 ,0x00000040         @<Bit 2 */
.equ  FSMC_BWTR1_ADDHLD_3                 ,0x00000080         @<Bit 3 */

.equ  FSMC_BWTR1_DATAST                   ,0x0000FF00         @<DATAST [3:0] bits (Data-phase duration) */
.equ  FSMC_BWTR1_DATAST_0                 ,0x00000100         @<Bit 0 */
.equ  FSMC_BWTR1_DATAST_1                 ,0x00000200         @<Bit 1 */
.equ  FSMC_BWTR1_DATAST_2                 ,0x00000400         @<Bit 2 */
.equ  FSMC_BWTR1_DATAST_3                 ,0x00000800         @<Bit 3 */

.equ  FSMC_BWTR1_CLKDIV                   ,0x00F00000         @<CLKDIV[3:0] bits (Clock divide ratio) */
.equ  FSMC_BWTR1_CLKDIV_0                 ,0x00100000         @<Bit 0 */
.equ  FSMC_BWTR1_CLKDIV_1                 ,0x00200000         @<Bit 1 */
.equ  FSMC_BWTR1_CLKDIV_2                 ,0x00400000         @<Bit 2 */
.equ  FSMC_BWTR1_CLKDIV_3                 ,0x00800000         @<Bit 3 */

.equ  FSMC_BWTR1_DATLAT                   ,0x0F000000         @<DATLA[3:0] bits (Data latency) */
.equ  FSMC_BWTR1_DATLAT_0                 ,0x01000000         @<Bit 0 */
.equ  FSMC_BWTR1_DATLAT_1                 ,0x02000000         @<Bit 1 */
.equ  FSMC_BWTR1_DATLAT_2                 ,0x04000000         @<Bit 2 */
.equ  FSMC_BWTR1_DATLAT_3                 ,0x08000000         @<Bit 3 */

.equ  FSMC_BWTR1_ACCMOD                   ,0x30000000         @<ACCMOD[1:0] bits (Access mode) */
.equ  FSMC_BWTR1_ACCMOD_0                 ,0x10000000         @<Bit 0 */
.equ  FSMC_BWTR1_ACCMOD_1                 ,0x20000000         @<Bit 1 */

@*****************  Bit definition for FSMC_BWTR2 register  ******************/
.equ  FSMC_BWTR2_ADDSET                   ,0x0000000F         @<ADDSET[3:0] bits (Address setup phase duration) */
.equ  FSMC_BWTR2_ADDSET_0                 ,0x00000001         @<Bit 0 */
.equ  FSMC_BWTR2_ADDSET_1                 ,0x00000002         @<Bit 1 */
.equ  FSMC_BWTR2_ADDSET_2                 ,0x00000004         @<Bit 2 */
.equ  FSMC_BWTR2_ADDSET_3                 ,0x00000008         @<Bit 3 */

.equ  FSMC_BWTR2_ADDHLD                   ,0x000000F0         @<ADDHLD[3:0] bits (Address-hold phase duration) */
.equ  FSMC_BWTR2_ADDHLD_0                 ,0x00000010         @<Bit 0 */
.equ  FSMC_BWTR2_ADDHLD_1                 ,0x00000020         @<Bit 1 */
.equ  FSMC_BWTR2_ADDHLD_2                 ,0x00000040         @<Bit 2 */
.equ  FSMC_BWTR2_ADDHLD_3                 ,0x00000080         @<Bit 3 */

.equ  FSMC_BWTR2_DATAST                   ,0x0000FF00         @<DATAST [3:0] bits (Data-phase duration) */
.equ  FSMC_BWTR2_DATAST_0                 ,0x00000100         @<Bit 0 */
.equ  FSMC_BWTR2_DATAST_1                 ,0x00000200         @<Bit 1 */
.equ  FSMC_BWTR2_DATAST_2                 ,0x00000400         @<Bit 2 */
.equ  FSMC_BWTR2_DATAST_3                 ,0x00000800         @<Bit 3 */

.equ  FSMC_BWTR2_CLKDIV                   ,0x00F00000         @<CLKDIV[3:0] bits (Clock divide ratio) */
.equ  FSMC_BWTR2_CLKDIV_0                 ,0x00100000         @<Bit 0 */
.equ  FSMC_BWTR2_CLKDIV_1                 ,0x00200000         @<Bit 1*/
.equ  FSMC_BWTR2_CLKDIV_2                 ,0x00400000         @<Bit 2 */
.equ  FSMC_BWTR2_CLKDIV_3                 ,0x00800000         @<Bit 3 */

.equ  FSMC_BWTR2_DATLAT                   ,0x0F000000         @<DATLA[3:0] bits (Data latency) */
.equ  FSMC_BWTR2_DATLAT_0                 ,0x01000000         @<Bit 0 */
.equ  FSMC_BWTR2_DATLAT_1                 ,0x02000000         @<Bit 1 */
.equ  FSMC_BWTR2_DATLAT_2                 ,0x04000000         @<Bit 2 */
.equ  FSMC_BWTR2_DATLAT_3                 ,0x08000000         @<Bit 3 */

.equ  FSMC_BWTR2_ACCMOD                   ,0x30000000         @<ACCMOD[1:0] bits (Access mode) */
.equ  FSMC_BWTR2_ACCMOD_0                 ,0x10000000         @<Bit 0 */
.equ  FSMC_BWTR2_ACCMOD_1                 ,0x20000000         @<Bit 1 */

@*****************  Bit definition for FSMC_BWTR3 register  ******************/
.equ  FSMC_BWTR3_ADDSET                   ,0x0000000F         @<ADDSET[3:0] bits (Address setup phase duration) */
.equ  FSMC_BWTR3_ADDSET_0                 ,0x00000001         @<Bit 0 */
.equ  FSMC_BWTR3_ADDSET_1                 ,0x00000002         @<Bit 1 */
.equ  FSMC_BWTR3_ADDSET_2                 ,0x00000004         @<Bit 2 */
.equ  FSMC_BWTR3_ADDSET_3                 ,0x00000008         @<Bit 3 */

.equ  FSMC_BWTR3_ADDHLD                   ,0x000000F0         @<ADDHLD[3:0] bits (Address-hold phase duration) */
.equ  FSMC_BWTR3_ADDHLD_0                 ,0x00000010         @<Bit 0 */
.equ  FSMC_BWTR3_ADDHLD_1                 ,0x00000020         @<Bit 1 */
.equ  FSMC_BWTR3_ADDHLD_2                 ,0x00000040         @<Bit 2 */
.equ  FSMC_BWTR3_ADDHLD_3                 ,0x00000080         @<Bit 3 */

.equ  FSMC_BWTR3_DATAST                   ,0x0000FF00         @<DATAST [3:0] bits (Data-phase duration) */
.equ  FSMC_BWTR3_DATAST_0                 ,0x00000100         @<Bit 0 */
.equ  FSMC_BWTR3_DATAST_1                 ,0x00000200         @<Bit 1 */
.equ  FSMC_BWTR3_DATAST_2                 ,0x00000400         @<Bit 2 */
.equ  FSMC_BWTR3_DATAST_3                 ,0x00000800         @<Bit 3 */

.equ  FSMC_BWTR3_CLKDIV                   ,0x00F00000         @<CLKDIV[3:0] bits (Clock divide ratio) */
.equ  FSMC_BWTR3_CLKDIV_0                 ,0x00100000         @<Bit 0 */
.equ  FSMC_BWTR3_CLKDIV_1                 ,0x00200000         @<Bit 1 */
.equ  FSMC_BWTR3_CLKDIV_2                 ,0x00400000         @<Bit 2 */
.equ  FSMC_BWTR3_CLKDIV_3                 ,0x00800000         @<Bit 3 */

.equ  FSMC_BWTR3_DATLAT                   ,0x0F000000         @<DATLA[3:0] bits (Data latency) */
.equ  FSMC_BWTR3_DATLAT_0                 ,0x01000000         @<Bit 0 */
.equ  FSMC_BWTR3_DATLAT_1                 ,0x02000000         @<Bit 1 */
.equ  FSMC_BWTR3_DATLAT_2                 ,0x04000000         @<Bit 2 */
.equ  FSMC_BWTR3_DATLAT_3                 ,0x08000000         @<Bit 3 */

.equ  FSMC_BWTR3_ACCMOD                   ,0x30000000         @<ACCMOD[1:0] bits (Access mode) */
.equ  FSMC_BWTR3_ACCMOD_0                 ,0x10000000         @<Bit 0 */
.equ  FSMC_BWTR3_ACCMOD_1                 ,0x20000000         @<Bit 1 */

@*****************  Bit definition for FSMC_BWTR4 register  ******************/
.equ  FSMC_BWTR4_ADDSET                   ,0x0000000F         @<ADDSET[3:0] bits (Address setup phase duration) */
.equ  FSMC_BWTR4_ADDSET_0                 ,0x00000001         @<Bit 0 */
.equ  FSMC_BWTR4_ADDSET_1                 ,0x00000002         @<Bit 1 */
.equ  FSMC_BWTR4_ADDSET_2                 ,0x00000004         @<Bit 2 */
.equ  FSMC_BWTR4_ADDSET_3                 ,0x00000008         @<Bit 3 */

.equ  FSMC_BWTR4_ADDHLD                   ,0x000000F0         @<ADDHLD[3:0] bits (Address-hold phase duration) */
.equ  FSMC_BWTR4_ADDHLD_0                 ,0x00000010         @<Bit 0 */
.equ  FSMC_BWTR4_ADDHLD_1                 ,0x00000020         @<Bit 1 */
.equ  FSMC_BWTR4_ADDHLD_2                 ,0x00000040         @<Bit 2 */
.equ  FSMC_BWTR4_ADDHLD_3                 ,0x00000080         @<Bit 3 */

.equ  FSMC_BWTR4_DATAST                   ,0x0000FF00         @<DATAST [3:0] bits (Data-phase duration) */
.equ  FSMC_BWTR4_DATAST_0                 ,0x00000100         @<Bit 0 */
.equ  FSMC_BWTR4_DATAST_1                 ,0x00000200         @<Bit 1 */
.equ  FSMC_BWTR4_DATAST_2                 ,0x00000400         @<Bit 2 */
.equ  FSMC_BWTR4_DATAST_3                 ,0x00000800         @<Bit 3 */

.equ  FSMC_BWTR4_CLKDIV                   ,0x00F00000         @<CLKDIV[3:0] bits (Clock divide ratio) */
.equ  FSMC_BWTR4_CLKDIV_0                 ,0x00100000         @<Bit 0 */
.equ  FSMC_BWTR4_CLKDIV_1                 ,0x00200000         @<Bit 1 */
.equ  FSMC_BWTR4_CLKDIV_2                 ,0x00400000         @<Bit 2 */
.equ  FSMC_BWTR4_CLKDIV_3                 ,0x00800000         @<Bit 3 */

.equ  FSMC_BWTR4_DATLAT                   ,0x0F000000         @<DATLA[3:0] bits (Data latency) */
.equ  FSMC_BWTR4_DATLAT_0                 ,0x01000000         @<Bit 0 */
.equ  FSMC_BWTR4_DATLAT_1                 ,0x02000000         @<Bit 1 */
.equ  FSMC_BWTR4_DATLAT_2                 ,0x04000000         @<Bit 2 */
.equ  FSMC_BWTR4_DATLAT_3                 ,0x08000000         @<Bit 3 */

.equ  FSMC_BWTR4_ACCMOD                   ,0x30000000         @<ACCMOD[1:0] bits (Access mode) */
.equ  FSMC_BWTR4_ACCMOD_0                 ,0x10000000         @<Bit 0 */
.equ  FSMC_BWTR4_ACCMOD_1                 ,0x20000000         @<Bit 1 */

@*****************  Bit definition for FSMC_PCR2 register  *******************/
.equ  FSMC_PCR2_PWAITEN                   ,0x00000002         @<Wait feature enable bit */
.equ  FSMC_PCR2_PBKEN                     ,0x00000004         @<PC Card/NAND Flash memory bank enable bit */
.equ  FSMC_PCR2_PTYP                      ,0x00000008         @<Memory type */

.equ  FSMC_PCR2_PWID                      ,0x00000030         @<PWID[1:0] bits (NAND Flash databus width) */
.equ  FSMC_PCR2_PWID_0                    ,0x00000010         @<Bit 0 */
.equ  FSMC_PCR2_PWID_1                    ,0x00000020         @<Bit 1 */

.equ  FSMC_PCR2_ECCEN                     ,0x00000040         @<ECC computation logic enable bit */

.equ  FSMC_PCR2_TCLR                      ,0x00001E00         @<TCLR[3:0] bits (CLE to RE delay) */
.equ  FSMC_PCR2_TCLR_0                    ,0x00000200         @<Bit 0 */
.equ  FSMC_PCR2_TCLR_1                    ,0x00000400         @<Bit 1 */
.equ  FSMC_PCR2_TCLR_2                    ,0x00000800         @<Bit 2 */
.equ  FSMC_PCR2_TCLR_3                    ,0x00001000         @<Bit 3 */

.equ  FSMC_PCR2_TAR                       ,0x0001E000         @<TAR[3:0] bits (ALE to RE delay) */
.equ  FSMC_PCR2_TAR_0                     ,0x00002000         @<Bit 0 */
.equ  FSMC_PCR2_TAR_1                     ,0x00004000         @<Bit 1 */
.equ  FSMC_PCR2_TAR_2                     ,0x00008000         @<Bit 2 */
.equ  FSMC_PCR2_TAR_3                     ,0x00010000         @<Bit 3 */

.equ  FSMC_PCR2_ECCPS                     ,0x000E0000         @<ECCPS[1:0] bits (ECC page size) */
.equ  FSMC_PCR2_ECCPS_0                   ,0x00020000         @<Bit 0 */
.equ  FSMC_PCR2_ECCPS_1                   ,0x00040000         @<Bit 1 */
.equ  FSMC_PCR2_ECCPS_2                   ,0x00080000         @<Bit 2 */

@*****************  Bit definition for FSMC_PCR3 register  *******************/
.equ  FSMC_PCR3_PWAITEN                   ,0x00000002         @<Wait feature enable bit */
.equ  FSMC_PCR3_PBKEN                     ,0x00000004         @<PC Card/NAND Flash memory bank enable bit */
.equ  FSMC_PCR3_PTYP                      ,0x00000008         @<Memory type */

