ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
.equ  FSMC_PCR3_PWID                      ,0x00000030         @<PWID[1:0] bits (NAND Flash databus width) */
.equ  FSMC_PCR3_PWID_0                    ,0x00000010         @<Bit 0 */
.equ  FSMC_PCR3_PWID_1                    ,0x00000020         @<Bit 1 */

.equ  FSMC_PCR3_ECCEN                     ,0x00000040         @<ECC computation logic enable bit */

.equ  FSMC_PCR3_TCLR                      ,0x00001E00         @<TCLR[3:0] bits (CLE to RE delay) */
.equ  FSMC_PCR3_TCLR_0                    ,0x00000200         @<Bit 0 */
.equ  FSMC_PCR3_TCLR_1                    ,0x00000400         @<Bit 1 */
.equ  FSMC_PCR3_TCLR_2                    ,0x00000800         @<Bit 2 */
.equ  FSMC_PCR3_TCLR_3                    ,0x00001000         @<Bit 3 */

.equ  FSMC_PCR3_TAR                       ,0x0001E000         @<TAR[3:0] bits (ALE to RE delay) */
.equ  FSMC_PCR3_TAR_0                     ,0x00002000         @<Bit 0 */
.equ  FSMC_PCR3_TAR_1                     ,0x00004000         @<Bit 1 */
.equ  FSMC_PCR3_TAR_2                     ,0x00008000         @<Bit 2 */
.equ  FSMC_PCR3_TAR_3                     ,0x00010000         @<Bit 3 */

.equ  FSMC_PCR3_ECCPS                     ,0x000E0000         @<ECCPS[2:0] bits (ECC page size) */
.equ  FSMC_PCR3_ECCPS_0                   ,0x00020000         @<Bit 0 */
.equ  FSMC_PCR3_ECCPS_1                   ,0x00040000         @<Bit 1 */
.equ  FSMC_PCR3_ECCPS_2                   ,0x00080000         @<Bit 2 */

@*****************  Bit definition for FSMC_PCR4 register  *******************/
.equ  FSMC_PCR4_PWAITEN                   ,0x00000002         @<Wait feature enable bit */
.equ  FSMC_PCR4_PBKEN                     ,0x00000004         @<PC Card/NAND Flash memory bank enable bit */
.equ  FSMC_PCR4_PTYP                      ,0x00000008         @<Memory type */

.equ  FSMC_PCR4_PWID                      ,0x00000030         @<PWID[1:0] bits (NAND Flash databus width) */
.equ  FSMC_PCR4_PWID_0                    ,0x00000010         @<Bit 0 */
.equ  FSMC_PCR4_PWID_1                    ,0x00000020         @<Bit 1 */

.equ  FSMC_PCR4_ECCEN                     ,0x00000040         @<ECC computation logic enable bit */

.equ  FSMC_PCR4_TCLR                      ,0x00001E00         @<TCLR[3:0] bits (CLE to RE delay) */
.equ  FSMC_PCR4_TCLR_0                    ,0x00000200         @<Bit 0 */
.equ  FSMC_PCR4_TCLR_1                    ,0x00000400         @<Bit 1 */
.equ  FSMC_PCR4_TCLR_2                    ,0x00000800         @<Bit 2 */
.equ  FSMC_PCR4_TCLR_3                    ,0x00001000         @<Bit 3 */

.equ  FSMC_PCR4_TAR                       ,0x0001E000         @<TAR[3:0] bits (ALE to RE delay) */
.equ  FSMC_PCR4_TAR_0                     ,0x00002000         @<Bit 0 */
.equ  FSMC_PCR4_TAR_1                     ,0x00004000         @<Bit 1 */
.equ  FSMC_PCR4_TAR_2                     ,0x00008000         @<Bit 2 */
.equ  FSMC_PCR4_TAR_3                     ,0x00010000         @<Bit 3 */

.equ  FSMC_PCR4_ECCPS                     ,0x000E0000         @<ECCPS[2:0] bits (ECC page size) */
.equ  FSMC_PCR4_ECCPS_0                   ,0x00020000         @<Bit 0 */
.equ  FSMC_PCR4_ECCPS_1                   ,0x00040000         @<Bit 1 */
.equ  FSMC_PCR4_ECCPS_2                   ,0x00080000         @<Bit 2 */

@******************  Bit definition for FSMC_SR2 register  *******************/
.equ  FSMC_SR2_IRS                        ,0x01               @<Interrupt Rising Edge status */
.equ  FSMC_SR2_ILS                        ,0x02               @<Interrupt Level status */
.equ  FSMC_SR2_IFS                        ,0x04               @<Interrupt Falling Edge status */
.equ  FSMC_SR2_IREN                       ,0x08               @<Interrupt Rising Edge detection Enable bit */
.equ  FSMC_SR2_ILEN                       ,0x10               @<Interrupt Level detection Enable bit */
.equ  FSMC_SR2_IFEN                       ,0x20               @<Interrupt Falling Edge detection Enable bit */
.equ  FSMC_SR2_FEMPT                      ,0x40               @<FIFO empty */

@******************  Bit definition for FSMC_SR3 register  *******************/
.equ  FSMC_SR3_IRS                        ,0x01               @<Interrupt Rising Edge status */
.equ  FSMC_SR3_ILS                        ,0x02               @<Interrupt Level status */
.equ  FSMC_SR3_IFS                        ,0x04               @<Interrupt Falling Edge status */
.equ  FSMC_SR3_IREN                       ,0x08               @<Interrupt Rising Edge detection Enable bit */
.equ  FSMC_SR3_ILEN                       ,0x10               @<Interrupt Level detection Enable bit */
.equ  FSMC_SR3_IFEN                       ,0x20               @<Interrupt Falling Edge detection Enable bit */
.equ  FSMC_SR3_FEMPT                      ,0x40               @<FIFO empty */

@******************  Bit definition for FSMC_SR4 register  *******************/
.equ  FSMC_SR4_IRS                        ,0x01               @<Interrupt Rising Edge status */
.equ  FSMC_SR4_ILS                        ,0x02               @<Interrupt Level status */
.equ  FSMC_SR4_IFS                        ,0x04               @<Interrupt Falling Edge status */
.equ  FSMC_SR4_IREN                       ,0x08               @<Interrupt Rising Edge detection Enable bit */
.equ  FSMC_SR4_ILEN                       ,0x10               @<Interrupt Level detection Enable bit */
.equ  FSMC_SR4_IFEN                       ,0x20               @<Interrupt Falling Edge detection Enable bit */
.equ  FSMC_SR4_FEMPT                      ,0x40               @<FIFO empty */

@*****************  Bit definition for FSMC_PMEM2 register  ******************/
.equ  FSMC_PMEM2_MEMSET2                  ,0x000000FF         @<MEMSET2[7:0] bits (Common memory 2 setup time) */
.equ  FSMC_PMEM2_MEMSET2_0                ,0x00000001         @<Bit 0 */
.equ  FSMC_PMEM2_MEMSET2_1                ,0x00000002         @<Bit 1 */
.equ  FSMC_PMEM2_MEMSET2_2                ,0x00000004         @<Bit 2 */
.equ  FSMC_PMEM2_MEMSET2_3                ,0x00000008         @<Bit 3 */
.equ  FSMC_PMEM2_MEMSET2_4                ,0x00000010         @<Bit 4 */
.equ  FSMC_PMEM2_MEMSET2_5                ,0x00000020         @<Bit 5 */
.equ  FSMC_PMEM2_MEMSET2_6                ,0x00000040         @<Bit 6 */
.equ  FSMC_PMEM2_MEMSET2_7                ,0x00000080         @<Bit 7 */

.equ  FSMC_PMEM2_MEMWAIT2                 ,0x0000FF00         @<MEMWAIT2[7:0] bits (Common memory 2 wait time) */
.equ  FSMC_PMEM2_MEMWAIT2_0               ,0x00000100         @<Bit 0 */
.equ  FSMC_PMEM2_MEMWAIT2_1               ,0x00000200         @<Bit 1 */
.equ  FSMC_PMEM2_MEMWAIT2_2               ,0x00000400         @<Bit 2 */
.equ  FSMC_PMEM2_MEMWAIT2_3               ,0x00000800         @<Bit 3 */
.equ  FSMC_PMEM2_MEMWAIT2_4               ,0x00001000         @<Bit 4 */
.equ  FSMC_PMEM2_MEMWAIT2_5               ,0x00002000         @<Bit 5 */
.equ  FSMC_PMEM2_MEMWAIT2_6               ,0x00004000         @<Bit 6 */
.equ  FSMC_PMEM2_MEMWAIT2_7               ,0x00008000         @<Bit 7 */

