ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
.equ  FSMC_PMEM2_MEMHOLD2                 ,0x00FF0000         @<MEMHOLD2[7:0] bits (Common memory 2 hold time) */
.equ  FSMC_PMEM2_MEMHOLD2_0               ,0x00010000         @<Bit 0 */
.equ  FSMC_PMEM2_MEMHOLD2_1               ,0x00020000         @<Bit 1 */
.equ  FSMC_PMEM2_MEMHOLD2_2               ,0x00040000         @<Bit 2 */
.equ  FSMC_PMEM2_MEMHOLD2_3               ,0x00080000         @<Bit 3 */
.equ  FSMC_PMEM2_MEMHOLD2_4               ,0x00100000         @<Bit 4 */
.equ  FSMC_PMEM2_MEMHOLD2_5               ,0x00200000         @<Bit 5 */
.equ  FSMC_PMEM2_MEMHOLD2_6               ,0x00400000         @<Bit 6 */
.equ  FSMC_PMEM2_MEMHOLD2_7               ,0x00800000         @<Bit 7 */

.equ  FSMC_PMEM2_MEMHIZ2                  ,0xFF000000         @<MEMHIZ2[7:0] bits (Common memory 2 databus HiZ time) */
.equ  FSMC_PMEM2_MEMHIZ2_0                ,0x01000000         @<Bit 0 */
.equ  FSMC_PMEM2_MEMHIZ2_1                ,0x02000000         @<Bit 1 */
.equ  FSMC_PMEM2_MEMHIZ2_2                ,0x04000000         @<Bit 2 */
.equ  FSMC_PMEM2_MEMHIZ2_3                ,0x08000000         @<Bit 3 */
.equ  FSMC_PMEM2_MEMHIZ2_4                ,0x10000000         @<Bit 4 */
.equ  FSMC_PMEM2_MEMHIZ2_5                ,0x20000000         @<Bit 5 */
.equ  FSMC_PMEM2_MEMHIZ2_6                ,0x40000000         @<Bit 6 */
.equ  FSMC_PMEM2_MEMHIZ2_7                ,0x80000000         @<Bit 7 */

@*****************  Bit definition for FSMC_PMEM3 register  ******************/
.equ  FSMC_PMEM3_MEMSET3                  ,0x000000FF         @<MEMSET3[7:0] bits (Common memory 3 setup time) */
.equ  FSMC_PMEM3_MEMSET3_0                ,0x00000001         @<Bit 0 */
.equ  FSMC_PMEM3_MEMSET3_1                ,0x00000002         @<Bit 1 */
.equ  FSMC_PMEM3_MEMSET3_2                ,0x00000004         @<Bit 2 */
.equ  FSMC_PMEM3_MEMSET3_3                ,0x00000008         @<Bit 3 */
.equ  FSMC_PMEM3_MEMSET3_4                ,0x00000010         @<Bit 4 */
.equ  FSMC_PMEM3_MEMSET3_5                ,0x00000020         @<Bit 5 */
.equ  FSMC_PMEM3_MEMSET3_6                ,0x00000040         @<Bit 6 */
.equ  FSMC_PMEM3_MEMSET3_7                ,0x00000080         @<Bit 7 */

.equ  FSMC_PMEM3_MEMWAIT3                 ,0x0000FF00         @<MEMWAIT3[7:0] bits (Common memory 3 wait time) */
.equ  FSMC_PMEM3_MEMWAIT3_0               ,0x00000100         @<Bit 0 */
.equ  FSMC_PMEM3_MEMWAIT3_1               ,0x00000200         @<Bit 1 */
.equ  FSMC_PMEM3_MEMWAIT3_2               ,0x00000400         @<Bit 2 */
.equ  FSMC_PMEM3_MEMWAIT3_3               ,0x00000800         @<Bit 3 */
.equ  FSMC_PMEM3_MEMWAIT3_4               ,0x00001000         @<Bit 4 */
.equ  FSMC_PMEM3_MEMWAIT3_5               ,0x00002000         @<Bit 5 */
.equ  FSMC_PMEM3_MEMWAIT3_6               ,0x00004000         @<Bit 6 */
.equ  FSMC_PMEM3_MEMWAIT3_7               ,0x00008000         @<Bit 7 */

.equ  FSMC_PMEM3_MEMHOLD3                 ,0x00FF0000         @<MEMHOLD3[7:0] bits (Common memory 3 hold time) */
.equ  FSMC_PMEM3_MEMHOLD3_0               ,0x00010000         @<Bit 0 */
.equ  FSMC_PMEM3_MEMHOLD3_1               ,0x00020000         @<Bit 1 */
.equ  FSMC_PMEM3_MEMHOLD3_2               ,0x00040000         @<Bit 2 */
.equ  FSMC_PMEM3_MEMHOLD3_3               ,0x00080000         @<Bit 3 */
.equ  FSMC_PMEM3_MEMHOLD3_4               ,0x00100000         @<Bit 4 */
.equ  FSMC_PMEM3_MEMHOLD3_5               ,0x00200000         @<Bit 5 */
.equ  FSMC_PMEM3_MEMHOLD3_6               ,0x00400000         @<Bit 6 */
.equ  FSMC_PMEM3_MEMHOLD3_7               ,0x00800000         @<Bit 7 */

.equ  FSMC_PMEM3_MEMHIZ3                  ,0xFF000000         @<MEMHIZ3[7:0] bits (Common memory 3 databus HiZ time) */
.equ  FSMC_PMEM3_MEMHIZ3_0                ,0x01000000         @<Bit 0 */
.equ  FSMC_PMEM3_MEMHIZ3_1                ,0x02000000         @<Bit 1 */
.equ  FSMC_PMEM3_MEMHIZ3_2                ,0x04000000         @<Bit 2 */
.equ  FSMC_PMEM3_MEMHIZ3_3                ,0x08000000         @<Bit 3 */
.equ  FSMC_PMEM3_MEMHIZ3_4                ,0x10000000         @<Bit 4 */
.equ  FSMC_PMEM3_MEMHIZ3_5                ,0x20000000         @<Bit 5 */
.equ  FSMC_PMEM3_MEMHIZ3_6                ,0x40000000         @<Bit 6 */
.equ  FSMC_PMEM3_MEMHIZ3_7                ,0x80000000         @<Bit 7 */

@*****************  Bit definition for FSMC_PMEM4 register  ******************/
.equ  FSMC_PMEM4_MEMSET4                  ,0x000000FF         @<MEMSET4[7:0] bits (Common memory 4 setup time) */
.equ  FSMC_PMEM4_MEMSET4_0                ,0x00000001         @<Bit 0 */
.equ  FSMC_PMEM4_MEMSET4_1                ,0x00000002         @<Bit 1 */
.equ  FSMC_PMEM4_MEMSET4_2                ,0x00000004         @<Bit 2 */
.equ  FSMC_PMEM4_MEMSET4_3                ,0x00000008         @<Bit 3 */
.equ  FSMC_PMEM4_MEMSET4_4                ,0x00000010         @<Bit 4 */
.equ  FSMC_PMEM4_MEMSET4_5                ,0x00000020         @<Bit 5 */
.equ  FSMC_PMEM4_MEMSET4_6                ,0x00000040         @<Bit 6 */
.equ  FSMC_PMEM4_MEMSET4_7                ,0x00000080         @<Bit 7 */

.equ  FSMC_PMEM4_MEMWAIT4                 ,0x0000FF00         @<MEMWAIT4[7:0] bits (Common memory 4 wait time) */
.equ  FSMC_PMEM4_MEMWAIT4_0               ,0x00000100         @<Bit 0 */
.equ  FSMC_PMEM4_MEMWAIT4_1               ,0x00000200         @<Bit 1 */
.equ  FSMC_PMEM4_MEMWAIT4_2               ,0x00000400         @<Bit 2 */
.equ  FSMC_PMEM4_MEMWAIT4_3               ,0x00000800         @<Bit 3 */
.equ  FSMC_PMEM4_MEMWAIT4_4               ,0x00001000         @<Bit 4 */
.equ  FSMC_PMEM4_MEMWAIT4_5               ,0x00002000         @<Bit 5 */
.equ  FSMC_PMEM4_MEMWAIT4_6               ,0x00004000         @<Bit 6 */
.equ  FSMC_PMEM4_MEMWAIT4_7               ,0x00008000         @<Bit 7 */

.equ  FSMC_PMEM4_MEMHOLD4                 ,0x00FF0000         @<MEMHOLD4[7:0] bits (Common memory 4 hold time) */
.equ  FSMC_PMEM4_MEMHOLD4_0               ,0x00010000         @<Bit 0 */
.equ  FSMC_PMEM4_MEMHOLD4_1               ,0x00020000         @<Bit 1 */
.equ  FSMC_PMEM4_MEMHOLD4_2               ,0x00040000         @<Bit 2 */
.equ  FSMC_PMEM4_MEMHOLD4_3               ,0x00080000         @<Bit 3 */
.equ  FSMC_PMEM4_MEMHOLD4_4               ,0x00100000         @<Bit 4 */
.equ  FSMC_PMEM4_MEMHOLD4_5               ,0x00200000         @<Bit 5 */
.equ  FSMC_PMEM4_MEMHOLD4_6               ,0x00400000         @<Bit 6 */
.equ  FSMC_PMEM4_MEMHOLD4_7               ,0x00800000         @<Bit 7 */

.equ  FSMC_PMEM4_MEMHIZ4                  ,0xFF000000         @<MEMHIZ4[7:0] bits (Common memory 4 databus HiZ time) */
.equ  FSMC_PMEM4_MEMHIZ4_0                ,0x01000000         @<Bit 0 */
.equ  FSMC_PMEM4_MEMHIZ4_1                ,0x02000000         @<Bit 1 */
.equ  FSMC_PMEM4_MEMHIZ4_2                ,0x04000000         @<Bit 2 */
.equ  FSMC_PMEM4_MEMHIZ4_3                ,0x08000000         @<Bit 3 */
.equ  FSMC_PMEM4_MEMHIZ4_4                ,0x10000000         @<Bit 4 */
.equ  FSMC_PMEM4_MEMHIZ4_5                ,0x20000000         @<Bit 5 */
.equ  FSMC_PMEM4_MEMHIZ4_6                ,0x40000000         @<Bit 6 */
.equ  FSMC_PMEM4_MEMHIZ4_7                ,0x80000000         @<Bit 7 */

@*****************  Bit definition for FSMC_PATT2 register  ******************/
.equ  FSMC_PATT2_ATTSET2                  ,0x000000FF         @<ATTSET2[7:0] bits (Attribute memory 2 setup time) */
.equ  FSMC_PATT2_ATTSET2_0                ,0x00000001         @<Bit 0 */
.equ  FSMC_PATT2_ATTSET2_1                ,0x00000002         @<Bit 1 */
.equ  FSMC_PATT2_ATTSET2_2                ,0x00000004         @<Bit 2 */
.equ  FSMC_PATT2_ATTSET2_3                ,0x00000008         @<Bit 3 */
.equ  FSMC_PATT2_ATTSET2_4                ,0x00000010         @<Bit 4 */
.equ  FSMC_PATT2_ATTSET2_5                ,0x00000020         @<Bit 5 */
.equ  FSMC_PATT2_ATTSET2_6                ,0x00000040         @<Bit 6 */
.equ  FSMC_PATT2_ATTSET2_7                ,0x00000080         @<Bit 7 */

