ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
.equ  FSMC_PIO4_IOHOLD4                   ,0x00FF0000         @<IOHOLD4[7:0] bits (I/O 4 hold time) */
.equ  FSMC_PIO4_IOHOLD4_0                 ,0x00010000         @<Bit 0 */
.equ  FSMC_PIO4_IOHOLD4_1                 ,0x00020000         @<Bit 1 */
.equ  FSMC_PIO4_IOHOLD4_2                 ,0x00040000         @<Bit 2 */
.equ  FSMC_PIO4_IOHOLD4_3                 ,0x00080000         @<Bit 3 */
.equ  FSMC_PIO4_IOHOLD4_4                 ,0x00100000         @<Bit 4 */
.equ  FSMC_PIO4_IOHOLD4_5                 ,0x00200000         @<Bit 5 */
.equ  FSMC_PIO4_IOHOLD4_6                 ,0x00400000         @<Bit 6 */
.equ  FSMC_PIO4_IOHOLD4_7                 ,0x00800000         @<Bit 7 */

.equ  FSMC_PIO4_IOHIZ4                    ,0xFF000000         @<IOHIZ4[7:0] bits (I/O 4 databus HiZ time) */
.equ  FSMC_PIO4_IOHIZ4_0                  ,0x01000000         @<Bit 0 */
.equ  FSMC_PIO4_IOHIZ4_1                  ,0x02000000         @<Bit 1 */
.equ  FSMC_PIO4_IOHIZ4_2                  ,0x04000000         @<Bit 2 */
.equ  FSMC_PIO4_IOHIZ4_3                  ,0x08000000         @<Bit 3 */
.equ  FSMC_PIO4_IOHIZ4_4                  ,0x10000000         @<Bit 4 */
.equ  FSMC_PIO4_IOHIZ4_5                  ,0x20000000         @<Bit 5 */
.equ  FSMC_PIO4_IOHIZ4_6                  ,0x40000000         @<Bit 6 */
.equ  FSMC_PIO4_IOHIZ4_7                  ,0x80000000         @<Bit 7 */

@*****************  Bit definition for FSMC_ECCR2 register  ******************/
.equ  FSMC_ECCR2_ECC2                     ,0xFFFFFFFF         @<ECC result */

@*****************  Bit definition for FSMC_ECCR3 register  ******************/
.equ  FSMC_ECCR3_ECC3                     ,0xFFFFFFFF         @<ECC result */

@******************************************************************************/
@*                                                                            */
@*                            General Purpose I/O                             */
@*                                                                            */
@******************************************************************************/
.equ GPIO_MODER				  ,0x00
@*****************  Bits definition for GPIO_MODER register  *****************/
.equ GPIO_MODER_MODER0                    ,0x00000003
.equ GPIO_MODER_MODER0_0                  ,0x00000001
.equ GPIO_MODER_MODER0_1                  ,0x00000002

.equ GPIO_MODER_MODER1                    ,0x0000000C
.equ GPIO_MODER_MODER1_0                  ,0x00000004
.equ GPIO_MODER_MODER1_1                  ,0x00000008

.equ GPIO_MODER_MODER2                    ,0x00000030
.equ GPIO_MODER_MODER2_0                  ,0x00000010
.equ GPIO_MODER_MODER2_1                  ,0x00000020

.equ GPIO_MODER_MODER3                    ,0x000000C0
.equ GPIO_MODER_MODER3_0                  ,0x00000040
.equ GPIO_MODER_MODER3_1                  ,0x00000080

.equ GPIO_MODER_MODER4                    ,0x00000300
.equ GPIO_MODER_MODER4_0                  ,0x00000100
.equ GPIO_MODER_MODER4_1                  ,0x00000200

.equ GPIO_MODER_MODER5                    ,0x00000C00
.equ GPIO_MODER_MODER5_0                  ,0x00000400
.equ GPIO_MODER_MODER5_1                  ,0x00000800

.equ GPIO_MODER_MODER6                    ,0x00003000
.equ GPIO_MODER_MODER6_0                  ,0x00001000
.equ GPIO_MODER_MODER6_1                  ,0x00002000

.equ GPIO_MODER_MODER7                    ,0x0000C000
.equ GPIO_MODER_MODER7_0                  ,0x00004000
.equ GPIO_MODER_MODER7_1                  ,0x00008000

.equ GPIO_MODER_MODER8                    ,0x00030000
.equ GPIO_MODER_MODER8_0                  ,0x00010000
.equ GPIO_MODER_MODER8_1                  ,0x00020000

.equ GPIO_MODER_MODER9                    ,0x000C0000
.equ GPIO_MODER_MODER9_0                  ,0x00040000
.equ GPIO_MODER_MODER9_1                  ,0x00080000

.equ GPIO_MODER_MODER10                   ,0x00300000
.equ GPIO_MODER_MODER10_0                 ,0x00100000
.equ GPIO_MODER_MODER10_1                 ,0x00200000

.equ GPIO_MODER_MODER11                   ,0x00C00000
.equ GPIO_MODER_MODER11_0                 ,0x00400000
.equ GPIO_MODER_MODER11_1                 ,0x00800000

.equ GPIO_MODER_MODER12                   ,0x03000000
.equ GPIO_MODER_MODER12_0                 ,0x01000000
.equ GPIO_MODER_MODER12_1                 ,0x02000000

.equ GPIO_MODER_MODER13                   ,0x0C000000
.equ GPIO_MODER_MODER13_0                 ,0x04000000
.equ GPIO_MODER_MODER13_1                 ,0x08000000

.equ GPIO_MODER_MODER14                   ,0x30000000
.equ GPIO_MODER_MODER14_0                 ,0x10000000
.equ GPIO_MODER_MODER14_1                 ,0x20000000

.equ GPIO_MODER_MODER15                   ,0xC0000000
.equ GPIO_MODER_MODER15_0                 ,0x40000000
.equ GPIO_MODER_MODER15_1                 ,0x80000000

.equ GPIO_OTYPER			  ,0x04
@*****************  Bits definition for GPIO_OTYPER register  ****************/
.equ GPIO_OTYPER_OT_0                     ,0x00000001
.equ GPIO_OTYPER_OT_1                     ,0x00000002
.equ GPIO_OTYPER_OT_2                     ,0x00000004
.equ GPIO_OTYPER_OT_3                     ,0x00000008
.equ GPIO_OTYPER_OT_4                     ,0x00000010
.equ GPIO_OTYPER_OT_5                     ,0x00000020
.equ GPIO_OTYPER_OT_6                     ,0x00000040
.equ GPIO_OTYPER_OT_7                     ,0x00000080
.equ GPIO_OTYPER_OT_8                     ,0x00000100
.equ GPIO_OTYPER_OT_9                     ,0x00000200
.equ GPIO_OTYPER_OT_10                    ,0x00000400
.equ GPIO_OTYPER_OT_11                    ,0x00000800
.equ GPIO_OTYPER_OT_12                    ,0x00001000
.equ GPIO_OTYPER_OT_13                    ,0x00002000
.equ GPIO_OTYPER_OT_14                    ,0x00004000
.equ GPIO_OTYPER_OT_15                    ,0x00008000

.equ GPIO_OSPEEDR                         ,0x08
@*****************  Bits definition for GPIO_OSPEEDR register  ***************/
.equ GPIO_OSPEEDER_OSPEEDR0               ,0x00000003
.equ GPIO_OSPEEDER_OSPEEDR0_0             ,0x00000001
.equ GPIO_OSPEEDER_OSPEEDR0_1             ,0x00000002

.equ GPIO_OSPEEDER_OSPEEDR1               ,0x0000000C
.equ GPIO_OSPEEDER_OSPEEDR1_0             ,0x00000004
.equ GPIO_OSPEEDER_OSPEEDR1_1             ,0x00000008

