ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
.equ GPIO_OSPEEDER_OSPEEDR2               ,0x00000030
.equ GPIO_OSPEEDER_OSPEEDR2_0             ,0x00000010
.equ GPIO_OSPEEDER_OSPEEDR2_1             ,0x00000020

.equ GPIO_OSPEEDER_OSPEEDR3               ,0x000000C0
.equ GPIO_OSPEEDER_OSPEEDR3_0             ,0x00000040
.equ GPIO_OSPEEDER_OSPEEDR3_1             ,0x00000080

.equ GPIO_OSPEEDER_OSPEEDR4               ,0x00000300
.equ GPIO_OSPEEDER_OSPEEDR4_0             ,0x00000100
.equ GPIO_OSPEEDER_OSPEEDR4_1             ,0x00000200

.equ GPIO_OSPEEDER_OSPEEDR5               ,0x00000C00
.equ GPIO_OSPEEDER_OSPEEDR5_0             ,0x00000400
.equ GPIO_OSPEEDER_OSPEEDR5_1             ,0x00000800

.equ GPIO_OSPEEDER_OSPEEDR6               ,0x00003000
.equ GPIO_OSPEEDER_OSPEEDR6_0             ,0x00001000
.equ GPIO_OSPEEDER_OSPEEDR6_1             ,0x00002000

.equ GPIO_OSPEEDER_OSPEEDR7               ,0x0000C000
.equ GPIO_OSPEEDER_OSPEEDR7_0             ,0x00004000
.equ GPIO_OSPEEDER_OSPEEDR7_1             ,0x00008000

.equ GPIO_OSPEEDER_OSPEEDR8               ,0x00030000
.equ GPIO_OSPEEDER_OSPEEDR8_0             ,0x00010000
.equ GPIO_OSPEEDER_OSPEEDR8_1             ,0x00020000

.equ GPIO_OSPEEDER_OSPEEDR9               ,0x000C0000
.equ GPIO_OSPEEDER_OSPEEDR9_0             ,0x00040000
.equ GPIO_OSPEEDER_OSPEEDR9_1             ,0x00080000

.equ GPIO_OSPEEDER_OSPEEDR10              ,0x00300000
.equ GPIO_OSPEEDER_OSPEEDR10_0            ,0x00100000
.equ GPIO_OSPEEDER_OSPEEDR10_1            ,0x00200000

.equ GPIO_OSPEEDER_OSPEEDR11              ,0x00C00000
.equ GPIO_OSPEEDER_OSPEEDR11_0            ,0x00400000
.equ GPIO_OSPEEDER_OSPEEDR11_1            ,0x00800000

.equ GPIO_OSPEEDER_OSPEEDR12              ,0x03000000
.equ GPIO_OSPEEDER_OSPEEDR12_0            ,0x01000000
.equ GPIO_OSPEEDER_OSPEEDR12_1            ,0x02000000

.equ GPIO_OSPEEDER_OSPEEDR13              ,0x0C000000
.equ GPIO_OSPEEDER_OSPEEDR13_0            ,0x04000000
.equ GPIO_OSPEEDER_OSPEEDR13_1            ,0x08000000

.equ GPIO_OSPEEDER_OSPEEDR14              ,0x30000000
.equ GPIO_OSPEEDER_OSPEEDR14_0            ,0x10000000
.equ GPIO_OSPEEDER_OSPEEDR14_1            ,0x20000000

.equ GPIO_OSPEEDER_OSPEEDR15              ,0xC0000000
.equ GPIO_OSPEEDER_OSPEEDR15_0            ,0x40000000
.equ GPIO_OSPEEDER_OSPEEDR15_1            ,0x80000000

.equ GPIO_PUPDR                           ,0x0C
@*****************  Bits definition for GPIO_PUPDR register  *****************/
.equ GPIO_PUPDR_PUPDR0                    ,0x00000003
.equ GPIO_PUPDR_PUPDR0_0                  ,0x00000001
.equ GPIO_PUPDR_PUPDR0_1                  ,0x00000002

.equ GPIO_PUPDR_PUPDR1                    ,0x0000000C
.equ GPIO_PUPDR_PUPDR1_0                  ,0x00000004
.equ GPIO_PUPDR_PUPDR1_1                  ,0x00000008

.equ GPIO_PUPDR_PUPDR2                    ,0x00000030
.equ GPIO_PUPDR_PUPDR2_0                  ,0x00000010
.equ GPIO_PUPDR_PUPDR2_1                  ,0x00000020

.equ GPIO_PUPDR_PUPDR3                    ,0x000000C0
.equ GPIO_PUPDR_PUPDR3_0                  ,0x00000040
.equ GPIO_PUPDR_PUPDR3_1                  ,0x00000080

.equ GPIO_PUPDR_PUPDR4                    ,0x00000300
.equ GPIO_PUPDR_PUPDR4_0                  ,0x00000100
.equ GPIO_PUPDR_PUPDR4_1                  ,0x00000200

.equ GPIO_PUPDR_PUPDR5                    ,0x00000C00
.equ GPIO_PUPDR_PUPDR5_0                  ,0x00000400
.equ GPIO_PUPDR_PUPDR5_1                  ,0x00000800

.equ GPIO_PUPDR_PUPDR6                    ,0x00003000
.equ GPIO_PUPDR_PUPDR6_0                  ,0x00001000
.equ GPIO_PUPDR_PUPDR6_1                  ,0x00002000

.equ GPIO_PUPDR_PUPDR7                    ,0x0000C000
.equ GPIO_PUPDR_PUPDR7_0                  ,0x00004000
.equ GPIO_PUPDR_PUPDR7_1                  ,0x00008000

.equ GPIO_PUPDR_PUPDR8                    ,0x00030000
.equ GPIO_PUPDR_PUPDR8_0                  ,0x00010000
.equ GPIO_PUPDR_PUPDR8_1                  ,0x00020000

.equ GPIO_PUPDR_PUPDR9                    ,0x000C0000
.equ GPIO_PUPDR_PUPDR9_0                  ,0x00040000
.equ GPIO_PUPDR_PUPDR9_1                  ,0x00080000

.equ GPIO_PUPDR_PUPDR10                   ,0x00300000
.equ GPIO_PUPDR_PUPDR10_0                 ,0x00100000
.equ GPIO_PUPDR_PUPDR10_1                 ,0x00200000

.equ GPIO_PUPDR_PUPDR11                   ,0x00C00000
.equ GPIO_PUPDR_PUPDR11_0                 ,0x00400000
.equ GPIO_PUPDR_PUPDR11_1                 ,0x00800000

.equ GPIO_PUPDR_PUPDR12                   ,0x03000000
.equ GPIO_PUPDR_PUPDR12_0                 ,0x01000000
.equ GPIO_PUPDR_PUPDR12_1                 ,0x02000000

.equ GPIO_PUPDR_PUPDR13                   ,0x0C000000
.equ GPIO_PUPDR_PUPDR13_0                 ,0x04000000
.equ GPIO_PUPDR_PUPDR13_1                 ,0x08000000

.equ GPIO_PUPDR_PUPDR14                   ,0x30000000
.equ GPIO_PUPDR_PUPDR14_0                 ,0x10000000
.equ GPIO_PUPDR_PUPDR14_1                 ,0x20000000

.equ GPIO_PUPDR_PUPDR15                   ,0xC0000000
.equ GPIO_PUPDR_PUPDR15_0                 ,0x40000000
.equ GPIO_PUPDR_PUPDR15_1                 ,0x80000000

.equ GPIO_IDR			          ,0x10
@*****************  Bits definition for GPIO_IDR register  *******************/
.equ GPIO_IDR_IDR_0                       ,0x00000001
.equ GPIO_IDR_IDR_1                       ,0x00000002
.equ GPIO_IDR_IDR_2                       ,0x00000004
.equ GPIO_IDR_IDR_3                       ,0x00000008
.equ GPIO_IDR_IDR_4                       ,0x00000010
.equ GPIO_IDR_IDR_5                       ,0x00000020
.equ GPIO_IDR_IDR_6                       ,0x00000040
.equ GPIO_IDR_IDR_7                       ,0x00000080
.equ GPIO_IDR_IDR_8                       ,0x00000100
.equ GPIO_IDR_IDR_9                       ,0x00000200
.equ GPIO_IDR_IDR_10                      ,0x00000400
.equ GPIO_IDR_IDR_11                      ,0x00000800
.equ GPIO_IDR_IDR_12                      ,0x00001000
.equ GPIO_IDR_IDR_13                      ,0x00002000
.equ GPIO_IDR_IDR_14                      ,0x00004000
.equ GPIO_IDR_IDR_15                      ,0x00008000
@ Old GPIO_IDR register bits definition, maintained for legacy purpose */
.equ GPIO_OTYPER_IDR_0                    ,GPIO_IDR_IDR_0
.equ GPIO_OTYPER_IDR_1                    ,GPIO_IDR_IDR_1
.equ GPIO_OTYPER_IDR_2                    ,GPIO_IDR_IDR_2
.equ GPIO_OTYPER_IDR_3                    ,GPIO_IDR_IDR_3
.equ GPIO_OTYPER_IDR_4                    ,GPIO_IDR_IDR_4
.equ GPIO_OTYPER_IDR_5                    ,GPIO_IDR_IDR_5
.equ GPIO_OTYPER_IDR_6                    ,GPIO_IDR_IDR_6
.equ GPIO_OTYPER_IDR_7                    ,GPIO_IDR_IDR_7
.equ GPIO_OTYPER_IDR_8                    ,GPIO_IDR_IDR_8
.equ GPIO_OTYPER_IDR_9                    ,GPIO_IDR_IDR_9
.equ GPIO_OTYPER_IDR_10                   ,GPIO_IDR_IDR_10
.equ GPIO_OTYPER_IDR_11                   ,GPIO_IDR_IDR_11
.equ GPIO_OTYPER_IDR_12                   ,GPIO_IDR_IDR_12
.equ GPIO_OTYPER_IDR_13                   ,GPIO_IDR_IDR_13
.equ GPIO_OTYPER_IDR_14                   ,GPIO_IDR_IDR_14
.equ GPIO_OTYPER_IDR_15                   ,GPIO_IDR_IDR_15

