ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
.equ GPIO_ODR                             ,0x14                            
@*****************  Bits definition for GPIO_ODR register  *******************/
.equ GPIO_ODR_ODR_0                       ,0x00000001
.equ GPIO_ODR_ODR_1                       ,0x00000002
.equ GPIO_ODR_ODR_2                       ,0x00000004
.equ GPIO_ODR_ODR_3                       ,0x00000008
.equ GPIO_ODR_ODR_4                       ,0x00000010
.equ GPIO_ODR_ODR_5                       ,0x00000020
.equ GPIO_ODR_ODR_6                       ,0x00000040
.equ GPIO_ODR_ODR_7                       ,0x00000080
.equ GPIO_ODR_ODR_8                       ,0x00000100
.equ GPIO_ODR_ODR_9                       ,0x00000200
.equ GPIO_ODR_ODR_10                      ,0x00000400
.equ GPIO_ODR_ODR_11                      ,0x00000800
.equ GPIO_ODR_ODR_12                      ,0x00001000
.equ GPIO_ODR_ODR_13                      ,0x00002000
.equ GPIO_ODR_ODR_14                      ,0x00004000
.equ GPIO_ODR_ODR_15                      ,0x00008000
@ Old GPIO_ODR register bits definition, maintained for legacy purpose */
.equ GPIO_OTYPER_ODR_0                    ,GPIO_ODR_ODR_0
.equ GPIO_OTYPER_ODR_1                    ,GPIO_ODR_ODR_1
.equ GPIO_OTYPER_ODR_2                    ,GPIO_ODR_ODR_2
.equ GPIO_OTYPER_ODR_3                    ,GPIO_ODR_ODR_3
.equ GPIO_OTYPER_ODR_4                    ,GPIO_ODR_ODR_4
.equ GPIO_OTYPER_ODR_5                    ,GPIO_ODR_ODR_5
.equ GPIO_OTYPER_ODR_6                    ,GPIO_ODR_ODR_6
.equ GPIO_OTYPER_ODR_7                    ,GPIO_ODR_ODR_7
.equ GPIO_OTYPER_ODR_8                    ,GPIO_ODR_ODR_8
.equ GPIO_OTYPER_ODR_9                    ,GPIO_ODR_ODR_9
.equ GPIO_OTYPER_ODR_10                   ,GPIO_ODR_ODR_10
.equ GPIO_OTYPER_ODR_11                   ,GPIO_ODR_ODR_11
.equ GPIO_OTYPER_ODR_12                   ,GPIO_ODR_ODR_12
.equ GPIO_OTYPER_ODR_13                   ,GPIO_ODR_ODR_13
.equ GPIO_OTYPER_ODR_14                   ,GPIO_ODR_ODR_14
.equ GPIO_OTYPER_ODR_15                   ,GPIO_ODR_ODR_15

.equ GPIO_BSRR                            ,0x18
@*****************  Bits definition for GPIO_BSRR register  ******************/
.equ GPIO_BSRR_BS_0                       ,0x00000001
.equ GPIO_BSRR_BS_1                       ,0x00000002
.equ GPIO_BSRR_BS_2                       ,0x00000004
.equ GPIO_BSRR_BS_3                       ,0x00000008
.equ GPIO_BSRR_BS_4                       ,0x00000010
.equ GPIO_BSRR_BS_5                       ,0x00000020
.equ GPIO_BSRR_BS_6                       ,0x00000040
.equ GPIO_BSRR_BS_7                       ,0x00000080
.equ GPIO_BSRR_BS_8                       ,0x00000100
.equ GPIO_BSRR_BS_9                       ,0x00000200
.equ GPIO_BSRR_BS_10                      ,0x00000400
.equ GPIO_BSRR_BS_11                      ,0x00000800
.equ GPIO_BSRR_BS_12                      ,0x00001000
.equ GPIO_BSRR_BS_13                      ,0x00002000
.equ GPIO_BSRR_BS_14                      ,0x00004000
.equ GPIO_BSRR_BS_15                      ,0x00008000
.equ GPIO_BSRR_BR_0                       ,0x00010000
.equ GPIO_BSRR_BR_1                       ,0x00020000
.equ GPIO_BSRR_BR_2                       ,0x00040000
.equ GPIO_BSRR_BR_3                       ,0x00080000
.equ GPIO_BSRR_BR_4                       ,0x00100000
.equ GPIO_BSRR_BR_5                       ,0x00200000
.equ GPIO_BSRR_BR_6                       ,0x00400000
.equ GPIO_BSRR_BR_7                       ,0x00800000
.equ GPIO_BSRR_BR_8                       ,0x01000000
.equ GPIO_BSRR_BR_9                       ,0x02000000
.equ GPIO_BSRR_BR_10                      ,0x04000000
.equ GPIO_BSRR_BR_11                      ,0x08000000
.equ GPIO_BSRR_BR_12                      ,0x10000000
.equ GPIO_BSRR_BR_13                      ,0x20000000
.equ GPIO_BSRR_BR_14                      ,0x40000000
.equ GPIO_BSRR_BR_15                      ,0x80000000

.equ GPIO_LCKR				  ,0x1C
.equ GPIO_AFRL				  ,0x20
.equ GPIO_AFRH				  ,0x24

@******************************************************************************/
@*                                                                            */
@*                                    HASH                                    */
@*                                                                            */
@******************************************************************************/
@*****************  Bits definition for HASH_CR register  ********************/
.equ HASH_CR_INIT                         ,0x00000004
.equ HASH_CR_DMAE                         ,0x00000008
.equ HASH_CR_DATATYPE                     ,0x00000030
.equ HASH_CR_DATATYPE_0                   ,0x00000010
.equ HASH_CR_DATATYPE_1                   ,0x00000020
.equ HASH_CR_MODE                         ,0x00000040
.equ HASH_CR_ALGO                         ,0x00000080
.equ HASH_CR_NBW                          ,0x00000F00
.equ HASH_CR_NBW_0                        ,0x00000100
.equ HASH_CR_NBW_1                        ,0x00000200
.equ HASH_CR_NBW_2                        ,0x00000400
.equ HASH_CR_NBW_3                        ,0x00000800
.equ HASH_CR_DINNE                        ,0x00001000
.equ HASH_CR_LKEY                         ,0x00010000

@*****************  Bits definition for HASH_STR register  *******************/
.equ HASH_STR_NBW                         ,0x0000001F
.equ HASH_STR_NBW_0                       ,0x00000001
.equ HASH_STR_NBW_1                       ,0x00000002
.equ HASH_STR_NBW_2                       ,0x00000004
.equ HASH_STR_NBW_3                       ,0x00000008
.equ HASH_STR_NBW_4                       ,0x00000010
.equ HASH_STR_DCAL                        ,0x00000100

@*****************  Bits definition for HASH_IMR register  *******************/
.equ HASH_IMR_DINIM                       ,0x00000001
.equ HASH_IMR_DCIM                        ,0x00000002

@*****************  Bits definition for HASH_SR register  ********************/
.equ HASH_SR_DINIS                        ,0x00000001
.equ HASH_SR_DCIS                         ,0x00000002
.equ HASH_SR_DMAS                         ,0x00000004
.equ HASH_SR_BUSY                         ,0x00000008

@******************************************************************************/
@*                                                                            */
@*                      Inter-integrated Circuit Interface                    */
@*                                                                            */
@******************************************************************************/
@******************  Bit definition for I2C_CR1 register  ********************/
.equ  I2C_CR1_PE                          ,0x0001            @<Peripheral Enable */
.equ  I2C_CR1_SMBUS                       ,0x0002            @<SMBus Mode */
.equ  I2C_CR1_SMBTYPE                     ,0x0008            @<SMBus Type */
.equ  I2C_CR1_ENARP                       ,0x0010            @<ARP Enable */
.equ  I2C_CR1_ENPEC                       ,0x0020            @<PEC Enable */
.equ  I2C_CR1_ENGC                        ,0x0040            @<General Call Enable */
.equ  I2C_CR1_NOSTRETCH                   ,0x0080            @<Clock Stretching Disable (Slave mode) */
.equ  I2C_CR1_START                       ,0x0100            @<Start Generation */
.equ  I2C_CR1_STOP                        ,0x0200            @<Stop Generation */
.equ  I2C_CR1_ACK                         ,0x0400            @<Acknowledge Enable */
.equ  I2C_CR1_POS                         ,0x0800            @<Acknowledge/PEC Position (for data reception) */
.equ  I2C_CR1_PEC                         ,0x1000            @<Packet Error Checking */
.equ  I2C_CR1_ALERT                       ,0x2000            @<SMBus Alert */
.equ  I2C_CR1_SWRST                       ,0x8000            @<Software Reset */

@******************  Bit definition for I2C_CR2 register  ********************/
.equ  I2C_CR2_FREQ                        ,0x003F            @<FREQ[5:0] bits (Peripheral Clock Frequency) */
.equ  I2C_CR2_FREQ_0                      ,0x0001            @<Bit 0 */
.equ  I2C_CR2_FREQ_1                      ,0x0002            @<Bit 1 */
.equ  I2C_CR2_FREQ_2                      ,0x0004            @<Bit 2 */
.equ  I2C_CR2_FREQ_3                      ,0x0008            @<Bit 3 */
.equ  I2C_CR2_FREQ_4                      ,0x0010            @<Bit 4 */
.equ  I2C_CR2_FREQ_5                      ,0x0020            @<Bit 5 */

.equ  I2C_CR2_ITERREN                     ,0x0100            @<Error Interrupt Enable */
.equ  I2C_CR2_ITEVTEN                     ,0x0200            @<Event Interrupt Enable */
.equ  I2C_CR2_ITBUFEN                     ,0x0400            @<Buffer Interrupt Enable */
.equ  I2C_CR2_DMAEN                       ,0x0800            @<DMA Requests Enable */
.equ  I2C_CR2_LAST                        ,0x1000            @<DMA Last Transfer */

@******************  Bit definition for I2C_OAR1 register  *******************/
.equ  I2C_OAR1_ADD1_7                     ,0x00FE            @<Interface Address */
.equ  I2C_OAR1_ADD8_9                     ,0x0300            @<Interface Address */

.equ  I2C_OAR1_ADD0                       ,0x0001            @<Bit 0 */
.equ  I2C_OAR1_ADD1                       ,0x0002            @<Bit 1 */
.equ  I2C_OAR1_ADD2                       ,0x0004            @<Bit 2 */
.equ  I2C_OAR1_ADD3                       ,0x0008            @<Bit 3 */
.equ  I2C_OAR1_ADD4                       ,0x0010            @<Bit 4 */
.equ  I2C_OAR1_ADD5                       ,0x0020            @<Bit 5 */
.equ  I2C_OAR1_ADD6                       ,0x0040            @<Bit 6 */
.equ  I2C_OAR1_ADD7                       ,0x0080            @<Bit 7 */
.equ  I2C_OAR1_ADD8                       ,0x0100            @<Bit 8 */
.equ  I2C_OAR1_ADD9                       ,0x0200            @<Bit 9 */

