ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
.equ  I2C_OAR1_ADDMODE                    ,0x8000            @<Addressing Mode (Slave mode) */

@******************  Bit definition for I2C_OAR2 register  *******************/
.equ  I2C_OAR2_ENDUAL                     ,0x01               @<Dual addressing mode enable */
.equ  I2C_OAR2_ADD2                       ,0xFE               @<Interface address */

@*******************  Bit definition for I2C_DR register  ********************/
.equ  I2C_DR_DR                           ,0xFF               @<8-bit Data Register */

@******************  Bit definition for I2C_SR1 register  ********************/
.equ  I2C_SR1_SB                          ,0x0001            @<Start Bit (Master mode) */
.equ  I2C_SR1_ADDR                        ,0x0002            @<Address sent (master mode)/matched (slave mode) */
.equ  I2C_SR1_BTF                         ,0x0004            @<Byte Transfer Finished */
.equ  I2C_SR1_ADD10                       ,0x0008            @<10-bit header sent (Master mode) */
.equ  I2C_SR1_STOPF                       ,0x0010            @<Stop detection (Slave mode) */
.equ  I2C_SR1_RXNE                        ,0x0040            @<Data Register not Empty (receivers) */
.equ  I2C_SR1_TXE                         ,0x0080            @<Data Register Empty (transmitters) */
.equ  I2C_SR1_BERR                        ,0x0100            @<Bus Error */
.equ  I2C_SR1_ARLO                        ,0x0200            @<Arbitration Lost (master mode) */
.equ  I2C_SR1_AF                          ,0x0400            @<Acknowledge Failure */
.equ  I2C_SR1_OVR                         ,0x0800            @<Overrun/Underrun */
.equ  I2C_SR1_PECERR                      ,0x1000            @<PEC Error in reception */
.equ  I2C_SR1_TIMEOUT                     ,0x4000            @<Timeout or Tlow Error */
.equ  I2C_SR1_SMBALERT                    ,0x8000            @<SMBus Alert */

@******************  Bit definition for I2C_SR2 register  ********************/
.equ  I2C_SR2_MSL                         ,0x0001            @<Master/Slave */
.equ  I2C_SR2_BUSY                        ,0x0002            @<Bus Busy */
.equ  I2C_SR2_TRA                         ,0x0004            @<Transmitter/Receiver */
.equ  I2C_SR2_GENCALL                     ,0x0010            @<General Call Address (Slave mode) */
.equ  I2C_SR2_SMBDEFAULT                  ,0x0020            @<SMBus Device Default Address (Slave mode) */
.equ  I2C_SR2_SMBHOST                     ,0x0040            @<SMBus Host Header (Slave mode) */
.equ  I2C_SR2_DUALF                       ,0x0080            @<Dual Flag (Slave mode) */
.equ  I2C_SR2_PEC                         ,0xFF00            @<Packet Error Checking Register */

@******************  Bit definition for I2C_CCR register  ********************/
.equ  I2C_CCR_CCR                         ,0x0FFF            @<Clock Control Register in Fast/Standard mode (Master mode) */
.equ  I2C_CCR_DUTY                        ,0x4000            @<Fast Mode Duty Cycle */
.equ  I2C_CCR_FS                          ,0x8000            @<I2C Master Mode Selection */

@*****************  Bit definition for I2C_TRISE register  *******************/
.equ  I2C_TRISE_TRISE                     ,0x3F               @<Maximum Rise Time in Fast/Standard mode (Master mode) */

@******************************************************************************/
@*                                                                            */
@*                           Independent WATCHDOG                             */
@*                                                                            */
@******************************************************************************/
@******************  Bit definition for IWDG_KR register  ********************/
.equ  IWDG_KR_KEY                         ,0xFFFF            @<Key value (write only, read 0000h) */

@******************  Bit definition for IWDG_PR register  ********************/
.equ  IWDG_PR_PR                          ,0x07               @<PR[2:0] (Prescaler divider) */
.equ  IWDG_PR_PR_0                        ,0x01               @<Bit 0 */
.equ  IWDG_PR_PR_1                        ,0x02               @<Bit 1 */
.equ  IWDG_PR_PR_2                        ,0x04               @<Bit 2 */

@******************  Bit definition for IWDG_RLR register  *******************/
.equ  IWDG_RLR_RL                         ,0x0FFF            @<Watchdog counter reload value */

@******************  Bit definition for IWDG_SR register  ********************/
.equ  IWDG_SR_PVU                         ,0x01               @<Watchdog prescaler value update */
.equ  IWDG_SR_RVU                         ,0x02               @<Watchdog counter reload value update */

@******************************************************************************/
@*                                                                            */
@*                             Power Control                                  */
@*                                                                            */
@******************************************************************************/
@*******************  Bit definition for PWR_CR register  ********************/
.equ  PWR_CR_LPDS                         ,0x0001     @< Low-Power Deepsleep */
.equ  PWR_CR_PDDS                         ,0x0002     @< Power Down Deepsleep */
.equ  PWR_CR_CWUF                         ,0x0004     @< Clear Wakeup Flag */
.equ  PWR_CR_CSBF                         ,0x0008     @< Clear Standby Flag */
.equ  PWR_CR_PVDE                         ,0x0010     @< Power Voltage Detector Enable */

.equ  PWR_CR_PLS                          ,0x00E0     @< PLS[2:0] bits (PVD Level Selection) */
.equ  PWR_CR_PLS_0                        ,0x0020     @< Bit 0 */
.equ  PWR_CR_PLS_1                        ,0x0040     @< Bit 1 */
.equ  PWR_CR_PLS_2                        ,0x0080     @< Bit 2 */


@< PVD level configuration */
.equ  PWR_CR_PLS_LEV0                     ,0x0000     @< PVD level 0 */
.equ  PWR_CR_PLS_LEV1                     ,0x0020     @< PVD level 1 */
.equ  PWR_CR_PLS_LEV2                     ,0x0040     @< PVD level 2 */
.equ  PWR_CR_PLS_LEV3                     ,0x0060     @< PVD level 3 */
.equ  PWR_CR_PLS_LEV4                     ,0x0080     @< PVD level 4 */
.equ  PWR_CR_PLS_LEV5                     ,0x00A0     @< PVD level 5 */
.equ  PWR_CR_PLS_LEV6                     ,0x00C0     @< PVD level 6 */
.equ  PWR_CR_PLS_LEV7                     ,0x00E0     @< PVD level 7 */

.equ  PWR_CR_DBP                          ,0x0100     @< Disable Backup Domain write protection */
.equ  PWR_CR_FPDS                         ,0x0200     @< Flash power down in Stop mode */
.equ  PWR_CR_VOS                          ,0x4000     @< Regulator voltage scaling output selection */
@ Legacy define */
.equ  PWR_CR_PMODE                        ,PWR_CR_VOS

@******************  Bit definition for PWR_CSR register  ********************/
.equ  PWR_CSR_WUF                         ,0x0001     @< Wakeup Flag */
.equ  PWR_CSR_SBF                         ,0x0002     @< Standby Flag */
.equ  PWR_CSR_PVDO                        ,0x0004     @< PVD Output */
.equ  PWR_CSR_BRR                         ,0x0008     @< Backup regulator ready */
.equ  PWR_CSR_EWUP                        ,0x0100     @< Enable WKUP pin */
.equ  PWR_CSR_BRE                         ,0x0200     @< Backup regulator enable */
.equ  PWR_CSR_VOSRDY                      ,0x4000     @< Regulator voltage scaling output selection ready */
@ Legacy define */
.equ  PWR_CSR_REGRDY                      ,PWR_CSR_VOSRDY

@******************************************************************************/
@*                                                                            */
@*                         Reset and Clock Control                            */
@*                                                                            */
@******************************************************************************/
.equ  RCC_CR				  ,0x00000000
@*******************  Bit definition for RCC_CR register  ********************/
.equ  RCC_CR_HSION                        ,0x00000001
.equ  RCC_CR_HSIRDY                       ,0x00000002

.equ  RCC_CR_HSITRIM                      ,0x000000F8
.equ  RCC_CR_HSITRIM_0                    ,0x00000008 @<Bit 0 */
.equ  RCC_CR_HSITRIM_1                    ,0x00000010 @<Bit 1 */
.equ  RCC_CR_HSITRIM_2                    ,0x00000020 @<Bit 2 */
.equ  RCC_CR_HSITRIM_3                    ,0x00000040 @<Bit 3 */
.equ  RCC_CR_HSITRIM_4                    ,0x00000080 @<Bit 4 */

.equ  RCC_CR_HSICAL                       ,0x0000FF00
.equ  RCC_CR_HSICAL_0                     ,0x00000100 @<Bit 0 */
.equ  RCC_CR_HSICAL_1                     ,0x00000200 @<Bit 1 */
.equ  RCC_CR_HSICAL_2                     ,0x00000400 @<Bit 2 */
.equ  RCC_CR_HSICAL_3                     ,0x00000800 @<Bit 3 */
.equ  RCC_CR_HSICAL_4                     ,0x00001000 @<Bit 4 */
.equ  RCC_CR_HSICAL_5                     ,0x00002000 @<Bit 5 */
.equ  RCC_CR_HSICAL_6                     ,0x00004000 @<Bit 6 */
.equ  RCC_CR_HSICAL_7                     ,0x00008000 @<Bit 7 */

.equ  RCC_CR_HSEON                        ,0x00010000
.equ  RCC_CR_HSERDY                       ,0x00020000
.equ  RCC_CR_HSEBYP                       ,0x00040000
.equ  RCC_CR_CSSON                        ,0x00080000
.equ  RCC_CR_PLLON                        ,0x01000000
.equ  RCC_CR_PLLRDY                       ,0x02000000
.equ  RCC_CR_PLLI2SON                     ,0x04000000
.equ  RCC_CR_PLLI2SRDY                    ,0x08000000

