ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
.equ  RCC_PLLCFGR			  ,0x04
@*******************  Bit definition for RCC_PLLCFGR register  ***************/
.equ  RCC_PLLCFGR_PLLM                    ,0x0000003F
.equ  RCC_PLLCFGR_PLLM_0                  ,0x00000001
.equ  RCC_PLLCFGR_PLLM_1                  ,0x00000002
.equ  RCC_PLLCFGR_PLLM_2                  ,0x00000004
.equ  RCC_PLLCFGR_PLLM_3                  ,0x00000008
.equ  RCC_PLLCFGR_PLLM_4                  ,0x00000010
.equ  RCC_PLLCFGR_PLLM_5                  ,0x00000020

.equ  RCC_PLLCFGR_PLLN                     ,0x00007FC0
.equ  RCC_PLLCFGR_PLLN_0                   ,0x00000040
.equ  RCC_PLLCFGR_PLLN_1                   ,0x00000080
.equ  RCC_PLLCFGR_PLLN_2                   ,0x00000100
.equ  RCC_PLLCFGR_PLLN_3                   ,0x00000200
.equ  RCC_PLLCFGR_PLLN_4                   ,0x00000400
.equ  RCC_PLLCFGR_PLLN_5                   ,0x00000800
.equ  RCC_PLLCFGR_PLLN_6                   ,0x00001000
.equ  RCC_PLLCFGR_PLLN_7                   ,0x00002000
.equ  RCC_PLLCFGR_PLLN_8                   ,0x00004000

.equ  RCC_PLLCFGR_PLLP                    ,0x00030000
.equ  RCC_PLLCFGR_PLLP_0                  ,0x00010000
.equ  RCC_PLLCFGR_PLLP_1                  ,0x00020000

.equ  RCC_PLLCFGR_PLLSRC                  ,0x00400000
.equ  RCC_PLLCFGR_PLLSRC_HSE              ,0x00400000
.equ  RCC_PLLCFGR_PLLSRC_HSI              ,0x00000000

.equ  RCC_PLLCFGR_PLLQ                    ,0x0F000000
.equ  RCC_PLLCFGR_PLLQ_0                  ,0x01000000
.equ  RCC_PLLCFGR_PLLQ_1                  ,0x02000000
.equ  RCC_PLLCFGR_PLLQ_2                  ,0x04000000
.equ  RCC_PLLCFGR_PLLQ_3                  ,0x08000000

.equ  RCC_CFGR				  ,0x08
@*******************  Bit definition for RCC_CFGR register  ******************/
@< SW configuration */
.equ  RCC_CFGR_SW                         ,0x00000003         @< SW[1:0] bits (System clock Switch) */
.equ  RCC_CFGR_SW_0                       ,0x00000001         @< Bit 0 */
.equ  RCC_CFGR_SW_1                       ,0x00000002         @< Bit 1 */

.equ  RCC_CFGR_SW_HSI                     ,0x00000000         @< HSI selected as system clock */
.equ  RCC_CFGR_SW_HSE                     ,0x00000001         @< HSE selected as system clock */
.equ  RCC_CFGR_SW_PLL                     ,0x00000002         @< PLL selected as system clock */

@< SWS configuration */
.equ  RCC_CFGR_SWS                        ,0x0000000C         @< SWS[1:0] bits (System Clock Switch Status) */
.equ  RCC_CFGR_SWS_0                      ,0x00000004         @< Bit 0 */
.equ  RCC_CFGR_SWS_1                      ,0x00000008         @< Bit 1 */

.equ  RCC_CFGR_SWS_HSI                    ,0x00000000         @< HSI oscillator used as system clock */
.equ  RCC_CFGR_SWS_HSE                    ,0x00000004         @< HSE oscillator used as system clock */
.equ  RCC_CFGR_SWS_PLL                    ,0x00000008         @< PLL used as system clock */

@< HPRE configuration */
.equ  RCC_CFGR_HPRE                       ,0x000000F0         @< HPRE[3:0] bits (AHB prescaler) */
.equ  RCC_CFGR_HPRE_0                     ,0x00000010         @< Bit 0 */
.equ  RCC_CFGR_HPRE_1                     ,0x00000020         @< Bit 1 */
.equ  RCC_CFGR_HPRE_2                     ,0x00000040         @< Bit 2 */
.equ  RCC_CFGR_HPRE_3                     ,0x00000080         @< Bit 3 */

.equ  RCC_CFGR_HPRE_DIV1                  ,0x00000000         @< SYSCLK not divided */
.equ  RCC_CFGR_HPRE_DIV2                  ,0x00000080         @< SYSCLK divided by 2 */
.equ  RCC_CFGR_HPRE_DIV4                  ,0x00000090         @< SYSCLK divided by 4 */
.equ  RCC_CFGR_HPRE_DIV8                  ,0x000000A0         @< SYSCLK divided by 8 */
.equ  RCC_CFGR_HPRE_DIV16                 ,0x000000B0         @< SYSCLK divided by 16 */
.equ  RCC_CFGR_HPRE_DIV64                 ,0x000000C0         @< SYSCLK divided by 64 */
.equ  RCC_CFGR_HPRE_DIV128                ,0x000000D0         @< SYSCLK divided by 128 */
.equ  RCC_CFGR_HPRE_DIV256                ,0x000000E0         @< SYSCLK divided by 256 */
.equ  RCC_CFGR_HPRE_DIV512                ,0x000000F0         @< SYSCLK divided by 512 */

@< PPRE1 configuration */
.equ  RCC_CFGR_PPRE1                      ,0x00001C00         @< PRE1[2:0] bits (APB1 prescaler) */
.equ  RCC_CFGR_PPRE1_0                    ,0x00000400         @< Bit 0 */
.equ  RCC_CFGR_PPRE1_1                    ,0x00000800         @< Bit 1 */
.equ  RCC_CFGR_PPRE1_2                    ,0x00001000         @< Bit 2 */

.equ  RCC_CFGR_PPRE1_DIV1                 ,0x00000000         @< HCLK not divided */
.equ  RCC_CFGR_PPRE1_DIV2                 ,0x00001000         @< HCLK divided by 2 */
.equ  RCC_CFGR_PPRE1_DIV4                 ,0x00001400         @< HCLK divided by 4 */
.equ  RCC_CFGR_PPRE1_DIV8                 ,0x00001800         @< HCLK divided by 8 */
.equ  RCC_CFGR_PPRE1_DIV16                ,0x00001C00         @< HCLK divided by 16 */

@< PPRE2 configuration */
.equ  RCC_CFGR_PPRE2                      ,0x0000E000         @< PRE2[2:0] bits (APB2 prescaler) */
.equ  RCC_CFGR_PPRE2_0                    ,0x00002000         @< Bit 0 */
.equ  RCC_CFGR_PPRE2_1                    ,0x00004000         @< Bit 1 */
.equ  RCC_CFGR_PPRE2_2                    ,0x00008000         @< Bit 2 */

.equ  RCC_CFGR_PPRE2_DIV1                 ,0x00000000         @< HCLK not divided */
.equ  RCC_CFGR_PPRE2_DIV2                 ,0x00008000         @< HCLK divided by 2 */
.equ  RCC_CFGR_PPRE2_DIV4                 ,0x0000A000         @< HCLK divided by 4 */
.equ  RCC_CFGR_PPRE2_DIV8                 ,0x0000C000         @< HCLK divided by 8 */
.equ  RCC_CFGR_PPRE2_DIV16                ,0x0000E000         @< HCLK divided by 16 */

@< RTCPRE configuration */
.equ  RCC_CFGR_RTCPRE                     ,0x001F0000
.equ  RCC_CFGR_RTCPRE_0                   ,0x00010000
.equ  RCC_CFGR_RTCPRE_1                   ,0x00020000
.equ  RCC_CFGR_RTCPRE_2                   ,0x00040000
.equ  RCC_CFGR_RTCPRE_3                   ,0x00080000
.equ  RCC_CFGR_RTCPRE_4                   ,0x00100000

@< MCO1 configuration */
.equ  RCC_CFGR_MCO1                       ,0x00600000
.equ  RCC_CFGR_MCO1_0                     ,0x00200000
.equ  RCC_CFGR_MCO1_1                     ,0x00400000

