ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
.equ  RCC_CFGR_I2SSRC                     ,0x00800000

.equ  RCC_CFGR_MCO1PRE                    ,0x07000000
.equ  RCC_CFGR_MCO1PRE_0                  ,0x01000000
.equ  RCC_CFGR_MCO1PRE_1                  ,0x02000000
.equ  RCC_CFGR_MCO1PRE_2                  ,0x04000000

.equ  RCC_CFGR_MCO2PRE                    ,0x38000000
.equ  RCC_CFGR_MCO2PRE_0                  ,0x08000000
.equ  RCC_CFGR_MCO2PRE_1                  ,0x10000000
.equ  RCC_CFGR_MCO2PRE_2                  ,0x20000000

.equ  RCC_CFGR_MCO2                       ,0xC0000000
.equ  RCC_CFGR_MCO2_0                     ,0x40000000
.equ  RCC_CFGR_MCO2_1                     ,0x80000000

.equ  RCC_CIR                             ,0x0C
@*******************  Bit definition for RCC_CIR register  *******************/
.equ  RCC_CIR_LSIRDYF                     ,0x00000001
.equ  RCC_CIR_LSERDYF                     ,0x00000002
.equ  RCC_CIR_HSIRDYF                     ,0x00000004
.equ  RCC_CIR_HSERDYF                     ,0x00000008
.equ  RCC_CIR_PLLRDYF                     ,0x00000010
.equ  RCC_CIR_PLLI2SRDYF                  ,0x00000020
.equ  RCC_CIR_CSSF                        ,0x00000080
.equ  RCC_CIR_LSIRDYIE                    ,0x00000100
.equ  RCC_CIR_LSERDYIE                    ,0x00000200
.equ  RCC_CIR_HSIRDYIE                    ,0x00000400
.equ  RCC_CIR_HSERDYIE                    ,0x00000800
.equ  RCC_CIR_PLLRDYIE                    ,0x00001000
.equ  RCC_CIR_PLLI2SRDYIE                 ,0x00002000
.equ  RCC_CIR_LSIRDYC                     ,0x00010000
.equ  RCC_CIR_LSERDYC                     ,0x00020000
.equ  RCC_CIR_HSIRDYC                     ,0x00040000
.equ  RCC_CIR_HSERDYC                     ,0x00080000
.equ  RCC_CIR_PLLRDYC                     ,0x00100000
.equ  RCC_CIR_PLLI2SRDYC                  ,0x00200000
.equ  RCC_CIR_CSSC                        ,0x00800000

.equ  RCC_AHB1RSTR			  ,0x10
@*******************  Bit definition for RCC_AHB1RSTR register  **************/
.equ  RCC_AHB1RSTR_GPIOARST               ,0x00000001
.equ  RCC_AHB1RSTR_GPIOBRST               ,0x00000002
.equ  RCC_AHB1RSTR_GPIOCRST               ,0x00000004
.equ  RCC_AHB1RSTR_GPIODRST               ,0x00000008
.equ  RCC_AHB1RSTR_GPIOERST               ,0x00000010
.equ  RCC_AHB1RSTR_GPIOFRST               ,0x00000020
.equ  RCC_AHB1RSTR_GPIOGRST               ,0x00000040
.equ  RCC_AHB1RSTR_GPIOHRST               ,0x00000080
.equ  RCC_AHB1RSTR_GPIOIRST               ,0x00000100
.equ  RCC_AHB1RSTR_CRCRST                 ,0x00001000
.equ  RCC_AHB1RSTR_DMA1RST                ,0x00200000
.equ  RCC_AHB1RSTR_DMA2RST                ,0x00400000
.equ  RCC_AHB1RSTR_ETHMACRST              ,0x02000000
.equ  RCC_AHB1RSTR_OTGHRST                ,0x10000000

.equ  RCC_AHB2RSTR			  ,0x14
@*******************  Bit definition for RCC_AHB2RSTR register  **************/
.equ  RCC_AHB2RSTR_DCMIRST                ,0x00000001
.equ  RCC_AHB2RSTR_CRYPRST                ,0x00000010
.equ  RCC_AHB2RSTR_HSAHRST                ,0x00000020
.equ  RCC_AHB2RSTR_RNGRST                 ,0x00000040
.equ  RCC_AHB2RSTR_OTGFSRST               ,0x00000080

.equ  RCC_AHB3RSTR			  ,0x18
@*******************  Bit definition for RCC_AHB3RSTR register  **************/
.equ  RCC_AHB3RSTR_FSMCRST                ,0x00000001

.equ  RCC_APB1RSTR			  ,0x20
@*******************  Bit definition for RCC_APB1RSTR register  **************/
.equ  RCC_APB1RSTR_TIM2RST                ,0x00000001
.equ  RCC_APB1RSTR_TIM3RST                ,0x00000002
.equ  RCC_APB1RSTR_TIM4RST                ,0x00000004
.equ  RCC_APB1RSTR_TIM5RST                ,0x00000008
.equ  RCC_APB1RSTR_TIM6RST                ,0x00000010
.equ  RCC_APB1RSTR_TIM7RST                ,0x00000020
.equ  RCC_APB1RSTR_TIM12RST               ,0x00000040
.equ  RCC_APB1RSTR_TIM13RST               ,0x00000080
.equ  RCC_APB1RSTR_TIM14RST               ,0x00000100
.equ  RCC_APB1RSTR_WWDGEN                 ,0x00000800
.equ  RCC_APB1RSTR_SPI2RST                ,0x00008000
.equ  RCC_APB1RSTR_SPI3RST                ,0x00010000
.equ  RCC_APB1RSTR_USART2RST              ,0x00020000
.equ  RCC_APB1RSTR_USART3RST              ,0x00040000
.equ  RCC_APB1RSTR_UART4RST               ,0x00080000
.equ  RCC_APB1RSTR_UART5RST               ,0x00100000
.equ  RCC_APB1RSTR_I2C1RST                ,0x00200000
.equ  RCC_APB1RSTR_I2C2RST                ,0x00400000
.equ  RCC_APB1RSTR_I2C3RST                ,0x00800000
.equ  RCC_APB1RSTR_CAN1RST                ,0x02000000
.equ  RCC_APB1RSTR_CAN2RST                ,0x04000000
.equ  RCC_APB1RSTR_PWRRST                 ,0x10000000
.equ  RCC_APB1RSTR_DACRST                 ,0x20000000

.equ  RCC_APB2RSTR                        ,0x24
@*******************  Bit definition for RCC_APB2RSTR register  **************/
.equ  RCC_APB2RSTR_TIM1RST                ,0x00000001
.equ  RCC_APB2RSTR_TIM8RST                ,0x00000002
.equ  RCC_APB2RSTR_USART1RST              ,0x00000010
.equ  RCC_APB2RSTR_USART6RST              ,0x00000020
.equ  RCC_APB2RSTR_ADCRST                 ,0x00000100
.equ  RCC_APB2RSTR_SDIORST                ,0x00000800
.equ  RCC_APB2RSTR_SPI1RST                ,0x00001000
.equ  RCC_APB2RSTR_SYSCFGRST              ,0x00004000
.equ  RCC_APB2RSTR_TIM9RST                ,0x00010000
.equ  RCC_APB2RSTR_TIM10RST               ,0x00020000
.equ  RCC_APB2RSTR_TIM11RST               ,0x00040000
@ Old SPI1RST bit definition, maintained for legacy purpose */
.equ  RCC_APB2RSTR_SPI1                   ,RCC_APB2RSTR_SPI1RST

.equ  RCC_AHB1ENR			  ,0x30
@*******************  Bit definition for RCC_AHB1ENR register  ***************/
.equ  RCC_AHB1ENR_GPIOAEN                 ,0x00000001
.equ  RCC_AHB1ENR_GPIOBEN                 ,0x00000002
.equ  RCC_AHB1ENR_GPIOCEN                 ,0x00000004
.equ  RCC_AHB1ENR_GPIODEN                 ,0x00000008
.equ  RCC_AHB1ENR_GPIOEEN                 ,0x00000010
.equ  RCC_AHB1ENR_GPIOFEN                 ,0x00000020
.equ  RCC_AHB1ENR_GPIOGEN                 ,0x00000040
.equ  RCC_AHB1ENR_GPIOHEN                 ,0x00000080
.equ  RCC_AHB1ENR_GPIOIEN                 ,0x00000100
.equ  RCC_AHB1ENR_CRCEN                   ,0x00001000
.equ  RCC_AHB1ENR_BKPSRAMEN               ,0x00040000
.equ  RCC_AHB1ENR_CCMDATARAMEN            ,0x00100000
.equ  RCC_AHB1ENR_DMA1EN                  ,0x00200000
.equ  RCC_AHB1ENR_DMA2EN                  ,0x00400000
.equ  RCC_AHB1ENR_ETHMACEN                ,0x02000000
.equ  RCC_AHB1ENR_ETHMACTXEN              ,0x04000000
.equ  RCC_AHB1ENR_ETHMACRXEN              ,0x08000000
.equ  RCC_AHB1ENR_ETHMACPTPEN             ,0x10000000
.equ  RCC_AHB1ENR_OTGHSEN                 ,0x20000000
.equ  RCC_AHB1ENR_OTGHSULPIEN             ,0x40000000

.equ  RCC_AHB2ENR			  ,0x34
@*******************  Bit definition for RCC_AHB2ENR register  ***************/
.equ  RCC_AHB2ENR_DCMIEN                  ,0x00000001
.equ  RCC_AHB2ENR_CRYPEN                  ,0x00000010
.equ  RCC_AHB2ENR_HASHEN                  ,0x00000020
.equ  RCC_AHB2ENR_RNGEN                   ,0x00000040
.equ  RCC_AHB2ENR_OTGFSEN                 ,0x00000080

.equ  RCC_AHB3ENR			  ,0x38
@*******************  Bit definition for RCC_AHB3ENR register  ***************/
.equ  RCC_AHB3ENR_FSMCEN                  ,0x00000001

.equ  RCC_APB1ENR			  ,0x40
@*******************  Bit definition for RCC_APB1ENR register  ***************/
.equ  RCC_APB1ENR_TIM2EN                  ,0x00000001
.equ  RCC_APB1ENR_TIM3EN                  ,0x00000002
.equ  RCC_APB1ENR_TIM4EN                  ,0x00000004
.equ  RCC_APB1ENR_TIM5EN                  ,0x00000008
.equ  RCC_APB1ENR_TIM6EN                  ,0x00000010
.equ  RCC_APB1ENR_TIM7EN                  ,0x00000020
.equ  RCC_APB1ENR_TIM12EN                 ,0x00000040
.equ  RCC_APB1ENR_TIM13EN                 ,0x00000080
.equ  RCC_APB1ENR_TIM14EN                 ,0x00000100
.equ  RCC_APB1ENR_WWDGEN                  ,0x00000800
.equ  RCC_APB1ENR_SPI2EN                  ,0x00004000
.equ  RCC_APB1ENR_SPI3EN                  ,0x00008000
.equ  RCC_APB1ENR_USART2EN                ,0x00020000
.equ  RCC_APB1ENR_USART3EN                ,0x00040000
.equ  RCC_APB1ENR_UART4EN                 ,0x00080000
.equ  RCC_APB1ENR_UART5EN                 ,0x00100000
.equ  RCC_APB1ENR_I2C1EN                  ,0x00200000
.equ  RCC_APB1ENR_I2C2EN                  ,0x00400000
.equ  RCC_APB1ENR_I2C3EN                  ,0x00800000
.equ  RCC_APB1ENR_CAN1EN                  ,0x02000000
.equ  RCC_APB1ENR_CAN2EN                  ,0x04000000
.equ  RCC_APB1ENR_PWREN                   ,0x10000000
.equ  RCC_APB1ENR_DACEN                   ,0x20000000

@*******************  Bit definition for RCC_APB2ENR register  ***************/
.equ  RCC_APB2ENR_TIM1EN                  ,0x00000001
.equ  RCC_APB2ENR_TIM8EN                  ,0x00000002
.equ  RCC_APB2ENR_USART1EN                ,0x00000010
.equ  RCC_APB2ENR_USART6EN                ,0x00000020
.equ  RCC_APB2ENR_ADC1EN                  ,0x00000100
.equ  RCC_APB2ENR_ADC2EN                  ,0x00000200
.equ  RCC_APB2ENR_ADC3EN                  ,0x00000400
.equ  RCC_APB2ENR_SDIOEN                  ,0x00000800
.equ  RCC_APB2ENR_SPI1EN                  ,0x00001000
.equ  RCC_APB2ENR_SYSCFGEN                ,0x00004000
.equ  RCC_APB2ENR_TIM11EN                 ,0x00040000
.equ  RCC_APB2ENR_TIM10EN                 ,0x00020000
.equ  RCC_APB2ENR_TIM9EN                  ,0x00010000

.equ  RCC_AHB1LPENR			  ,0x50
@*******************  Bit definition for RCC_AHB1LPENR register  *************/
.equ  RCC_AHB1LPENR_GPIOALPEN             ,0x00000001
.equ  RCC_AHB1LPENR_GPIOBLPEN             ,0x00000002
.equ  RCC_AHB1LPENR_GPIOCLPEN             ,0x00000004
.equ  RCC_AHB1LPENR_GPIODLPEN             ,0x00000008
.equ  RCC_AHB1LPENR_GPIOELPEN             ,0x00000010
.equ  RCC_AHB1LPENR_GPIOFLPEN             ,0x00000020
.equ  RCC_AHB1LPENR_GPIOGLPEN             ,0x00000040
.equ  RCC_AHB1LPENR_GPIOHLPEN             ,0x00000080
.equ  RCC_AHB1LPENR_GPIOILPEN             ,0x00000100
.equ  RCC_AHB1LPENR_CRCLPEN               ,0x00001000
.equ  RCC_AHB1LPENR_FLITFLPEN             ,0x00008000
.equ  RCC_AHB1LPENR_SRAM1LPEN             ,0x00010000
.equ  RCC_AHB1LPENR_SRAM2LPEN             ,0x00020000
.equ  RCC_AHB1LPENR_BKPSRAMLPEN           ,0x00040000
.equ  RCC_AHB1LPENR_DMA1LPEN              ,0x00200000
.equ  RCC_AHB1LPENR_DMA2LPEN              ,0x00400000
.equ  RCC_AHB1LPENR_ETHMACLPEN            ,0x02000000
.equ  RCC_AHB1LPENR_ETHMACTXLPEN          ,0x04000000
.equ  RCC_AHB1LPENR_ETHMACRXLPEN          ,0x08000000
.equ  RCC_AHB1LPENR_ETHMACPTPLPEN         ,0x10000000
.equ  RCC_AHB1LPENR_OTGHSLPEN             ,0x20000000
.equ  RCC_AHB1LPENR_OTGHSULPILPEN         ,0x40000000

