ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
@*******************  Bits definition for RTC_WPR register  ******************/
.equ RTC_WPR_KEY                          ,0x000000FF

@*******************  Bits definition for RTC_SSR register  ******************/
.equ RTC_SSR_SS                           ,0x0000FFFF

@*******************  Bits definition for RTC_SHIFTR register  ***************/
.equ RTC_SHIFTR_SUBFS                     ,0x00007FFF
.equ RTC_SHIFTR_ADD1S                     ,0x80000000

@*******************  Bits definition for RTC_TSTR register  *****************/
.equ RTC_TSTR_PM                          ,0x00400000
.equ RTC_TSTR_HT                          ,0x00300000
.equ RTC_TSTR_HT_0                        ,0x00100000
.equ RTC_TSTR_HT_1                        ,0x00200000
.equ RTC_TSTR_HU                          ,0x000F0000
.equ RTC_TSTR_HU_0                        ,0x00010000
.equ RTC_TSTR_HU_1                        ,0x00020000
.equ RTC_TSTR_HU_2                        ,0x00040000
.equ RTC_TSTR_HU_3                        ,0x00080000
.equ RTC_TSTR_MNT                         ,0x00007000
.equ RTC_TSTR_MNT_0                       ,0x00001000
.equ RTC_TSTR_MNT_1                       ,0x00002000
.equ RTC_TSTR_MNT_2                       ,0x00004000
.equ RTC_TSTR_MNU                         ,0x00000F00
.equ RTC_TSTR_MNU_0                       ,0x00000100
.equ RTC_TSTR_MNU_1                       ,0x00000200
.equ RTC_TSTR_MNU_2                       ,0x00000400
.equ RTC_TSTR_MNU_3                       ,0x00000800
.equ RTC_TSTR_ST                          ,0x00000070
.equ RTC_TSTR_ST_0                        ,0x00000010
.equ RTC_TSTR_ST_1                        ,0x00000020
.equ RTC_TSTR_ST_2                        ,0x00000040
.equ RTC_TSTR_SU                          ,0x0000000F
.equ RTC_TSTR_SU_0                        ,0x00000001
.equ RTC_TSTR_SU_1                        ,0x00000002
.equ RTC_TSTR_SU_2                        ,0x00000004
.equ RTC_TSTR_SU_3                        ,0x00000008

@*******************  Bits definition for RTC_TSDR register  *****************/
.equ RTC_TSDR_WDU                         ,0x0000E000
.equ RTC_TSDR_WDU_0                       ,0x00002000
.equ RTC_TSDR_WDU_1                       ,0x00004000
.equ RTC_TSDR_WDU_2                       ,0x00008000
.equ RTC_TSDR_MT                          ,0x00001000
.equ RTC_TSDR_MU                          ,0x00000F00
.equ RTC_TSDR_MU_0                        ,0x00000100
.equ RTC_TSDR_MU_1                        ,0x00000200
.equ RTC_TSDR_MU_2                        ,0x00000400
.equ RTC_TSDR_MU_3                        ,0x00000800
.equ RTC_TSDR_DT                          ,0x00000030
.equ RTC_TSDR_DT_0                        ,0x00000010
.equ RTC_TSDR_DT_1                        ,0x00000020
.equ RTC_TSDR_DU                          ,0x0000000F
.equ RTC_TSDR_DU_0                        ,0x00000001
.equ RTC_TSDR_DU_1                        ,0x00000002
.equ RTC_TSDR_DU_2                        ,0x00000004
.equ RTC_TSDR_DU_3                        ,0x00000008

@*******************  Bits definition for RTC_TSSSR register  ****************/
.equ RTC_TSSSR_SS                         ,0x0000FFFF

@*******************  Bits definition for RTC_CAL register  *****************/
.equ RTC_CALR_CALP                        ,0x00008000
.equ RTC_CALR_CALW8                       ,0x00004000
.equ RTC_CALR_CALW16                      ,0x00002000
.equ RTC_CALR_CALM                        ,0x000001FF
.equ RTC_CALR_CALM_0                      ,0x00000001
.equ RTC_CALR_CALM_1                      ,0x00000002
.equ RTC_CALR_CALM_2                      ,0x00000004
.equ RTC_CALR_CALM_3                      ,0x00000008
.equ RTC_CALR_CALM_4                      ,0x00000010
.equ RTC_CALR_CALM_5                      ,0x00000020
.equ RTC_CALR_CALM_6                      ,0x00000040
.equ RTC_CALR_CALM_7                      ,0x00000080
.equ RTC_CALR_CALM_8                      ,0x00000100

@*******************  Bits definition for RTC_TAFCR register  ****************/
.equ RTC_TAFCR_ALARMOUTTYPE               ,0x00040000
.equ RTC_TAFCR_TSINSEL                    ,0x00020000
.equ RTC_TAFCR_TAMPINSEL                  ,0x00010000
.equ RTC_TAFCR_TAMPPUDIS                  ,0x00008000
.equ RTC_TAFCR_TAMPPRCH                   ,0x00006000
.equ RTC_TAFCR_TAMPPRCH_0                 ,0x00002000
.equ RTC_TAFCR_TAMPPRCH_1                 ,0x00004000
.equ RTC_TAFCR_TAMPFLT                    ,0x00001800
.equ RTC_TAFCR_TAMPFLT_0                  ,0x00000800
.equ RTC_TAFCR_TAMPFLT_1                  ,0x00001000
.equ RTC_TAFCR_TAMPFREQ                   ,0x00000700
.equ RTC_TAFCR_TAMPFREQ_0                 ,0x00000100
.equ RTC_TAFCR_TAMPFREQ_1                 ,0x00000200
.equ RTC_TAFCR_TAMPFREQ_2                 ,0x00000400
.equ RTC_TAFCR_TAMPTS                     ,0x00000080
.equ RTC_TAFCR_TAMPIE                     ,0x00000004
.equ RTC_TAFCR_TAMP1TRG                   ,0x00000002
.equ RTC_TAFCR_TAMP1E                     ,0x00000001

@*******************  Bits definition for RTC_ALRMASSR register  *************/
.equ RTC_ALRMASSR_MASKSS                  ,0x0F000000
.equ RTC_ALRMASSR_MASKSS_0                ,0x01000000
.equ RTC_ALRMASSR_MASKSS_1                ,0x02000000
.equ RTC_ALRMASSR_MASKSS_2                ,0x04000000
.equ RTC_ALRMASSR_MASKSS_3                ,0x08000000
.equ RTC_ALRMASSR_SS                      ,0x00007FFF

@*******************  Bits definition for RTC_ALRMBSSR register  *************/
.equ RTC_ALRMBSSR_MASKSS                  ,0x0F000000
.equ RTC_ALRMBSSR_MASKSS_0                ,0x01000000
.equ RTC_ALRMBSSR_MASKSS_1                ,0x02000000
.equ RTC_ALRMBSSR_MASKSS_2                ,0x04000000
.equ RTC_ALRMBSSR_MASKSS_3                ,0x08000000
.equ RTC_ALRMBSSR_SS                      ,0x00007FFF

@*******************  Bits definition for RTC_BKP0R register  ****************/
.equ RTC_BKP0R                            ,0xFFFFFFFF

@*******************  Bits definition for RTC_BKP1R register  ****************/
.equ RTC_BKP1R                            ,0xFFFFFFFF

@*******************  Bits definition for RTC_BKP2R register  ****************/
.equ RTC_BKP2R                            ,0xFFFFFFFF

@*******************  Bits definition for RTC_BKP3R register  ****************/
.equ RTC_BKP3R                            ,0xFFFFFFFF

@*******************  Bits definition for RTC_BKP4R register  ****************/
.equ RTC_BKP4R                            ,0xFFFFFFFF

@*******************  Bits definition for RTC_BKP5R register  ****************/
.equ RTC_BKP5R                            ,0xFFFFFFFF

@*******************  Bits definition for RTC_BKP6R register  ****************/
.equ RTC_BKP6R                            ,0xFFFFFFFF

@*******************  Bits definition for RTC_BKP7R register  ****************/
.equ RTC_BKP7R                            ,0xFFFFFFFF

@*******************  Bits definition for RTC_BKP8R register  ****************/
.equ RTC_BKP8R                            ,0xFFFFFFFF

@*******************  Bits definition for RTC_BKP9R register  ****************/
.equ RTC_BKP9R                            ,0xFFFFFFFF

@*******************  Bits definition for RTC_BKP10R register  ***************/
.equ RTC_BKP10R                           ,0xFFFFFFFF

@*******************  Bits definition for RTC_BKP11R register  ***************/
.equ RTC_BKP11R                           ,0xFFFFFFFF

@*******************  Bits definition for RTC_BKP12R register  ***************/
.equ RTC_BKP12R                           ,0xFFFFFFFF

@*******************  Bits definition for RTC_BKP13R register  ***************/
.equ RTC_BKP13R                           ,0xFFFFFFFF

@*******************  Bits definition for RTC_BKP14R register  ***************/
.equ RTC_BKP14R                           ,0xFFFFFFFF

@*******************  Bits definition for RTC_BKP15R register  ***************/
.equ RTC_BKP15R                           ,0xFFFFFFFF

@*******************  Bits definition for RTC_BKP16R register  ***************/
.equ RTC_BKP16R                           ,0xFFFFFFFF

@*******************  Bits definition for RTC_BKP17R register  ***************/
.equ RTC_BKP17R                           ,0xFFFFFFFF

