ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
@*******************  Bits definition for RTC_BKP18R register  ***************/
.equ RTC_BKP18R                           ,0xFFFFFFFF

@*******************  Bits definition for RTC_BKP19R register  ***************/
.equ RTC_BKP19R                           ,0xFFFFFFFF

@******************************************************************************/
@*                                                                            */
@*                          SD host Interface                                 */
@*                                                                            */
@******************************************************************************/
@*****************  Bit definition for SDIO_POWER register  ******************/
.equ  SDIO_POWER_PWRCTRL                  ,0x03               @<PWRCTRL[1:0] bits (Power supply control bits) */
.equ  SDIO_POWER_PWRCTRL_0                ,0x01               @<Bit 0 */
.equ  SDIO_POWER_PWRCTRL_1                ,0x02               @<Bit 1 */

@*****************  Bit definition for SDIO_CLKCR register  ******************/
.equ  SDIO_CLKCR_CLKDIV                   ,0x00FF            @<Clock divide factor */
.equ  SDIO_CLKCR_CLKEN                    ,0x0100            @<Clock enable bit */
.equ  SDIO_CLKCR_PWRSAV                   ,0x0200            @<Power saving configuration bit */
.equ  SDIO_CLKCR_BYPASS                   ,0x0400            @<Clock divider bypass enable bit */

.equ  SDIO_CLKCR_WIDBUS                   ,0x1800            @<WIDBUS[1:0] bits (Wide bus mode enable bit) */
.equ  SDIO_CLKCR_WIDBUS_0                 ,0x0800            @<Bit 0 */
.equ  SDIO_CLKCR_WIDBUS_1                 ,0x1000            @<Bit 1 */

.equ  SDIO_CLKCR_NEGEDGE                  ,0x2000            @<SDIO_CK dephasing selection bit */
.equ  SDIO_CLKCR_HWFC_EN                  ,0x4000            @<HW Flow Control enable */

@******************  Bit definition for SDIO_ARG register  *******************/
.equ  SDIO_ARG_CMDARG                     ,0xFFFFFFFF            @<Command argument */

@******************  Bit definition for SDIO_CMD register  *******************/
.equ  SDIO_CMD_CMDINDEX                   ,0x003F            @<Command Index */

.equ  SDIO_CMD_WAITRESP                   ,0x00C0            @<WAITRESP[1:0] bits (Wait for response bits) */
.equ  SDIO_CMD_WAITRESP_0                 ,0x0040            @< Bit 0 */
.equ  SDIO_CMD_WAITRESP_1                 ,0x0080            @< Bit 1 */

.equ  SDIO_CMD_WAITINT                    ,0x0100            @<CPSM Waits for Interrupt Request */
.equ  SDIO_CMD_WAITPEND                   ,0x0200            @<CPSM Waits for ends of data transfer (CmdPend internal signal) */
.equ  SDIO_CMD_CPSMEN                     ,0x0400            @<Command path state machine (CPSM) Enable bit */
.equ  SDIO_CMD_SDIOSUSPEND                ,0x0800            @<SD I/O suspend command */
.equ  SDIO_CMD_ENCMDCOMPL                 ,0x1000            @<Enable CMD completion */
.equ  SDIO_CMD_NIEN                       ,0x2000            @<Not Interrupt Enable */
.equ  SDIO_CMD_CEATACMD                   ,0x4000            @<CE-ATA command */

@****************  Bit definition for SDIO_RESPCMD register  *****************/
.equ  SDIO_RESPCMD_RESPCMD                ,0x3F               @<Response command index */

@*****************  Bit definition for SDIO_RESP0 register  ******************/
.equ  SDIO_RESP0_CARDSTATUS0              ,0xFFFFFFFF         @<Card Status */

@*****************  Bit definition for SDIO_RESP1 register  ******************/
.equ  SDIO_RESP1_CARDSTATUS1              ,0xFFFFFFFF         @<Card Status */

@*****************  Bit definition for SDIO_RESP2 register  ******************/
.equ  SDIO_RESP2_CARDSTATUS2              ,0xFFFFFFFF         @<Card Status */

@*****************  Bit definition for SDIO_RESP3 register  ******************/
.equ  SDIO_RESP3_CARDSTATUS3              ,0xFFFFFFFF         @<Card Status */

@*****************  Bit definition for SDIO_RESP4 register  ******************/
.equ  SDIO_RESP4_CARDSTATUS4              ,0xFFFFFFFF         @<Card Status */

@*****************  Bit definition for SDIO_DTIMER register  *****************/
.equ  SDIO_DTIMER_DATATIME                ,0xFFFFFFFF         @<Data timeout period. */

@*****************  Bit definition for SDIO_DLEN register  *******************/
.equ  SDIO_DLEN_DATALENGTH                ,0x01FFFFFF         @<Data length value */

@*****************  Bit definition for SDIO_DCTRL register  ******************/
.equ  SDIO_DCTRL_DTEN                     ,0x0001            @<Data transfer enabled bit */
.equ  SDIO_DCTRL_DTDIR                    ,0x0002            @<Data transfer direction selection */
.equ  SDIO_DCTRL_DTMODE                   ,0x0004            @<Data transfer mode selection */
.equ  SDIO_DCTRL_DMAEN                    ,0x0008            @<DMA enabled bit */

.equ  SDIO_DCTRL_DBLOCKSIZE               ,0x00F0            @<DBLOCKSIZE[3:0] bits (Data block size) */
.equ  SDIO_DCTRL_DBLOCKSIZE_0             ,0x0010            @<Bit 0 */
.equ  SDIO_DCTRL_DBLOCKSIZE_1             ,0x0020            @<Bit 1 */
.equ  SDIO_DCTRL_DBLOCKSIZE_2             ,0x0040            @<Bit 2 */
.equ  SDIO_DCTRL_DBLOCKSIZE_3             ,0x0080            @<Bit 3 */

.equ  SDIO_DCTRL_RWSTART                  ,0x0100            @<Read wait start */
.equ  SDIO_DCTRL_RWSTOP                   ,0x0200            @<Read wait stop */
.equ  SDIO_DCTRL_RWMOD                    ,0x0400            @<Read wait mode */
.equ  SDIO_DCTRL_SDIOEN                   ,0x0800            @<SD I/O enable functions */

@*****************  Bit definition for SDIO_DCOUNT register  *****************/
.equ  SDIO_DCOUNT_DATACOUNT               ,0x01FFFFFF         @<Data count value */

@*****************  Bit definition for SDIO_STA register  ********************/
.equ  SDIO_STA_CCRCFAIL                   ,0x00000001         @<Command response received (CRC check failed) */
.equ  SDIO_STA_DCRCFAIL                   ,0x00000002         @<Data block sent/received (CRC check failed) */
.equ  SDIO_STA_CTIMEOUT                   ,0x00000004         @<Command response timeout */
.equ  SDIO_STA_DTIMEOUT                   ,0x00000008         @<Data timeout */
.equ  SDIO_STA_TXUNDERR                   ,0x00000010         @<Transmit FIFO underrun error */
.equ  SDIO_STA_RXOVERR                    ,0x00000020         @<Received FIFO overrun error */
.equ  SDIO_STA_CMDREND                    ,0x00000040         @<Command response received (CRC check passed) */
.equ  SDIO_STA_CMDSENT                    ,0x00000080         @<Command sent (no response required) */
.equ  SDIO_STA_DATAEND                    ,0x00000100         @<Data end (data counter, SDIDCOUNT, is zero) */
.equ  SDIO_STA_STBITERR                   ,0x00000200         @<Start bit not detected on all data signals in wide bus mode */
.equ  SDIO_STA_DBCKEND                    ,0x00000400         @<Data block sent/received (CRC check passed) */
.equ  SDIO_STA_CMDACT                     ,0x00000800         @<Command transfer in progress */
.equ  SDIO_STA_TXACT                      ,0x00001000         @<Data transmit in progress */
.equ  SDIO_STA_RXACT                      ,0x00002000         @<Data receive in progress */
.equ  SDIO_STA_TXFIFOHE                   ,0x00004000         @<Transmit FIFO Half Empty: at least 8 words can be written into the FIFO */
.equ  SDIO_STA_RXFIFOHF                   ,0x00008000         @<Receive FIFO Half Full: there are at least 8 words in the FIFO */
.equ  SDIO_STA_TXFIFOF                    ,0x00010000         @<Transmit FIFO full */
.equ  SDIO_STA_RXFIFOF                    ,0x00020000         @<Receive FIFO full */
.equ  SDIO_STA_TXFIFOE                    ,0x00040000         @<Transmit FIFO empty */
.equ  SDIO_STA_RXFIFOE                    ,0x00080000         @<Receive FIFO empty */
.equ  SDIO_STA_TXDAVL                     ,0x00100000         @<Data available in transmit FIFO */
.equ  SDIO_STA_RXDAVL                     ,0x00200000         @<Data available in receive FIFO */
.equ  SDIO_STA_SDIOIT                     ,0x00400000         @<SDIO interrupt received */
.equ  SDIO_STA_CEATAEND                   ,0x00800000         @<CE-ATA command completion signal received for CMD61 */

@******************  Bit definition for SDIO_ICR register  *******************/
.equ  SDIO_ICR_CCRCFAILC                  ,0x00000001         @<CCRCFAIL flag clear bit */
.equ  SDIO_ICR_DCRCFAILC                  ,0x00000002         @<DCRCFAIL flag clear bit */
.equ  SDIO_ICR_CTIMEOUTC                  ,0x00000004         @<CTIMEOUT flag clear bit */
.equ  SDIO_ICR_DTIMEOUTC                  ,0x00000008         @<DTIMEOUT flag clear bit */
.equ  SDIO_ICR_TXUNDERRC                  ,0x00000010         @<TXUNDERR flag clear bit */
.equ  SDIO_ICR_RXOVERRC                   ,0x00000020         @<RXOVERR flag clear bit */
.equ  SDIO_ICR_CMDRENDC                   ,0x00000040         @<CMDREND flag clear bit */
.equ  SDIO_ICR_CMDSENTC                   ,0x00000080         @<CMDSENT flag clear bit */
.equ  SDIO_ICR_DATAENDC                   ,0x00000100         @<DATAEND flag clear bit */
.equ  SDIO_ICR_STBITERRC                  ,0x00000200         @<STBITERR flag clear bit */
.equ  SDIO_ICR_DBCKENDC                   ,0x00000400         @<DBCKEND flag clear bit */
.equ  SDIO_ICR_SDIOITC                    ,0x00400000         @<SDIOIT flag clear bit */
.equ  SDIO_ICR_CEATAENDC                  ,0x00800000         @<CEATAEND flag clear bit */

@*****************  Bit definition for SDIO_MASK register  *******************/
.equ  SDIO_MASK_CCRCFAILIE                ,0x00000001         @<Command CRC Fail Interrupt Enable */
.equ  SDIO_MASK_DCRCFAILIE                ,0x00000002         @<Data CRC Fail Interrupt Enable */
.equ  SDIO_MASK_CTIMEOUTIE                ,0x00000004         @<Command TimeOut Interrupt Enable */
.equ  SDIO_MASK_DTIMEOUTIE                ,0x00000008         @<Data TimeOut Interrupt Enable */
.equ  SDIO_MASK_TXUNDERRIE                ,0x00000010         @<Tx FIFO UnderRun Error Interrupt Enable */
.equ  SDIO_MASK_RXOVERRIE                 ,0x00000020         @<Rx FIFO OverRun Error Interrupt Enable */
.equ  SDIO_MASK_CMDRENDIE                 ,0x00000040         @<Command Response Received Interrupt Enable */
.equ  SDIO_MASK_CMDSENTIE                 ,0x00000080         @<Command Sent Interrupt Enable */
.equ  SDIO_MASK_DATAENDIE                 ,0x00000100         @<Data End Interrupt Enable */
.equ  SDIO_MASK_STBITERRIE                ,0x00000200         @<Start Bit Error Interrupt Enable */
.equ  SDIO_MASK_DBCKENDIE                 ,0x00000400         @<Data Block End Interrupt Enable */
.equ  SDIO_MASK_CMDACTIE                  ,0x00000800         @<CCommand Acting Interrupt Enable */
.equ  SDIO_MASK_TXACTIE                   ,0x00001000         @<Data Transmit Acting Interrupt Enable */
.equ  SDIO_MASK_RXACTIE                   ,0x00002000         @<Data receive acting interrupt enabled */
.equ  SDIO_MASK_TXFIFOHEIE                ,0x00004000         @<Tx FIFO Half Empty interrupt Enable */
.equ  SDIO_MASK_RXFIFOHFIE                ,0x00008000         @<Rx FIFO Half Full interrupt Enable */
.equ  SDIO_MASK_TXFIFOFIE                 ,0x00010000         @<Tx FIFO Full interrupt Enable */
.equ  SDIO_MASK_RXFIFOFIE                 ,0x00020000         @<Rx FIFO Full interrupt Enable */
.equ  SDIO_MASK_TXFIFOEIE                 ,0x00040000         @<Tx FIFO Empty interrupt Enable */
.equ  SDIO_MASK_RXFIFOEIE                 ,0x00080000         @<Rx FIFO Empty interrupt Enable */
.equ  SDIO_MASK_TXDAVLIE                  ,0x00100000         @<Data available in Tx FIFO interrupt Enable */
.equ  SDIO_MASK_RXDAVLIE                  ,0x00200000         @<Data available in Rx FIFO interrupt Enable */
.equ  SDIO_MASK_SDIOITIE                  ,0x00400000         @<SDIO Mode Interrupt Received interrupt Enable */
.equ  SDIO_MASK_CEATAENDIE                ,0x00800000         @<CE-ATA command completion signal received Interrupt Enable */

@****************  Bit definition for SDIO_FIFOCNT register  *****************/
.equ  SDIO_FIFOCNT_FIFOCOUNT              ,0x00FFFFFF         @<Remaining number of words to be written to or read from the FIFO */

@*****************  Bit definition for SDIO_FIFO register  *******************/
.equ  SDIO_FIFO_FIFODATA                  ,0xFFFFFFFF         @<Receive and transmit FIFO data */

@*****************************************************************************/
@                                                                            */
@                        Serial Peripheral Interface                         */
@                                                                            */
@*****************************************************************************/
@******************  Bit definition for SPI_CR1 register  ********************/
.equ  SPI_CR1_CPHA                        ,0x0001             @<Clock Phase */
.equ  SPI_CR1_CPOL                        ,0x0002             @<Clock Polarity */
.equ  SPI_CR1_MSTR                        ,0x0004             @<Master Selection */

