ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
.equ  SPI_CR1_BR                          ,0x0038             @<BR[2:0] bits (Baud Rate Control) */
.equ  SPI_CR1_BR_0                        ,0x0008             @<Bit 0 */
.equ  SPI_CR1_BR_1                        ,0x0010             @<Bit 1 */
.equ  SPI_CR1_BR_2                        ,0x0020             @<Bit 2 */

.equ  SPI_CR1_SPE                         ,0x0040             @<SPI Enable */
.equ  SPI_CR1_LSBFIRST                    ,0x0080             @<Frame Format */
.equ  SPI_CR1_SSI                         ,0x0100             @<Internal slave select */
.equ  SPI_CR1_SSM                         ,0x0200             @<Software slave management */
.equ  SPI_CR1_RXONLY                      ,0x0400             @<Receive only */
.equ  SPI_CR1_DFF                         ,0x0800             @<Data Frame Format */
.equ  SPI_CR1_CRCNEXT                     ,0x1000             @<Transmit CRC next */
.equ  SPI_CR1_CRCEN                       ,0x2000             @<Hardware CRC calculation enable */
.equ  SPI_CR1_BIDIOE                      ,0x4000             @<Output enable in bidirectional mode */
.equ  SPI_CR1_BIDIMODE                    ,0x8000             @<Bidirectional data mode enable */

@******************  Bit definition for SPI_CR2 register  ********************/
.equ  SPI_CR2_RXDMAEN                     ,0x01               @<Rx Buffer DMA Enable */
.equ  SPI_CR2_TXDMAEN                     ,0x02               @<Tx Buffer DMA Enable */
.equ  SPI_CR2_SSOE                        ,0x04               @<SS Output Enable */
.equ  SPI_CR2_ERRIE                       ,0x20               @<Error Interrupt Enable */
.equ  SPI_CR2_RXNEIE                      ,0x40               @<RX buffer Not Empty Interrupt Enable */
.equ  SPI_CR2_TXEIE                       ,0x80               @<Tx buffer Empty Interrupt Enable */

@*******************  Bit definition for SPI_SR register  ********************/
.equ  SPI_SR_RXNE                         ,0x01               @<Receive buffer Not Empty */
.equ  SPI_SR_TXE                          ,0x02               @<Transmit buffer Empty */
.equ  SPI_SR_CHSIDE                       ,0x04               @<Channel side */
.equ  SPI_SR_UDR                          ,0x08               @<Underrun flag */
.equ  SPI_SR_CRCERR                       ,0x10               @<CRC Error flag */
.equ  SPI_SR_MODF                         ,0x20               @<Mode fault */
.equ  SPI_SR_OVR                          ,0x40               @<Overrun flag */
.equ  SPI_SR_BSY                          ,0x80               @<Busy flag */

@*******************  Bit definition for SPI_DR register  ********************/
.equ  SPI_DR_DR                           ,0xFFFF             @<Data Register */

@******************  Bit definition for SPI_CRCPR register  ******************/
.equ  SPI_CRCPR_CRCPOLY                   ,0xFFFF             @<CRC polynomial register */

@*****************  Bit definition for SPI_RXCRCR register  ******************/
.equ  SPI_RXCRCR_RXCRC                    ,0xFFFF             @<Rx CRC Register */

@*****************  Bit definition for SPI_TXCRCR register  ******************/
.equ  SPI_TXCRCR_TXCRC                    ,0xFFFF             @<Tx CRC Register */

@*****************  Bit definition for SPI_I2SCFGR register  *****************/
.equ  SPI_I2SCFGR_CHLEN                   ,0x0001             @<Channel length (number of bits per audio channel) */

.equ  SPI_I2SCFGR_DATLEN                  ,0x0006             @<DATLEN[1:0] bits (Data length to be transferred) */
.equ  SPI_I2SCFGR_DATLEN_0                ,0x0002             @<Bit 0 */
.equ  SPI_I2SCFGR_DATLEN_1                ,0x0004             @<Bit 1 */

.equ  SPI_I2SCFGR_CKPOL                   ,0x0008             @<steady state clock polarity */

.equ  SPI_I2SCFGR_I2SSTD                  ,0x0030             @<I2SSTD[1:0] bits (I2S standard selection) */
.equ  SPI_I2SCFGR_I2SSTD_0                ,0x0010             @<Bit 0 */
.equ  SPI_I2SCFGR_I2SSTD_1                ,0x0020             @<Bit 1 */

.equ  SPI_I2SCFGR_PCMSYNC                 ,0x0080             @<PCM frame synchronization */

.equ  SPI_I2SCFGR_I2SCFG                  ,0x0300             @<I2SCFG[1:0] bits (I2S configuration mode) */
.equ  SPI_I2SCFGR_I2SCFG_0                ,0x0100             @<Bit 0 */
.equ  SPI_I2SCFGR_I2SCFG_1                ,0x0200             @<Bit 1 */

.equ  SPI_I2SCFGR_I2SE                    ,0x0400             @<I2S Enable */
.equ  SPI_I2SCFGR_I2SMOD                  ,0x0800             @<I2S mode selection */

@*****************  Bit definition for SPI_I2SPR register  *******************/
.equ  SPI_I2SPR_I2SDIV                    ,0x00FF             @<I2S Linear prescaler */
.equ  SPI_I2SPR_ODD                       ,0x0100             @<Odd factor for the prescaler */
.equ  SPI_I2SPR_MCKOE                     ,0x0200             @<Master Clock Output Enable */

@*****************************************************************************/
@                                                                            */
@                                 SYSCFG                                     */
@                                                                            */
@*****************************************************************************/
@*****************  Bit definition for SYSCFG_MEMRMP register  ***************/  
.equ SYSCFG_MEMRMP_MEM_MODE          ,0x00000003  @<SYSCFG_Memory Remap Config */
.equ SYSCFG_MEMRMP_MEM_MODE_0        ,0x00000001 
.equ SYSCFG_MEMRMP_MEM_MODE_1        ,0x00000002 

@*****************  Bit definition for SYSCFG_PMC register  ******************/
.equ SYSCFG_PMC_MII_RMII_SEL         ,0x00800000  @<Ethernet PHY interface selection */
@ Old MII_RMII_SEL bit definition, maintained for legacy purpose */
.equ SYSCFG_PMC_MII_RMII             ,SYSCFG_PMC_MII_RMII_SEL

@****************  Bit definition for SYSCFG_EXTICR1 register  ***************/
.equ SYSCFG_EXTICR1_EXTI0            ,0x000F  @<EXTI 0 configuration */
.equ SYSCFG_EXTICR1_EXTI1            ,0x00F0  @<EXTI 1 configuration */
.equ SYSCFG_EXTICR1_EXTI2            ,0x0F00  @<EXTI 2 configuration */
.equ SYSCFG_EXTICR1_EXTI3            ,0xF000  @<EXTI 3 configuration */
@* 
@* @brief   EXTI0 configuration  
@* 
.equ SYSCFG_EXTICR1_EXTI0_PA         ,0x0000  @<PA[0] pin */
.equ SYSCFG_EXTICR1_EXTI0_PB         ,0x0001  @<PB[0] pin */
.equ SYSCFG_EXTICR1_EXTI0_PC         ,0x0002  @<PC[0] pin */
.equ SYSCFG_EXTICR1_EXTI0_PD         ,0x0003  @<PD[0] pin */
.equ SYSCFG_EXTICR1_EXTI0_PE         ,0x0004  @<PE[0] pin */
.equ SYSCFG_EXTICR1_EXTI0_PF         ,0x0005  @<PF[0] pin */
.equ SYSCFG_EXTICR1_EXTI0_PG         ,0x0006  @<PG[0] pin */
.equ SYSCFG_EXTICR1_EXTI0_PH         ,0x0007  @<PH[0] pin */
.equ SYSCFG_EXTICR1_EXTI0_PI         ,0x0008  @<PI[0] pin */
@* 
@* @brief   EXTI1 configuration  
@* 
.equ SYSCFG_EXTICR1_EXTI1_PA         ,0x0000  @<PA[1] pin */
.equ SYSCFG_EXTICR1_EXTI1_PB         ,0x0010  @<PB[1] pin */
.equ SYSCFG_EXTICR1_EXTI1_PC         ,0x0020  @<PC[1] pin */
.equ SYSCFG_EXTICR1_EXTI1_PD         ,0x0030  @<PD[1] pin */
.equ SYSCFG_EXTICR1_EXTI1_PE         ,0x0040  @<PE[1] pin */
.equ SYSCFG_EXTICR1_EXTI1_PF         ,0x0050  @<PF[1] pin */
.equ SYSCFG_EXTICR1_EXTI1_PG         ,0x0060  @<PG[1] pin */
.equ SYSCFG_EXTICR1_EXTI1_PH         ,0x0070  @<PH[1] pin */
.equ SYSCFG_EXTICR1_EXTI1_PI         ,0x0080  @<PI[1] pin */
@* 
@* @brief   EXTI2 configuration  
@* 
.equ SYSCFG_EXTICR1_EXTI2_PA         ,0x0000  @<PA[2] pin */
.equ SYSCFG_EXTICR1_EXTI2_PB         ,0x0100  @<PB[2] pin */
.equ SYSCFG_EXTICR1_EXTI2_PC         ,0x0200  @<PC[2] pin */
.equ SYSCFG_EXTICR1_EXTI2_PD         ,0x0300  @<PD[2] pin */
.equ SYSCFG_EXTICR1_EXTI2_PE         ,0x0400  @<PE[2] pin */
.equ SYSCFG_EXTICR1_EXTI2_PF         ,0x0500  @<PF[2] pin */
.equ SYSCFG_EXTICR1_EXTI2_PG         ,0x0600  @<PG[2] pin */
.equ SYSCFG_EXTICR1_EXTI2_PH         ,0x0700  @<PH[2] pin */
.equ SYSCFG_EXTICR1_EXTI2_PI         ,0x0800  @<PI[2] pin */
@* 
@* @brief   EXTI3 configuration  
@* 
.equ SYSCFG_EXTICR1_EXTI3_PA         ,0x0000  @<PA[3] pin */
.equ SYSCFG_EXTICR1_EXTI3_PB         ,0x1000  @<PB[3] pin */
.equ SYSCFG_EXTICR1_EXTI3_PC         ,0x2000  @<PC[3] pin */
.equ SYSCFG_EXTICR1_EXTI3_PD         ,0x3000  @<PD[3] pin */
.equ SYSCFG_EXTICR1_EXTI3_PE         ,0x4000  @<PE[3] pin */
.equ SYSCFG_EXTICR1_EXTI3_PF         ,0x5000  @<PF[3] pin */
.equ SYSCFG_EXTICR1_EXTI3_PG         ,0x6000  @<PG[3] pin */
.equ SYSCFG_EXTICR1_EXTI3_PH         ,0x7000  @<PH[3] pin */
.equ SYSCFG_EXTICR1_EXTI3_PI         ,0x8000  @<PI[3] pin */
                                             
