ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
@****************  Bit definition for SYSCFG_EXTICR2 register  ***************/
.equ SYSCFG_EXTICR2_EXTI4            ,0x000F  @<EXTI 4 configuration */
.equ SYSCFG_EXTICR2_EXTI5            ,0x00F0  @<EXTI 5 configuration */
.equ SYSCFG_EXTICR2_EXTI6            ,0x0F00  @<EXTI 6 configuration */
.equ SYSCFG_EXTICR2_EXTI7            ,0xF000  @<EXTI 7 configuration */
@*                                           
@* @brief   EXTI4 configuration  
@* 
.equ SYSCFG_EXTICR2_EXTI4_PA         ,0x0000  @<PA[4] pin */
.equ SYSCFG_EXTICR2_EXTI4_PB         ,0x0001  @<PB[4] pin */
.equ SYSCFG_EXTICR2_EXTI4_PC         ,0x0002  @<PC[4] pin */
.equ SYSCFG_EXTICR2_EXTI4_PD         ,0x0003  @<PD[4] pin */
.equ SYSCFG_EXTICR2_EXTI4_PE         ,0x0004  @<PE[4] pin */
.equ SYSCFG_EXTICR2_EXTI4_PF         ,0x0005  @<PF[4] pin */
.equ SYSCFG_EXTICR2_EXTI4_PG         ,0x0006  @<PG[4] pin */
.equ SYSCFG_EXTICR2_EXTI4_PH         ,0x0007  @<PH[4] pin */
.equ SYSCFG_EXTICR2_EXTI4_PI         ,0x0008  @<PI[4] pin */
@* 
@* @brief   EXTI5 configuration  
@* 
.equ SYSCFG_EXTICR2_EXTI5_PA         ,0x0000  @<PA[5] pin */
.equ SYSCFG_EXTICR2_EXTI5_PB         ,0x0010  @<PB[5] pin */
.equ SYSCFG_EXTICR2_EXTI5_PC         ,0x0020  @<PC[5] pin */
.equ SYSCFG_EXTICR2_EXTI5_PD         ,0x0030  @<PD[5] pin */
.equ SYSCFG_EXTICR2_EXTI5_PE         ,0x0040  @<PE[5] pin */
.equ SYSCFG_EXTICR2_EXTI5_PF         ,0x0050  @<PF[5] pin */
.equ SYSCFG_EXTICR2_EXTI5_PG         ,0x0060  @<PG[5] pin */
.equ SYSCFG_EXTICR2_EXTI5_PH         ,0x0070  @<PH[5] pin */
.equ SYSCFG_EXTICR2_EXTI5_PI         ,0x0080  @<PI[5] pin */
@* 
@* @brief   EXTI6 configuration  
@* 
.equ SYSCFG_EXTICR2_EXTI6_PA         ,0x0000  @<PA[6] pin */
.equ SYSCFG_EXTICR2_EXTI6_PB         ,0x0100  @<PB[6] pin */
.equ SYSCFG_EXTICR2_EXTI6_PC         ,0x0200  @<PC[6] pin */
.equ SYSCFG_EXTICR2_EXTI6_PD         ,0x0300  @<PD[6] pin */
.equ SYSCFG_EXTICR2_EXTI6_PE         ,0x0400  @<PE[6] pin */
.equ SYSCFG_EXTICR2_EXTI6_PF         ,0x0500  @<PF[6] pin */
.equ SYSCFG_EXTICR2_EXTI6_PG         ,0x0600  @<PG[6] pin */
.equ SYSCFG_EXTICR2_EXTI6_PH         ,0x0700  @<PH[6] pin */
.equ SYSCFG_EXTICR2_EXTI6_PI         ,0x0800  @<PI[6] pin */
@* 
@* @brief   EXTI7 configuration  
@* 
.equ SYSCFG_EXTICR2_EXTI7_PA         ,0x0000  @<PA[7] pin */
.equ SYSCFG_EXTICR2_EXTI7_PB         ,0x1000  @<PB[7] pin */
.equ SYSCFG_EXTICR2_EXTI7_PC         ,0x2000  @<PC[7] pin */
.equ SYSCFG_EXTICR2_EXTI7_PD         ,0x3000  @<PD[7] pin */
.equ SYSCFG_EXTICR2_EXTI7_PE         ,0x4000  @<PE[7] pin */
.equ SYSCFG_EXTICR2_EXTI7_PF         ,0x5000  @<PF[7] pin */
.equ SYSCFG_EXTICR2_EXTI7_PG         ,0x6000  @<PG[7] pin */
.equ SYSCFG_EXTICR2_EXTI7_PH         ,0x7000  @<PH[7] pin */
.equ SYSCFG_EXTICR2_EXTI7_PI         ,0x8000  @<PI[7] pin */

@****************  Bit definition for SYSCFG_EXTICR3 register  ***************/
.equ SYSCFG_EXTICR3_EXTI8            ,0x000F  @<EXTI 8 configuration */
.equ SYSCFG_EXTICR3_EXTI9            ,0x00F0  @<EXTI 9 configuration */
.equ SYSCFG_EXTICR3_EXTI10           ,0x0F00  @<EXTI 10 configuration */
.equ SYSCFG_EXTICR3_EXTI11           ,0xF000  @<EXTI 11 configuration */
                                             
@* 
@* @brief   EXTI8 configuration  
@* 
.equ SYSCFG_EXTICR3_EXTI8_PA         ,0x0000  @<PA[8] pin */
.equ SYSCFG_EXTICR3_EXTI8_PB         ,0x0001  @<PB[8] pin */
.equ SYSCFG_EXTICR3_EXTI8_PC         ,0x0002  @<PC[8] pin */
.equ SYSCFG_EXTICR3_EXTI8_PD         ,0x0003  @<PD[8] pin */
.equ SYSCFG_EXTICR3_EXTI8_PE         ,0x0004  @<PE[8] pin */
.equ SYSCFG_EXTICR3_EXTI8_PF         ,0x0005  @<PF[8] pin */
.equ SYSCFG_EXTICR3_EXTI8_PG         ,0x0006  @<PG[8] pin */
.equ SYSCFG_EXTICR3_EXTI8_PH         ,0x0007  @<PH[8] pin */
.equ SYSCFG_EXTICR3_EXTI8_PI         ,0x0008  @<PI[8] pin */
@* 
@* @brief   EXTI9 configuration  
@* 
.equ SYSCFG_EXTICR3_EXTI9_PA         ,0x0000  @<PA[9] pin */
.equ SYSCFG_EXTICR3_EXTI9_PB         ,0x0010  @<PB[9] pin */
.equ SYSCFG_EXTICR3_EXTI9_PC         ,0x0020  @<PC[9] pin */
.equ SYSCFG_EXTICR3_EXTI9_PD         ,0x0030  @<PD[9] pin */
.equ SYSCFG_EXTICR3_EXTI9_PE         ,0x0040  @<PE[9] pin */
.equ SYSCFG_EXTICR3_EXTI9_PF         ,0x0050  @<PF[9] pin */
.equ SYSCFG_EXTICR3_EXTI9_PG         ,0x0060  @<PG[9] pin */
.equ SYSCFG_EXTICR3_EXTI9_PH         ,0x0070  @<PH[9] pin */
.equ SYSCFG_EXTICR3_EXTI9_PI         ,0x0080  @<PI[9] pin */
@* 
@* @brief   EXTI10 configuration  
@* 
.equ SYSCFG_EXTICR3_EXTI10_PA        ,0x0000  @<PA[10] pin */
.equ SYSCFG_EXTICR3_EXTI10_PB        ,0x0100  @<PB[10] pin */
.equ SYSCFG_EXTICR3_EXTI10_PC        ,0x0200  @<PC[10] pin */
.equ SYSCFG_EXTICR3_EXTI10_PD        ,0x0300  @<PD[10] pin */
.equ SYSCFG_EXTICR3_EXTI10_PE        ,0x0400  @<PE[10] pin */
.equ SYSCFG_EXTICR3_EXTI10_PF        ,0x0500  @<PF[10] pin */
.equ SYSCFG_EXTICR3_EXTI10_PG        ,0x0600  @<PG[10] pin */
.equ SYSCFG_EXTICR3_EXTI10_PH        ,0x0700  @<PH[10] pin */
.equ SYSCFG_EXTICR3_EXTI10_PI        ,0x0800  @<PI[10] pin */
@* 
@* @brief   EXTI11 configuration  
@* 
.equ SYSCFG_EXTICR3_EXTI11_PA        ,0x0000  @<PA[11] pin */
.equ SYSCFG_EXTICR3_EXTI11_PB        ,0x1000  @<PB[11] pin */
.equ SYSCFG_EXTICR3_EXTI11_PC        ,0x2000  @<PC[11] pin */
.equ SYSCFG_EXTICR3_EXTI11_PD        ,0x3000  @<PD[11] pin */
.equ SYSCFG_EXTICR3_EXTI11_PE        ,0x4000  @<PE[11] pin */
.equ SYSCFG_EXTICR3_EXTI11_PF        ,0x5000  @<PF[11] pin */
.equ SYSCFG_EXTICR3_EXTI11_PG        ,0x6000  @<PG[11] pin */
.equ SYSCFG_EXTICR3_EXTI11_PH        ,0x7000  @<PH[11] pin */
.equ SYSCFG_EXTICR3_EXTI11_PI        ,0x8000  @<PI[11] pin */

@****************  Bit definition for SYSCFG_EXTICR4 register  ***************/
.equ SYSCFG_EXTICR4_EXTI12           ,0x000F  @<EXTI 12 configuration */
.equ SYSCFG_EXTICR4_EXTI13           ,0x00F0  @<EXTI 13 configuration */
.equ SYSCFG_EXTICR4_EXTI14           ,0x0F00  @<EXTI 14 configuration */
.equ SYSCFG_EXTICR4_EXTI15           ,0xF000  @<EXTI 15 configuration */
@* 
@* @brief   EXTI12 configuration  
@* 
.equ SYSCFG_EXTICR4_EXTI12_PA        ,0x0000  @<PA[12] pin */
.equ SYSCFG_EXTICR4_EXTI12_PB        ,0x0001  @<PB[12] pin */
.equ SYSCFG_EXTICR4_EXTI12_PC        ,0x0002  @<PC[12] pin */
.equ SYSCFG_EXTICR4_EXTI12_PD        ,0x0003  @<PD[12] pin */
.equ SYSCFG_EXTICR4_EXTI12_PE        ,0x0004  @<PE[12] pin */
.equ SYSCFG_EXTICR4_EXTI12_PF        ,0x0005  @<PF[12] pin */
.equ SYSCFG_EXTICR4_EXTI12_PG        ,0x0006  @<PG[12] pin */
.equ SYSCFG_EXTICR3_EXTI12_PH        ,0x0007  @<PH[12] pin */
@* 
@* @brief   EXTI13 configuration  
@* 
.equ SYSCFG_EXTICR4_EXTI13_PA        ,0x0000  @<PA[13] pin */
.equ SYSCFG_EXTICR4_EXTI13_PB        ,0x0010  @<PB[13] pin */
.equ SYSCFG_EXTICR4_EXTI13_PC        ,0x0020  @<PC[13] pin */
.equ SYSCFG_EXTICR4_EXTI13_PD        ,0x0030  @<PD[13] pin */
.equ SYSCFG_EXTICR4_EXTI13_PE        ,0x0040  @<PE[13] pin */
.equ SYSCFG_EXTICR4_EXTI13_PF        ,0x0050  @<PF[13] pin */
.equ SYSCFG_EXTICR4_EXTI13_PG        ,0x0060  @<PG[13] pin */
.equ SYSCFG_EXTICR3_EXTI13_PH        ,0x0070  @<PH[13] pin */
@* 
@* @brief   EXTI14 configuration  
@* 
.equ SYSCFG_EXTICR4_EXTI14_PA        ,0x0000  @<PA[14] pin */
.equ SYSCFG_EXTICR4_EXTI14_PB        ,0x0100  @<PB[14] pin */
.equ SYSCFG_EXTICR4_EXTI14_PC        ,0x0200  @<PC[14] pin */
.equ SYSCFG_EXTICR4_EXTI14_PD        ,0x0300  @<PD[14] pin */
.equ SYSCFG_EXTICR4_EXTI14_PE        ,0x0400  @<PE[14] pin */
.equ SYSCFG_EXTICR4_EXTI14_PF        ,0x0500  @<PF[14] pin */
.equ SYSCFG_EXTICR4_EXTI14_PG        ,0x0600  @<PG[14] pin */
.equ SYSCFG_EXTICR3_EXTI14_PH        ,0x0700  @<PH[14] pin */
@* 
@* brief   EXTI15 configuration  
@* 
.equ SYSCFG_EXTICR4_EXTI15_PA        ,0x0000  @<PA[15] pin */
.equ SYSCFG_EXTICR4_EXTI15_PB        ,0x1000  @<PB[15] pin */
.equ SYSCFG_EXTICR4_EXTI15_PC        ,0x2000  @<PC[15] pin */
.equ SYSCFG_EXTICR4_EXTI15_PD        ,0x3000  @<PD[15] pin */
.equ SYSCFG_EXTICR4_EXTI15_PE        ,0x4000  @<PE[15] pin */
.equ SYSCFG_EXTICR4_EXTI15_PF        ,0x5000  @<PF[15] pin */
.equ SYSCFG_EXTICR4_EXTI15_PG        ,0x6000  @<PG[15] pin */
.equ SYSCFG_EXTICR3_EXTI15_PH        ,0x7000  @<PH[15] pin */

@*****************  Bit definition for SYSCFG_CMPCR register  ****************/  
.equ SYSCFG_CMPCR_CMP_PD             ,0x00000001  @<Compensation cell ready flag */
.equ SYSCFG_CMPCR_READY              ,0x00000100  @<Compensation cell power-down */

@******************************************************************************/
@*                                                                            */
@*                                    TIM                                     */
@*                                                                            */
@******************************************************************************/
@******************  Bit definition for TIM_CR1 register  ********************/
.equ  TIM_CR1_CEN                         ,0x0001             @<Counter enable */
.equ  TIM_CR1_UDIS                        ,0x0002             @<Update disable */
.equ  TIM_CR1_URS                         ,0x0004             @<Update request source */
.equ  TIM_CR1_OPM                         ,0x0008             @<One pulse mode */
.equ  TIM_CR1_DIR                         ,0x0010             @<Direction */

