ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
@******************  Bit definition for TIM_CCER register  *******************/
.equ  TIM_CCER_CC1E                       ,0x0001             @<Capture/Compare 1 output enable */
.equ  TIM_CCER_CC1P                       ,0x0002             @<Capture/Compare 1 output Polarity */
.equ  TIM_CCER_CC1NE                      ,0x0004             @<Capture/Compare 1 Complementary output enable */
.equ  TIM_CCER_CC1NP                      ,0x0008             @<Capture/Compare 1 Complementary output Polarity */
.equ  TIM_CCER_CC2E                       ,0x0010             @<Capture/Compare 2 output enable */
.equ  TIM_CCER_CC2P                       ,0x0020             @<Capture/Compare 2 output Polarity */
.equ  TIM_CCER_CC2NE                      ,0x0040             @<Capture/Compare 2 Complementary output enable */
.equ  TIM_CCER_CC2NP                      ,0x0080             @<Capture/Compare 2 Complementary output Polarity */
.equ  TIM_CCER_CC3E                       ,0x0100             @<Capture/Compare 3 output enable */
.equ  TIM_CCER_CC3P                       ,0x0200             @<Capture/Compare 3 output Polarity */
.equ  TIM_CCER_CC3NE                      ,0x0400             @<Capture/Compare 3 Complementary output enable */
.equ  TIM_CCER_CC3NP                      ,0x0800             @<Capture/Compare 3 Complementary output Polarity */
.equ  TIM_CCER_CC4E                       ,0x1000             @<Capture/Compare 4 output enable */
.equ  TIM_CCER_CC4P                       ,0x2000             @<Capture/Compare 4 output Polarity */
.equ  TIM_CCER_CC4NP                      ,0x8000             @<Capture/Compare 4 Complementary output Polarity */

@******************  Bit definition for TIM_CNT register  ********************/
.equ  TIM_CNT_CNT                         ,0xFFFF             @<Counter Value */

@******************  Bit definition for TIM_PSC register  ********************/
.equ  TIM_PSC_PSC                         ,0xFFFF             @<Prescaler Value */

@******************  Bit definition for TIM_ARR register  ********************/
.equ  TIM_ARR_ARR                         ,0xFFFF             @<actual auto-reload Value */

@******************  Bit definition for TIM_RCR register  ********************/
.equ  TIM_RCR_REP                         ,0xFF                @<Repetition Counter Value */

@******************  Bit definition for TIM_CCR1 register  *******************/
.equ  TIM_CCR1_CCR1                       ,0xFFFF             @<Capture/Compare 1 Value */

@******************  Bit definition for TIM_CCR2 register  *******************/
.equ  TIM_CCR2_CCR2                       ,0xFFFF             @<Capture/Compare 2 Value */

@******************  Bit definition for TIM_CCR3 register  *******************/
.equ  TIM_CCR3_CCR3                       ,0xFFFF             @<Capture/Compare 3 Value */

@******************  Bit definition for TIM_CCR4 register  *******************/
.equ  TIM_CCR4_CCR4                       ,0xFFFF             @<Capture/Compare 4 Value */

@******************  Bit definition for TIM_BDTR register  *******************/
.equ  TIM_BDTR_DTG                        ,0x00FF             @<DTG[0:7] bits (Dead-Time Generator set-up) */
.equ  TIM_BDTR_DTG_0                      ,0x0001             @<Bit 0 */
.equ  TIM_BDTR_DTG_1                      ,0x0002             @<Bit 1 */
.equ  TIM_BDTR_DTG_2                      ,0x0004             @<Bit 2 */
.equ  TIM_BDTR_DTG_3                      ,0x0008             @<Bit 3 */
.equ  TIM_BDTR_DTG_4                      ,0x0010             @<Bit 4 */
.equ  TIM_BDTR_DTG_5                      ,0x0020             @<Bit 5 */
.equ  TIM_BDTR_DTG_6                      ,0x0040             @<Bit 6 */
.equ  TIM_BDTR_DTG_7                      ,0x0080             @<Bit 7 */

.equ  TIM_BDTR_LOCK                       ,0x0300             @<LOCK[1:0] bits (Lock Configuration) */
.equ  TIM_BDTR_LOCK_0                     ,0x0100             @<Bit 0 */
.equ  TIM_BDTR_LOCK_1                     ,0x0200             @<Bit 1 */

.equ  TIM_BDTR_OSSI                       ,0x0400             @<Off-State Selection for Idle mode */
.equ  TIM_BDTR_OSSR                       ,0x0800             @<Off-State Selection for Run mode */
.equ  TIM_BDTR_BKE                        ,0x1000             @<Break enable */
.equ  TIM_BDTR_BKP                        ,0x2000             @<Break Polarity */
.equ  TIM_BDTR_AOE                        ,0x4000             @<Automatic Output enable */
.equ  TIM_BDTR_MOE                        ,0x8000             @<Main Output enable */

@******************  Bit definition for TIM_DCR register  ********************/
.equ  TIM_DCR_DBA                         ,0x001F             @<DBA[4:0] bits (DMA Base Address) */
.equ  TIM_DCR_DBA_0                       ,0x0001             @<Bit 0 */
.equ  TIM_DCR_DBA_1                       ,0x0002             @<Bit 1 */
.equ  TIM_DCR_DBA_2                       ,0x0004             @<Bit 2 */
.equ  TIM_DCR_DBA_3                       ,0x0008             @<Bit 3 */
.equ  TIM_DCR_DBA_4                       ,0x0010             @<Bit 4 */

.equ  TIM_DCR_DBL                         ,0x1F00             @<DBL[4:0] bits (DMA Burst Length) */
.equ  TIM_DCR_DBL_0                       ,0x0100             @<Bit 0 */
.equ  TIM_DCR_DBL_1                       ,0x0200             @<Bit 1 */
.equ  TIM_DCR_DBL_2                       ,0x0400             @<Bit 2 */
.equ  TIM_DCR_DBL_3                       ,0x0800             @<Bit 3 */
.equ  TIM_DCR_DBL_4                       ,0x1000             @<Bit 4 */

@******************  Bit definition for TIM_DMAR register  *******************/
.equ  TIM_DMAR_DMAB                       ,0xFFFF             @<DMA register for burst accesses */

@******************  Bit definition for TIM_OR register  *********************/
.equ TIM_OR_TI4_RMP                       ,0x00C0             @<TI4_RMP[1:0] bits (TIM5 Input 4 remap) */
.equ TIM_OR_TI4_RMP_0                     ,0x0040             @<Bit 0 */
.equ TIM_OR_TI4_RMP_1                     ,0x0080             @<Bit 1 */
.equ TIM_OR_ITR1_RMP                      ,0x0C00             @<ITR1_RMP[1:0] bits (TIM2 Internal trigger 1 remap) */
.equ TIM_OR_ITR1_RMP_0                    ,0x0400             @<Bit 0 */
.equ TIM_OR_ITR1_RMP_1                    ,0x0800             @<Bit 1 */


@******************************************************************************/
@*                                                                            */
@*         Universal Synchronous Asynchronous Receiver Transmitter            */
@*                                                                            */
@******************************************************************************/
@******************  Bit definition for USART_SR register  *******************/
.equ  USART_SR_PE                         ,0x0001             @<Parity Error */
.equ  USART_SR_FE                         ,0x0002             @<Framing Error */
.equ  USART_SR_NE                         ,0x0004             @<Noise Error Flag */
.equ  USART_SR_ORE                        ,0x0008             @<OverRun Error */
.equ  USART_SR_IDLE                       ,0x0010             @<IDLE line detected */
.equ  USART_SR_RXNE                       ,0x0020             @<Read Data Register Not Empty */
.equ  USART_SR_TC                         ,0x0040             @<Transmission Complete */
.equ  USART_SR_TXE                        ,0x0080             @<Transmit Data Register Empty */
.equ  USART_SR_LBD                        ,0x0100             @<LIN Break Detection Flag */
.equ  USART_SR_CTS                        ,0x0200             @<CTS Flag */

@******************  Bit definition for USART_DR register  *******************/
.equ  USART_DR_DR                         ,0x01FF             @<Data value */

