ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
@*****************  Bit definition for USART_BRR register  *******************/
.equ  USART_BRR_DIV_Fraction              ,0x000F             @<Fraction of USARTDIV */
.equ  USART_BRR_DIV_Mantissa              ,0xFFF0             @<Mantissa of USARTDIV */

@*****************  Bit definition for USART_CR1 register  *******************/
.equ  USART_CR1_SBK                       ,0x0001             @<Send Break */
.equ  USART_CR1_RWU                       ,0x0002             @<Receiver wakeup */
.equ  USART_CR1_RE                        ,0x0004             @<Receiver Enable */
.equ  USART_CR1_TE                        ,0x0008             @<Transmitter Enable */
.equ  USART_CR1_IDLEIE                    ,0x0010             @<IDLE Interrupt Enable */
.equ  USART_CR1_RXNEIE                    ,0x0020             @<RXNE Interrupt Enable */
.equ  USART_CR1_TCIE                      ,0x0040             @<Transmission Complete Interrupt Enable */
.equ  USART_CR1_TXEIE                     ,0x0080             @<PE Interrupt Enable */
.equ  USART_CR1_PEIE                      ,0x0100             @<PE Interrupt Enable */
.equ  USART_CR1_PS                        ,0x0200             @<Parity Selection */
.equ  USART_CR1_PCE                       ,0x0400             @<Parity Control Enable */
.equ  USART_CR1_WAKE                      ,0x0800             @<Wakeup method */
.equ  USART_CR1_M                         ,0x1000             @<Word length */
.equ  USART_CR1_UE                        ,0x2000             @<USART Enable */
.equ  USART_CR1_OVER8                     ,0x8000             @<USART Oversampling by 8 enable */

@*****************  Bit definition for USART_CR2 register  *******************/
.equ  USART_CR2_ADD                       ,0x000F             @<Address of the USART node */
.equ  USART_CR2_LBDL                      ,0x0020             @<LIN Break Detection Length */
.equ  USART_CR2_LBDIE                     ,0x0040             @<LIN Break Detection Interrupt Enable */
.equ  USART_CR2_LBCL                      ,0x0100             @<Last Bit Clock pulse */
.equ  USART_CR2_CPHA                      ,0x0200             @<Clock Phase */
.equ  USART_CR2_CPOL                      ,0x0400             @<Clock Polarity */
.equ  USART_CR2_CLKEN                     ,0x0800             @<Clock Enable */

.equ  USART_CR2_STOP                      ,0x3000             @<STOP[1:0] bits (STOP bits) */
.equ  USART_CR2_STOP_0                    ,0x1000             @<Bit 0 */
.equ  USART_CR2_STOP_1                    ,0x2000             @<Bit 1 */

.equ  USART_CR2_LINEN                     ,0x4000             @<LIN mode enable */

@*****************  Bit definition for USART_CR3 register  *******************/
.equ  USART_CR3_EIE                       ,0x0001             @<Error Interrupt Enable */
.equ  USART_CR3_IREN                      ,0x0002             @<IrDA mode Enable */
.equ  USART_CR3_IRLP                      ,0x0004             @<IrDA Low-Power */
.equ  USART_CR3_HDSEL                     ,0x0008             @<Half-Duplex Selection */
.equ  USART_CR3_NACK                      ,0x0010             @<Smartcard NACK enable */
.equ  USART_CR3_SCEN                      ,0x0020             @<Smartcard mode enable */
.equ  USART_CR3_DMAR                      ,0x0040             @<DMA Enable Receiver */
.equ  USART_CR3_DMAT                      ,0x0080             @<DMA Enable Transmitter */
.equ  USART_CR3_RTSE                      ,0x0100             @<RTS Enable */
.equ  USART_CR3_CTSE                      ,0x0200             @<CTS Enable */
.equ  USART_CR3_CTSIE                     ,0x0400             @<CTS Interrupt Enable */
.equ  USART_CR3_ONEBIT                    ,0x0800             @<USART One bit method enable */

@*****************  Bit definition for USART_GTPR register  ******************/
.equ  USART_GTPR_PSC                      ,0x00FF             @<PSC[7:0] bits (Prescaler value) */
.equ  USART_GTPR_PSC_0                    ,0x0001             @<Bit 0 */
.equ  USART_GTPR_PSC_1                    ,0x0002             @<Bit 1 */
.equ  USART_GTPR_PSC_2                    ,0x0004             @<Bit 2 */
.equ  USART_GTPR_PSC_3                    ,0x0008             @<Bit 3 */
.equ  USART_GTPR_PSC_4                    ,0x0010             @<Bit 4 */
.equ  USART_GTPR_PSC_5                    ,0x0020             @<Bit 5 */
.equ  USART_GTPR_PSC_6                    ,0x0040             @<Bit 6 */
.equ  USART_GTPR_PSC_7                    ,0x0080             @<Bit 7 */

.equ  USART_GTPR_GT                       ,0xFF00             @<Guard time value */

@******************************************************************************/
@*                                                                            */
@*                            Window WATCHDOG                                 */
@*                                                                            */
@******************************************************************************/
@******************  Bit definition for WWDG_CR register  ********************/
.equ  WWDG_CR_T                           ,0x7F                @<T[6:0] bits (7-Bit counter (MSB to LSB)) */
.equ  WWDG_CR_T0                          ,0x01                @<Bit 0 */
.equ  WWDG_CR_T1                          ,0x02                @<Bit 1 */
.equ  WWDG_CR_T2                          ,0x04                @<Bit 2 */
.equ  WWDG_CR_T3                          ,0x08                @<Bit 3 */
.equ  WWDG_CR_T4                          ,0x10                @<Bit 4 */
.equ  WWDG_CR_T5                          ,0x20                @<Bit 5 */
.equ  WWDG_CR_T6                          ,0x40                @<Bit 6 */

.equ  WWDG_CR_WDGA                        ,0x80                @<Activation bit */

@******************  Bit definition for WWDG_CFR register  *******************/
.equ  WWDG_CFR_W                          ,0x007F             @<W[6:0] bits (7-bit window value) */
.equ  WWDG_CFR_W0                         ,0x0001             @<Bit 0 */
.equ  WWDG_CFR_W1                         ,0x0002             @<Bit 1 */
.equ  WWDG_CFR_W2                         ,0x0004             @<Bit 2 */
.equ  WWDG_CFR_W3                         ,0x0008             @<Bit 3 */
.equ  WWDG_CFR_W4                         ,0x0010             @<Bit 4 */
.equ  WWDG_CFR_W5                         ,0x0020             @<Bit 5 */
.equ  WWDG_CFR_W6                         ,0x0040             @<Bit 6 */

