ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
@ Bit definition for Ethernet MAC Hash Table Low Register */
.equ ETH_MACHTLR_HTL   ,0xFFFFFFFF       @ Hash table low */

@ Bit definition for Ethernet MAC MII Address Register */
.equ ETH_MACMIIAR_PA   ,0x0000F800       @ Physical layer address */ 
.equ ETH_MACMIIAR_MR   ,0x000007C0       @ MII register in the selected PHY */ 
.equ ETH_MACMIIAR_CR   ,0x0000001C       @ CR clock range: 6 cases */ 
.equ ETH_MACMIIAR_CR_Div42   ,0x00000000       @ HCLK:60-100 MHz; MDC clock= HCLK/42 */
.equ ETH_MACMIIAR_CR_Div62   ,0x00000004       @ HCLK:100-150 MHz; MDC clock= HCLK/62 */
.equ ETH_MACMIIAR_CR_Div16   ,0x00000008       @ HCLK:20-35 MHz; MDC clock= HCLK/16 */
.equ ETH_MACMIIAR_CR_Div26   ,0x0000000C       @ HCLK:35-60 MHz; MDC clock= HCLK/26 */
.equ ETH_MACMIIAR_CR_Div102  ,0x00000010       @ HCLK:150-168 MHz; MDC clock= HCLK/102 */  
.equ ETH_MACMIIAR_MW   ,0x00000002       @ MII write */ 
.equ ETH_MACMIIAR_MB   ,0x00000001       @ MII busy */ 
  
@ Bit definition for Ethernet MAC MII Data Register */
.equ ETH_MACMIIDR_MD   ,0x0000FFFF       @ MII data: read/write data from/to PHY */

@ Bit definition for Ethernet MAC Flow Control Register */
.equ ETH_MACFCR_PT     ,0xFFFF0000       @ Pause time */
.equ ETH_MACFCR_ZQPD   ,0x00000080       @ Zero-quanta pause disable */
.equ ETH_MACFCR_PLT    ,0x00000030       @ Pause low threshold: 4 cases */
.equ ETH_MACFCR_PLT_Minus4   ,0x00000000       @ Pause time minus 4 slot times */
.equ ETH_MACFCR_PLT_Minus28  ,0x00000010       @ Pause time minus 28 slot times */
.equ ETH_MACFCR_PLT_Minus144 ,0x00000020       @ Pause time minus 144 slot times */
.equ ETH_MACFCR_PLT_Minus256 ,0x00000030       @ Pause time minus 256 slot times */      
.equ ETH_MACFCR_UPFD   ,0x00000008       @ Unicast pause frame detect */
.equ ETH_MACFCR_RFCE   ,0x00000004       @ Receive flow control enable */
.equ ETH_MACFCR_TFCE   ,0x00000002       @ Transmit flow control enable */
.equ ETH_MACFCR_FCBBPA ,0x00000001       @ Flow control busy/backpressure activate */

@ Bit definition for Ethernet MAC VLAN Tag Register */
.equ ETH_MACVLANTR_VLANTC ,0x00010000       @ 12-bit VLAN tag comparison */
.equ ETH_MACVLANTR_VLANTI ,0x0000FFFF       @ VLAN tag identifier (for receive frames) */

@ Bit definition for Ethernet MAC Remote Wake-UpFrame Filter Register */ 
.equ ETH_MACRWUFFR_D   ,0xFFFFFFFF       @ Wake-up frame filter register data */
@ Eight sequential Writes to this address (offset 0x28) will write all Wake-UpFrame Filter Registers.
@ Eight sequential Reads from this address (offset 0x28) will read all Wake-UpFrame Filter Registers. */
@ Wake-UpFrame Filter Reg0 : Filter 0 Byte Mask
@ Wake-UpFrame Filter Reg1 : Filter 1 Byte Mask
@ Wake-UpFrame Filter Reg2 : Filter 2 Byte Mask
@ Wake-UpFrame Filter Reg3 : Filter 3 Byte Mask
@ Wake-UpFrame Filter Reg4 : RSVD - Filter3 Command - RSVD - Filter2 Command - 
@                            RSVD - Filter1 Command - RSVD - Filter0 Command
@ Wake-UpFrame Filter Re5 : Filter3 Offset - Filter2 Offset - Filter1 Offset - Filter0 Offset
@ Wake-UpFrame Filter Re6 : Filter1 CRC16 - Filter0 CRC16
@ Wake-UpFrame Filter Re7 : Filter3 CRC16 - Filter2 CRC16 */

@ Bit definition for Ethernet MAC PMT Control and Status Register */ 
.equ ETH_MACPMTCSR_WFFRPR ,0x80000000       @ Wake-Up Frame Filter Register Pointer Reset */
.equ ETH_MACPMTCSR_GU     ,0x00000200       @ Global Unicast */
.equ ETH_MACPMTCSR_WFR    ,0x00000040       @ Wake-Up Frame Received */
.equ ETH_MACPMTCSR_MPR    ,0x00000020       @ Magic Packet Received */
.equ ETH_MACPMTCSR_WFE    ,0x00000004       @ Wake-Up Frame Enable */
.equ ETH_MACPMTCSR_MPE    ,0x00000002       @ Magic Packet Enable */
.equ ETH_MACPMTCSR_PD     ,0x00000001       @ Power Down */

@ Bit definition for Ethernet MAC Status Register */
.equ ETH_MACSR_TSTS      ,0x00000200       @ Time stamp trigger status */
.equ ETH_MACSR_MMCTS     ,0x00000040       @ MMC transmit status */
.equ ETH_MACSR_MMMCRS    ,0x00000020       @ MMC receive status */
.equ ETH_MACSR_MMCS      ,0x00000010       @ MMC status */
.equ ETH_MACSR_PMTS      ,0x00000008       @ PMT status */

@ Bit definition for Ethernet MAC Interrupt Mask Register */
.equ ETH_MACIMR_TSTIM     ,0x00000200       @ Time stamp trigger interrupt mask */
.equ ETH_MACIMR_PMTIM     ,0x00000008       @ PMT interrupt mask */

@ Bit definition for Ethernet MAC Address0 High Register */
.equ ETH_MACA0HR_MACA0H   ,0x0000FFFF       @ MAC address0 high */

@ Bit definition for Ethernet MAC Address0 Low Register */
.equ ETH_MACA0LR_MACA0L   ,0xFFFFFFFF       @ MAC address0 low */

@ Bit definition for Ethernet MAC Address1 High Register */
.equ ETH_MACA1HR_AE       ,0x80000000       @ Address enable */
.equ ETH_MACA1HR_SA       ,0x40000000       @ Source address */
.equ ETH_MACA1HR_MBC      ,0x3F000000       @ Mask byte control: bits to mask for comparison of the MAC Address bytes */
.equ ETH_MACA1HR_MBC_HBits15_8    ,0x20000000       @ Mask MAC Address high reg bits [15:8] */
.equ ETH_MACA1HR_MBC_HBits7_0     ,0x10000000       @ Mask MAC Address high reg bits [7:0] */
.equ ETH_MACA1HR_MBC_LBits31_24   ,0x08000000       @ Mask MAC Address low reg bits [31:24] */
.equ ETH_MACA1HR_MBC_LBits23_16   ,0x04000000       @ Mask MAC Address low reg bits [23:16] */
.equ ETH_MACA1HR_MBC_LBits15_8    ,0x02000000       @ Mask MAC Address low reg bits [15:8] */
.equ ETH_MACA1HR_MBC_LBits7_0     ,0x01000000       @ Mask MAC Address low reg bits [7:0] */ 
.equ ETH_MACA1HR_MACA1H   ,0x0000FFFF       @ MAC address1 high */

@ Bit definition for Ethernet MAC Address1 Low Register */
.equ ETH_MACA1LR_MACA1L   ,0xFFFFFFFF       @ MAC address1 low */

@ Bit definition for Ethernet MAC Address2 High Register */
.equ ETH_MACA2HR_AE       ,0x80000000       @ Address enable */
.equ ETH_MACA2HR_SA       ,0x40000000       @ Source address */
.equ ETH_MACA2HR_MBC      ,0x3F000000       @ Mask byte control */
.equ ETH_MACA2HR_MBC_HBits15_8    ,0x20000000       @ Mask MAC Address high reg bits [15:8] */
.equ ETH_MACA2HR_MBC_HBits7_0     ,0x10000000       @ Mask MAC Address high reg bits [7:0] */
.equ ETH_MACA2HR_MBC_LBits31_24   ,0x08000000       @ Mask MAC Address low reg bits [31:24] */
.equ ETH_MACA2HR_MBC_LBits23_16   ,0x04000000       @ Mask MAC Address low reg bits [23:16] */
.equ ETH_MACA2HR_MBC_LBits15_8    ,0x02000000       @ Mask MAC Address low reg bits [15:8] */
.equ ETH_MACA2HR_MBC_LBits7_0     ,0x01000000       @ Mask MAC Address low reg bits [70] */
.equ ETH_MACA2HR_MACA2H   ,0x0000FFFF       @ MAC address1 high */

@ Bit definition for Ethernet MAC Address2 Low Register */
.equ ETH_MACA2LR_MACA2L   ,0xFFFFFFFF       @ MAC address2 low */

@ Bit definition for Ethernet MAC Address3 High Register */
.equ ETH_MACA3HR_AE       ,0x80000000       @ Address enable */
.equ ETH_MACA3HR_SA       ,0x40000000       @ Source address */
.equ ETH_MACA3HR_MBC      ,0x3F000000       @ Mask byte control */
.equ ETH_MACA3HR_MBC_HBits15_8    ,0x20000000       @ Mask MAC Address high reg bits [15:8] */
.equ ETH_MACA3HR_MBC_HBits7_0     ,0x10000000       @ Mask MAC Address high reg bits [7:0] */
.equ ETH_MACA3HR_MBC_LBits31_24   ,0x08000000       @ Mask MAC Address low reg bits [31:24] */
.equ ETH_MACA3HR_MBC_LBits23_16   ,0x04000000       @ Mask MAC Address low reg bits [23:16] */
.equ ETH_MACA3HR_MBC_LBits15_8    ,0x02000000       @ Mask MAC Address low reg bits [15:8] */
.equ ETH_MACA3HR_MBC_LBits7_0     ,0x01000000       @ Mask MAC Address low reg bits [70] */
.equ ETH_MACA3HR_MACA3H   ,0x0000FFFF       @ MAC address3 high */

@ Bit definition for Ethernet MAC Address3 Low Register */
.equ ETH_MACA3LR_MACA3L   ,0xFFFFFFFF       @ MAC address3 low */

@******************************************************************************/
@*                Ethernet MMC Registers bits definition                      */
@******************************************************************************/

@ Bit definition for Ethernet MMC Contol Register */
.equ ETH_MMCCR_MCFHP      ,0x00000020       @ MMC counter Full-Half preset */
.equ ETH_MMCCR_MCP        ,0x00000010       @ MMC counter preset */
.equ ETH_MMCCR_MCF        ,0x00000008       @ MMC Counter Freeze */
.equ ETH_MMCCR_ROR        ,0x00000004       @ Reset on Read */
.equ ETH_MMCCR_CSR        ,0x00000002       @ Counter Stop Rollover */
.equ ETH_MMCCR_CR         ,0x00000001       @ Counters Reset */

@ Bit definition for Ethernet MMC Receive Interrupt Register */
.equ ETH_MMCRIR_RGUFS     ,0x00020000       @ Set when Rx good unicast frames counter reaches half the maximum value */
.equ ETH_MMCRIR_RFAES     ,0x00000040       @ Set when Rx alignment error counter reaches half the maximum value */
.equ ETH_MMCRIR_RFCES     ,0x00000020       @ Set when Rx crc error counter reaches half the maximum value */

@ Bit definition for Ethernet MMC Transmit Interrupt Register */
.equ ETH_MMCTIR_TGFS      ,0x00200000       @ Set when Tx good frame count counter reaches half the maximum value */
.equ ETH_MMCTIR_TGFMSCS   ,0x00008000       @ Set when Tx good multi col counter reaches half the maximum value */
.equ ETH_MMCTIR_TGFSCS    ,0x00004000       @ Set when Tx good single col counter reaches half the maximum value */

