ogneyar/AsmStudy/STM32asm/Examples/stm32f40x.inc
@ Bit definition for Ethernet MMC Receive Interrupt Mask Register */
.equ ETH_MMCRIMR_RGUFM    ,0x00020000       @ Mask the interrupt when Rx good unicast frames counter reaches half the maximum value */
.equ ETH_MMCRIMR_RFAEM    ,0x00000040       @ Mask the interrupt when when Rx alignment error counter reaches half the maximum value */
.equ ETH_MMCRIMR_RFCEM    ,0x00000020       @ Mask the interrupt when Rx crc error counter reaches half the maximum value */

@ Bit definition for Ethernet MMC Transmit Interrupt Mask Register */
.equ ETH_MMCTIMR_TGFM     ,0x00200000       @ Mask the interrupt when Tx good frame count counter reaches half the maximum value */
.equ ETH_MMCTIMR_TGFMSCM  ,0x00008000       @ Mask the interrupt when Tx good multi col counter reaches half the maximum value */
.equ ETH_MMCTIMR_TGFSCM   ,0x00004000       @ Mask the interrupt when Tx good single col counter reaches half the maximum value */

@ Bit definition for Ethernet MMC Transmitted Good Frames after Single Collision Counter Register */
.equ ETH_MMCTGFSCCR_TGFSCC     ,0xFFFFFFFF       @ Number of successfully transmitted frames after a single collision in Half-duplex mode. */

@ Bit definition for Ethernet MMC Transmitted Good Frames after More than a Single Collision Counter Register */
.equ ETH_MMCTGFMSCCR_TGFMSCC   ,0xFFFFFFFF       @ Number of successfully transmitted frames after more than a single collision in Half-duplex mode. */

@ Bit definition for Ethernet MMC Transmitted Good Frames Counter Register */
.equ ETH_MMCTGFCR_TGFC    ,0xFFFFFFFF       @ Number of good frames transmitted. */

@ Bit definition for Ethernet MMC Received Frames with CRC Error Counter Register */
.equ ETH_MMCRFCECR_RFCEC  ,0xFFFFFFFF       @ Number of frames received with CRC error. */

@ Bit definition for Ethernet MMC Received Frames with Alignement Error Counter Register */
.equ ETH_MMCRFAECR_RFAEC  ,0xFFFFFFFF       @ Number of frames received with alignment (dribble) error */

@ Bit definition for Ethernet MMC Received Good Unicast Frames Counter Register */
.equ ETH_MMCRGUFCR_RGUFC  ,0xFFFFFFFF       @ Number of good unicast frames received. */

@******************************************************************************/
@*               Ethernet PTP Registers bits definition                       */
@******************************************************************************/

@ Bit definition for Ethernet PTP Time Stamp Contol Register */
.equ ETH_PTPTSCR_TSCNT       ,0x00030000       @ Time stamp clock node type */
.equ ETH_PTPTSSR_TSSMRME     ,0x00008000       @ Time stamp snapshot for message relevant to master enable */
.equ ETH_PTPTSSR_TSSEME      ,0x00004000       @ Time stamp snapshot for event message enable */
.equ ETH_PTPTSSR_TSSIPV4FE   ,0x00002000       @ Time stamp snapshot for IPv4 frames enable */
.equ ETH_PTPTSSR_TSSIPV6FE   ,0x00001000       @ Time stamp snapshot for IPv6 frames enable */
.equ ETH_PTPTSSR_TSSPTPOEFE  ,0x00000800       @ Time stamp snapshot for PTP over ethernet frames enable */
.equ ETH_PTPTSSR_TSPTPPSV2E  ,0x00000400       @ Time stamp PTP packet snooping for version2 format enable */
.equ ETH_PTPTSSR_TSSSR       ,0x00000200       @ Time stamp Sub-seconds rollover */
.equ ETH_PTPTSSR_TSSARFE     ,0x00000100       @ Time stamp snapshot for all received frames enable */

.equ ETH_PTPTSCR_TSARU    ,0x00000020       @ Addend register update */
.equ ETH_PTPTSCR_TSITE    ,0x00000010       @ Time stamp interrupt trigger enable */
.equ ETH_PTPTSCR_TSSTU    ,0x00000008       @ Time stamp update */
.equ ETH_PTPTSCR_TSSTI    ,0x00000004       @ Time stamp initialize */
.equ ETH_PTPTSCR_TSFCU    ,0x00000002       @ Time stamp fine or coarse update */
.equ ETH_PTPTSCR_TSE      ,0x00000001       @ Time stamp enable */

@ Bit definition for Ethernet PTP Sub-Second Increment Register */
.equ ETH_PTPSSIR_STSSI    ,0x000000FF       @ System time Sub-second increment value */

@ Bit definition for Ethernet PTP Time Stamp High Register */
.equ ETH_PTPTSHR_STS      ,0xFFFFFFFF       @ System Time second */

@ Bit definition for Ethernet PTP Time Stamp Low Register */
.equ ETH_PTPTSLR_STPNS    ,0x80000000       @ System Time Positive or negative time */
.equ ETH_PTPTSLR_STSS     ,0x7FFFFFFF       @ System Time sub-seconds */

@ Bit definition for Ethernet PTP Time Stamp High Update Register */
.equ ETH_PTPTSHUR_TSUS    ,0xFFFFFFFF       @ Time stamp update seconds */

@ Bit definition for Ethernet PTP Time Stamp Low Update Register */
.equ ETH_PTPTSLUR_TSUPNS  ,0x80000000       @ Time stamp update Positive or negative time */
.equ ETH_PTPTSLUR_TSUSS   ,0x7FFFFFFF       @ Time stamp update sub-seconds */

@ Bit definition for Ethernet PTP Time Stamp Addend Register */
.equ ETH_PTPTSAR_TSA      ,0xFFFFFFFF       @ Time stamp addend */

@ Bit definition for Ethernet PTP Target Time High Register */
.equ ETH_PTPTTHR_TTSH     ,0xFFFFFFFF       @ Target time stamp high */

@ Bit definition for Ethernet PTP Target Time Low Register */
.equ ETH_PTPTTLR_TTSL     ,0xFFFFFFFF       @ Target time stamp low */

@ Bit definition for Ethernet PTP Time Stamp Status Register */
.equ ETH_PTPTSSR_TSTTR    ,0x00000020       @ Time stamp target time reached */
.equ ETH_PTPTSSR_TSSO     ,0x00000010       @ Time stamp seconds overflow */

@*****************************************************************************/
@                 Ethernet DMA Registers bits definition                     */
@*****************************************************************************/

@ Bit definition for Ethernet DMA Bus Mode Register */
.equ ETH_DMABMR_AAB       ,0x02000000       @ Address-Aligned beats */
.equ ETH_DMABMR_FPM        ,0x01000000       @ 4xPBL mode */
.equ ETH_DMABMR_USP       ,0x00800000       @ Use separate PBL */
.equ ETH_DMABMR_RDP       ,0x007E0000       @ RxDMA PBL */
.equ ETH_DMABMR_RDP_1Beat    ,0x00020000       @ maximum number of beats to be transferred in one RxDMA transaction is 1 */
.equ ETH_DMABMR_RDP_2Beat    ,0x00040000       @ maximum number of beats to be transferred in one RxDMA transaction is 2 */
.equ ETH_DMABMR_RDP_4Beat    ,0x00080000       @ maximum number of beats to be transferred in one RxDMA transaction is 4 */
.equ ETH_DMABMR_RDP_8Beat    ,0x00100000       @ maximum number of beats to be transferred in one RxDMA transaction is 8 */
.equ ETH_DMABMR_RDP_16Beat   ,0x00200000       @ maximum number of beats to be transferred in one RxDMA transaction is 16 */
.equ ETH_DMABMR_RDP_32Beat   ,0x00400000       @ maximum number of beats to be transferred in one RxDMA transaction is 32 */                
.equ ETH_DMABMR_RDP_4xPBL_4Beat   ,0x01020000       @ maximum number of beats to be transferred in one RxDMA transaction is 4 */
.equ ETH_DMABMR_RDP_4xPBL_8Beat   ,0x01040000       @ maximum number of beats to be transferred in one RxDMA transaction is 8 */
.equ ETH_DMABMR_RDP_4xPBL_16Beat  ,0x01080000       @ maximum number of beats to be transferred in one RxDMA transaction is 16 */
.equ ETH_DMABMR_RDP_4xPBL_32Beat  ,0x01100000       @ maximum number of beats to be transferred in one RxDMA transaction is 32 */
.equ ETH_DMABMR_RDP_4xPBL_64Beat  ,0x01200000       @ maximum number of beats to be transferred in one RxDMA transaction is 64 */
.equ ETH_DMABMR_RDP_4xPBL_128Beat ,0x01400000       @ maximum number of beats to be transferred in one RxDMA transaction is 128 */  
.equ ETH_DMABMR_FB        ,0x00010000       @ Fixed Burst */
.equ ETH_DMABMR_RTPR      ,0x0000C000       @ Rx Tx priority ratio */
.equ ETH_DMABMR_RTPR_1_1     ,0x00000000       @ Rx Tx priority ratio */
.equ ETH_DMABMR_RTPR_2_1     ,0x00004000       @ Rx Tx priority ratio */
.equ ETH_DMABMR_RTPR_3_1     ,0x00008000       @ Rx Tx priority ratio */
.equ ETH_DMABMR_RTPR_4_1     ,0x0000C000       @ Rx Tx priority ratio */  
.equ ETH_DMABMR_PBL    ,0x00003F00       @ Programmable burst length */
.equ ETH_DMABMR_PBL_1Beat    ,0x00000100       @ maximum number of beats to be transferred in one TxDMA (or both) transaction is 1 */
.equ ETH_DMABMR_PBL_2Beat    ,0x00000200       @ maximum number of beats to be transferred in one TxDMA (or both) transaction is 2 */
.equ ETH_DMABMR_PBL_4Beat    ,0x00000400       @ maximum number of beats to be transferred in one TxDMA (or both) transaction is 4 */
.equ ETH_DMABMR_PBL_8Beat    ,0x00000800       @ maximum number of beats to be transferred in one TxDMA (or both) transaction is 8 */
.equ ETH_DMABMR_PBL_16Beat   ,0x00001000       @ maximum number of beats to be transferred in one TxDMA (or both) transaction is 16 */
.equ ETH_DMABMR_PBL_32Beat   ,0x00002000       @ maximum number of beats to be transferred in one TxDMA (or both) transaction is 32 */                
.equ ETH_DMABMR_PBL_4xPBL_4Beat   ,0x01000100       @ maximum number of beats to be transferred in one TxDMA (or both) transaction is 4 */
.equ ETH_DMABMR_PBL_4xPBL_8Beat   ,0x01000200       @ maximum number of beats to be transferred in one TxDMA (or both) transaction is 8 */
.equ ETH_DMABMR_PBL_4xPBL_16Beat  ,0x01000400       @ maximum number of beats to be transferred in one TxDMA (or both) transaction is 16 */
.equ ETH_DMABMR_PBL_4xPBL_32Beat  ,0x01000800       @ maximum number of beats to be transferred in one TxDMA (or both) transaction is 32 */
.equ ETH_DMABMR_PBL_4xPBL_64Beat  ,0x01001000       @ maximum number of beats to be transferred in one TxDMA (or both) transaction is 64 */
.equ ETH_DMABMR_PBL_4xPBL_128Beat ,0x01002000       @ maximum number of beats to be transferred in one TxDMA (or both) transaction is 128 */
.equ ETH_DMABMR_EDE       ,0x00000080       @ Enhanced Descriptor Enable */
.equ ETH_DMABMR_DSL       ,0x0000007C       @ Descriptor Skip Length */
.equ ETH_DMABMR_DA        ,0x00000002       @ DMA arbitration scheme */
.equ ETH_DMABMR_SR        ,0x00000001       @ Software reset */

@ Bit definition for Ethernet DMA Transmit Poll Demand Register */
.equ ETH_DMATPDR_TPD      ,0xFFFFFFFF       @ Transmit poll demand */

@ Bit definition for Ethernet DMA Receive Poll Demand Register */
.equ ETH_DMARPDR_RPD      ,0xFFFFFFFF       @ Receive poll demand  */

